module faker.faker_zh_cn;

import std.random;
import std.array;
import std.format;
import std.conv : to;
import std.string : toUpper;
import std.range : iota, take, repeat;
import std.algorithm : map, joiner;
import faker.base;

class Faker_zh_cn : Faker {
@safe:
	this(int seed) {
		super(seed);
	}

	override string animalBear() {
		const string[] strs =
		[ q"{大熊猫}", q"{眼镜熊}", q"{太阳熊}", q"{懒熊}", q"{美洲黑熊}", q"{亚洲黑熊}"
		, q"{棕熊}", q"{北极熊}" ];

		return choice(strs, this.rnd);
	}

	override string animalCat() {
		const string[] strs =
		[ q"{中华田园猫}", q"{中国狸花猫}", q"{山东狮子猫}", q"{玄猫}", q"{黑白花猫}"
		, q"{三花猫}", q"{玳瑁猫}", q"{橘猫}", q"{四川简州猫}", q"{中国大白猫}"
		, q"{美国短毛猫}", q"{英国短毛猫}", q"{加菲猫}", q"{波斯猫}", q"{布偶猫}"
		, q"{苏格兰折耳猫}", q"{暹罗猫}", q"{斯芬克斯猫}", q"{德文卷毛猫}"
		, q"{阿比西尼亚猫}" ];

		return choice(strs, this.rnd);
	}

	override string animalDog() {
		const string[] strs =
		[ q"{藏獒}", q"{袖狗}", q"{拉萨狮子犬}", q"{西藏狮子犬}", q"{松狮犬}", q"{中国冠毛犬}"
		, q"{西施犬}", q"{沙皮犬}", q"{八哥犬}", q"{西藏獚}", q"{中华田园犬}", q"{下司犬}"
		, q"{北京犬}", q"{西藏梗}", q"{柴犬}", q"{哈士奇}", q"{德国牧羊犬}", q"{边境牧羊犬}"
		, q"{贵兵犬}", q"{秋田犬}", q"{罗威纳犬}", q"{蝴蝶犬}", q"{英国斗牛犬}"
		, q"{阿富汗猎犬}", q"{萨摩耶犬}", q"{大白熊犬}", q"{比利时牧羊犬}"
		, q"{美国爱斯基摩犬}", q"{彭布罗克威尔士柯基犬}", q"{墨西哥无毛犬}" ];

		return choice(strs, this.rnd);
	}

	override string animalFish() {
		const string[] strs =
		[ q"{草鱼}", q"{鲶鱼}", q"{鳙鱼}", q"{鲤鱼}", q"{金鱼}", q"{胭脂鱼}", q"{中华鲟}"
		, q"{长江白鲟}", q"{新疆大头鱼}", q"{青鱼}", q"{鲫鱼}" ];

		return choice(strs, this.rnd);
	}

	override string animalHorse() {
		const string[] strs =
		[ q"{蒙古马}", q"{伊利马}", q"{三河马}", q"{河曲马}" ];

		return choice(strs, this.rnd);
	}

	override string commerceProductDescription() {
		const string[] strs =
		[ q"{人体工学椅电脑椅家用宿舍学生学习椅舒适久坐办公座椅转椅书桌椅}"
		, q"{鼠标有线USB静音无声家用办公台式笔记本电脑家用商务电竞男}", q"{台式电脑机械硬盘SATA串口320G 500G 1TB 2T 3TB 4TB支持游戏监控}"
		, q"{【2023新品官方旗舰正品】DERE戴睿笔记本电脑二合一新Surface Pro13平板商务办公学生教育超轻薄便携电脑本}", q"{华为笔记本电脑MateBook X Pro 2023 13代酷睿版锐炬显卡14.2英寸3.1K原色触控屏超轻薄旗舰微绒典藏1943}"
		, q"{可选16G【M2芯片】Apple/苹果 MacBook Pro 13英寸笔记本电脑剪辑设计大学生办公专用正品分期24G}", q"{Sony/索尼 XR-55A80EK 55英寸4K超清认知智能OLED安卓摄像头电视}"
		, q"{小米电视 Redmi A43 高清智能电视 43英寸液晶平板电视L43RA-RA}", q"{【新品享壕礼】vivo iQOO Z8x手机官方旗舰店新品上市官网正品学生大电池大内存手机iqoo z7 z7x}"
		, q"{【至高立省300元 赠数据线】vivo Y78新品全面屏游戏拍照学生5G智能手机大电池官方旗舰店老人机Y78+ Y77}" ];

		return choice(strs, this.rnd);
	}

	override string commerceProductNameAdjective() {
		const string[] strs =
		[ q"{小的}", q"{人体工程学的}", q"{电子的}", q"{质朴的}", q"{智能的}", q"{华丽的}"
		, q"{不可思议的}", q"{优雅的}", q"{精彩绝伦的}", q"{实用的}", q"{现代的}"
		, q"{回收的}", q"{圆滑的}", q"{定制的}", q"{贼好用的}", q"{通用的}", q"{手工的}"
		, q"{手工制作的}", q"{东方的}", q"{已许可的}", q"{豪华的}", q"{精致的}"
		, q"{无品牌的}", q"{好吃}" ];

		return choice(strs, this.rnd);
	}

	override string commerceProductNameMaterial() {
		const string[] strs =
		[ q"{钢}", q"{青铜}", q"{木制}", q"{混凝土}", q"{塑料}", q"{棉花}", q"{花岗岩}", q"{橡胶}"
		, q"{金属}", q"{软}", q"{新鲜}", q"{冷冻}" ];

		return choice(strs, this.rnd);
	}

	override string commerceProductNameProduct() {
		const string[] strs =
		[ q"{椅子}", q"{汽车}", q"{电脑}", q"{键盘}", q"{鼠标}", q"{自行车}", q"{球}", q"{手套}"
		, q"{裤子}", q"{衬衫}", q"{桌子}", q"{鞋子}", q"{帽子}", q"{毛巾}", q"{肥皂}", q"{金枪鱼}"
		, q"{鸡肉}", q"{鱼肉}", q"{奶酪}", q"{培根}", q"{披萨}", q"{沙拉}", q"{香肠}", q"{薯条}" ];

		return choice(strs, this.rnd);
	}

	override string companyNamePattern() {
		assert(false);
	}

	override string databaseColumn() {
		const string[] strs =
		[ q"{标识}", q"{标题}", q"{名称}", q"{邮箱}", q"{手机}", q"{令牌}", q"{组别}", q"{类别}"
		, q"{密码}", q"{注释}", q"{头像}", q"{状态}", q"{创建于}", q"{更新于}" ];

		return choice(strs, this.rnd);
	}

	override string dateMonthWide() {
		const string[] strs =
		[ q"{一月}", q"{二月}", q"{三月}", q"{四月}", q"{五月}", q"{六月}", q"{七月}", q"{八月}"
		, q"{九月}", q"{十月}", q"{十一月}", q"{十二月}" ];

		return choice(strs, this.rnd);
	}

	override string dateMonthAbbr() {
		const string[] strs =
		[ q"{1月}", q"{2月}", q"{3月}", q"{4月}", q"{5月}", q"{6月}", q"{7月}", q"{8月}", q"{9月}", q"{10月}"
		, q"{11月}", q"{12月}" ];

		return choice(strs, this.rnd);
	}

	override string dateWeekdayWide() {
		const string[] strs =
		[ q"{星期天}", q"{星期一}", q"{星期二}", q"{星期三}", q"{星期四}", q"{星期五}"
		, q"{星期六}" ];

		return choice(strs, this.rnd);
	}

	override string dateWeekdayAbbr() {
		const string[] strs =
		[ q"{周日}", q"{周一}", q"{周二}", q"{周三}", q"{周四}", q"{周五}", q"{周六}" ];

		return choice(strs, this.rnd);
	}

	override string financeAccountType() {
		const string[] strs =
		[ q"{支票}", q"{储蓄}", q"{货币市场}", q"{投资}", q"{房屋贷款}", q"{信用卡}"
		, q"{汽车贷款}", q"{个人贷款}" ];

		return choice(strs, this.rnd);
	}

	override string financeTransactionType() {
		const string[] strs =
		[ q"{存款}", q"{取款}", q"{支付}", q"{开票}" ];

		return choice(strs, this.rnd);
	}

	override string hackerAdjective() {
		const string[] strs =
		[ q"{辅助}", q"{主要}", q"{后端}", q"{开源}", q"{虚拟}", q"{跨平台}", q"{冗余}", q"{在线}"
		, q"{触控}", q"{多字节}", q"{蓝牙}", q"{无线}", q"{全高清}", q"{神经元}", q"{光学}"
		, q"{固态}", q"{移动}" ];

		return choice(strs, this.rnd);
	}

	override string hackerNoun() {
		const string[] strs =
		[ q"{驱动}", q"{协议}", q"{带宽}", q"{面板}", q"{芯片}", q"{程序}", q"{端口}", q"{卡片}"
		, q"{数组}", q"{接口}", q"{系统}", q"{传感器}", q"{防火墙}", q"{硬盘}", q"{像素}"
		, q"{警报}", q"{提要}", q"{监视器}", q"{应用}", q"{发送端}", q"{总线}", q"{电路}"
		, q"{电容器}", q"{矩阵}" ];

		return choice(strs, this.rnd);
	}

	override string hackerPhrase() {
		assert(false);
	}

	override string hackerVerb() {
		const string[] strs =
		[ q"{备份}", q"{绕过}", q"{入侵}", q"{覆盖}", q"{压缩}", q"{复制}", q"{导航}", q"{索引}"
		, q"{链接}", q"{生成}", q"{量化}", q"{计算}", q"{合成}", q"{输入}", q"{传输}", q"{编程}"
		, q"{重启}", q"{解析}" ];

		return choice(strs, this.rnd);
	}

	override string internetFreeEmail() {
		const string[] strs =
		[ q"{126.com}", q"{139.com}", q"{163.com}", q"{21cn.com}", q"{gmail.com}", q"{hotmail.com}", q"{qq.com}"
		, q"{sina.com}", q"{sohu.com}", q"{tom.com}", q"{vip.qq.com}", q"{yahoo.cn}", q"{yahoo.com.cn}"
		, q"{yeah.net}", q"{foxmail.com}", q"{outlook.com}" ];

		return choice(strs, this.rnd);
	}

	override string locationCityPattern() {
		assert(false);
	}

	override string locationCityPrefix() {
		const string[] strs =
		[ q"{上}", q"{包}", q"{北}", q"{南}", q"{厦}", q"{吉}", q"{太}", q"{宁}", q"{安}", q"{成}", q"{武}"
		, q"{济}", q"{海}", q"{珠}", q"{福}", q"{衡}", q"{西}", q"{诸}", q"{贵}", q"{长}" ];

		return choice(strs, this.rnd);
	}

	override string locationCitySuffix() {
		const string[] strs =
		[ q"{乡县}", q"{京市}", q"{南市}", q"{原市}", q"{口市}", q"{头市}", q"{宁市}", q"{安市}"
		, q"{州市}", q"{徽市}", q"{林市}", q"{汉市}", q"{沙市}", q"{海市}", q"{码市}", q"{都市}"
		, q"{门市}", q"{阳市}" ];

		return choice(strs, this.rnd);
	}

	override string locationDefaultCountry() {
		const string[] strs =
		[ q"{中国}" ];

		return choice(strs, this.rnd);
	}

	override string locationState() {
		const string[] strs =
		[ q"{北京市}", q"{上海市}", q"{天津市}", q"{重庆市}", q"{黑龙江省}", q"{吉林省}"
		, q"{辽宁省}", q"{内蒙古自治区}", q"{河北省}", q"{新疆维吾尔自治区}"
		, q"{甘肃省}", q"{青海省}", q"{陕西省}", q"{宁夏回族自治区}", q"{河南省}"
		, q"{山东省}", q"{山西省}", q"{安徽省}", q"{湖北省}", q"{湖南省}", q"{江苏省}"
		, q"{四川省}", q"{贵州省}", q"{云南省}", q"{广西壮族自治区}", q"{西藏自治区}"
		, q"{浙江省}", q"{江西省}", q"{广东省}", q"{福建省}", q"{海南省}" ];

		return choice(strs, this.rnd);
	}

	override string locationStateAbbr() {
		const string[] strs =
		[ q"{北京}", q"{上海}", q"{天津}", q"{重庆}", q"{黑龙江}", q"{吉林}", q"{辽阳}", q"{内蒙古}"
		, q"{河北}", q"{新疆}", q"{甘肃}", q"{青海}", q"{陕西}", q"{宁夏}", q"{河南}", q"{山东}"
		, q"{山西}", q"{合肥}", q"{湖北}", q"{湖南}", q"{苏州}", q"{四川}", q"{贵州}", q"{云南}"
		, q"{广西}", q"{西藏}", q"{浙江}", q"{江西}", q"{广东}", q"{福建}", q"{海南}" ];

		return choice(strs, this.rnd);
	}

	override string locationStreetPattern() {
		assert(false);
	}

	override string locationStreetSuffix() {
		const string[] strs =
		[ q"{巷}", q"{街}", q"{路}", q"{桥}", q"{侬}", q"{旁}", q"{中心}", q"{栋}" ];

		return choice(strs, this.rnd);
	}

	override string musicGenre() {
		const string[] strs =
		[ q"{摇滚}", q"{流行}", q"{重金属}", q"{电子}", q"{民谣}", q"{世界}", q"{乡村}", q"{爵士}"
		, q"{放克}", q"{灵魂}", q"{嘻哈}", q"{经典}", q"{拉丁}", q"{牙买加}", q"{蓝调}"
		, q"{非音乐}", q"{说唱}", q"{舞台与银幕}" ];

		return choice(strs, this.rnd);
	}

	override string musicSongName() {
		const string[] strs =
		[ q"{白月光与朱砂痣}", q"{孤勇者}", q"{稻香}", q"{起风了}", q"{纪念}", q"{晴天}"
		, q"{兰亭序}", q"{我流泪情绪零碎}", q"{七里香}", q"{花海}", q"{反方向的钟}"
		, q"{一路向北}", q"{蒲公英的约定}", q"{夜曲}", q"{搁浅}", q"{海底}", q"{105度的你}"
		, q"{明明就}", q"{爱在西元前}", q"{我如此相信}", q"{枫}", q"{青花瓷}", q"{半岛铁盒}"
		, q"{说了再见}", q"{暗号}", q"{退后}", q"{最长的电影}", q"{等你下课}", q"{烟花易冷}"
		, q"{不该}", q"{告白气球}", q"{说好不哭}", q"{轨迹}", q"{红尘客栈}", q"{不能说的秘密}"
		, q"{珊瑚海}", q"{给我一首歌的时间}", q"{你听得到}", q"{简单的爱}"
		, q"{龙卷风}", q"{发如雪}", q"{园游会}", q"{听妈妈的话}", q"{夜的第七章}"
		, q"{接口}", q"{手写从前}", q"{安静}", q"{爱情废材}", q"{以父之名}", q"{我不配}"
		, q"{最伟大的作品}", q"{可爱女人}", q"{彩虹}", q"{回到过去}", q"{听悲伤的情话}"
		, q"{把回忆拼好给你}", q"{东风破}", q"{黑色毛衣}", q"{本草纲目}", q"{开不了口}"
		, q"{霍元甲}", q"{爱的飞行日记}", q"{大本钟}", q"{断了的弦}", q"{爷爷泡的茶}"
		, q"{星晴}", q"{甜甜的}", q"{红颜如霜}", q"{粉色海洋}", q"{她的睫毛}", q"{雨下一整晚}"
		, q"{白色风车}", q"{还在流浪}", q"{阳光宅男}", q"{算什么男人}", q"{菊花台}"
		, q"{千里之外}", q"{错过的烟火}", q"{倒影}", q"{听见下雨的声音}", q"{黑色幽默}"
		, q"{默}", q"{不爱我拉倒}", q"{之战之殇}", q"{布拉格广场}", q"{美人鱼}"
		, q"{分裂}", q"{心雨}", q"{米兰的小铁匠}", q"{世界末日}", q"{一点点}", q"{外婆}"
		, q"{画沙}", q"{哪里都是你}", q"{刀马旦}", q"{超人不会飞}", q"{牛仔很忙}"
		, q"{周大侠}", q"{飘移}", q"{忍者}", q"{夏日妄想}", q"{铃芽之旅}", q"{玫瑰少年}"
		, q"{大鱼}", q"{灯火里的中国}", q"{义勇军进行曲}", q"{调查中}", q"{少年}"
		, q"{堕}", q"{在你身边}", q"{悬溺}", q"{奢香夫人}", q"{最好的安排}", q"{夏至未至}"
		, q"{小城夏天}", q"{暖暖}" ];

		return choice(strs, this.rnd);
	}

	override string personBioPart() {
		const string[] strs =
		[ q"{活动家}", q"{艺术家}", q"{作家}", q"{博主}", q"{企业家}", q"{教练}", q"{发明家}"
		, q"{设计师}", q"{开发者}", q"{教育家}", q"{工程师}", q"{企业主}", q"{环保主义者}"
		, q"{电影爱好者}", q"{电影制片人}", q"{美食家}", q"{创始人}", q"{朋友}"
		, q"{玩家}", q"{极客}", q"{毕业生}", q"{创造者}", q"{领导者}", q"{模特}", q"{脑力爱好者}"
		, q"{父母}", q"{爱国者}", q"{个人}", q"{哲学家}", q"{摄影爱好者}", q"{公众演说家}"
		, q"{科学家}", q"{梦想家}", q"{学生}", q"{老师}", q"{旅行家}", q"{退伍军人}"
		, q"{作者}" ];

		return choice(strs, this.rnd);
	}

	override string personBioPattern() {
		assert(false);
	}

	override string personBioSupporter() {
		const string[] strs =
		[ q"{倡导者}", q"{贡献者}", q"{发烧友}", q"{粉丝}", q"{狂热者}", q"{爱好者}"
		, q"{支持者}" ];

		return choice(strs, this.rnd);
	}

	override string personFemaleFirstName() {
		const string[] strs =
		[ q"{秀英}", q"{秀兰}", q"{秀珍}", q"{桂英}", q"{桂兰}", q"{玉兰}", q"{玉珍}", q"{玉英}"
		, q"{玉梅}", q"{凤英}", q"{兰英}", q"{婷婷}", q"{国英}", q"{国珍}", q"{国华}", q"{国芳}"
		, q"{国兰}", q"{国秀}", q"{国琴}", q"{国荣}", q"{国香}", q"{英}", q"{萍}", q"{蒙}", q"{红}"
		, q"{丽}", q"{敏}", q"{芳}", q"{静}", q"{霞}", q"{燕}", q"{娟}", q"{艳}", q"{娜}", q"{丹}", q"{玲}"
		, q"{婷}", q"{珈}", q"{雪}", q"{倩}", q"{悦}", q"{颖}", q"{洁}", q"{慧}", q"{开慧}", q"{丽芬}"
		, q"{丽芳}", q"{丽萍}", q"{若汐}", q"{一诺}", q"{艺涵}", q"{依诺}", q"{梓涵}", q"{梓晨}"
		, q"{梓馨}", q"{梓萱}", q"{梓妍}", q"{梓玥}", q"{苡沫}", q"{雨桐}", q"{欣怡}", q"{语桐}"
		, q"{语汐}", q"{雨涵}", q"{雨欣}", q"{诗雨}", q"{婷方}", q"{美方}", q"{雅婷}", q"{紫林}"
		, q"{天娇}", q"{万佳}", q"{子欣}", q"{海燕}", q"{乙萍}", q"{安琪}", q"{馨羽}", q"{馥君}"
		, q"{思佳}", q"{雅鑫}", q"{静怡}", q"{晨阳}", q"{佳琪}", q"{雯静}", q"{榕融}" ];

		return choice(strs, this.rnd);
	}

	override string personFirstName() {
		const string[] strs =
		[ q"{乐驹}", q"{伟宸}", q"{伟泽}", q"{伟祺}", q"{伟诚}", q"{俊驰}", q"{修杰}", q"{修洁}"
		, q"{健柏}", q"{健雄}", q"{凯瑞}", q"{博文}", q"{博涛}", q"{博超}", q"{君浩}", q"{哲瀚}"
		, q"{嘉懿}", q"{嘉熙}", q"{天宇}", q"{天磊}", q"{天翊}", q"{子涵}", q"{子轩}", q"{子骞}"
		, q"{子默}", q"{展鹏}", q"{峻熙}", q"{建辉}", q"{弘文}", q"{彬}", q"{志强}", q"{志泽}"
		, q"{思}", q"{思淼}", q"{思源}", q"{思聪}", q"{思远}", q"{懿轩}", q"{振家}", q"{擎宇}"
		, q"{擎苍}", q"{文}", q"{文博}", q"{文昊}", q"{文轩}", q"{旭尧}", q"{昊天}", q"{昊强}"
		, q"{昊焱}", q"{昊然}", q"{明}", q"{明哲}", q"{明杰}", q"{明轩}", q"{明辉}", q"{晋鹏}"
		, q"{晓博}", q"{晓啸}", q"{晟睿}", q"{智宸}", q"{智渊}", q"{智辉}", q"{果}", q"{梓晨}"
		, q"{楷瑞}", q"{正豪}", q"{泽洋}", q"{浩}", q"{浩宇}", q"{浩然}", q"{浩轩}", q"{涛}"
		, q"{潇然}", q"{炎彬}", q"{炫明}", q"{烨伟}", q"{烨华}", q"{烨磊}", q"{烨霖}", q"{煜城}"
		, q"{煜祺}", q"{熠彤}", q"{琪}", q"{瑞霖}", q"{瑾瑜}", q"{皓轩}", q"{睿渊}", q"{立果}"
		, q"{立诚}", q"{立轩}", q"{立辉}", q"{笑愚}", q"{绍辉}", q"{绍齐}", q"{耀杰}", q"{聪健}"
		, q"{胤祥}", q"{致远}", q"{航}", q"{苑博}", q"{荣轩}", q"{语堂}", q"{越彬}", q"{越泽}"
		, q"{远航}", q"{金鑫}", q"{鑫磊}", q"{鑫鹏}", q"{钰轩}", q"{锦程}", q"{雨泽}", q"{雪松}"
		, q"{靖琪}", q"{风华}", q"{驰}", q"{鸿涛}", q"{鸿煊}", q"{鹏}", q"{鹏涛}", q"{鹏煊}"
		, q"{鹏飞}", q"{鹤轩}", q"{鹭洋}", q"{黎昕}", q"{诗雨}", q"{婷方}", q"{美方}", q"{雅婷}"
		, q"{紫林}", q"{天娇}", q"{万佳}", q"{子欣}", q"{海燕}", q"{乙萍}", q"{安琪}", q"{馨羽}"
		, q"{馥君}", q"{思佳}", q"{雅鑫}", q"{静怡}", q"{晨阳}", q"{佳琪}", q"{雯静}", q"{榕融}"
		, q"{浩辰}", q"{癸霖}", q"{一全}", q"{三锋}", q"{义轩}", q"{俊凯}", q"{子豪}", q"{振东}"
		, q"{智杰}", q"{哲新}", q"{中海}", q"{超栋}", q"{治涛}", q"{治文}", q"{文韬}", q"{敬彪}"
		, q"{敬阳}", q"{政君}", q"{立伟}", q"{呈轩}" ];

		return choice(strs, this.rnd);
	}

	override string personLastName() {
		const string[] strs =
		[ q"{赵}", q"{钱}", q"{孙}", q"{李}", q"{周}", q"{吴}", q"{郑}", q"{王}", q"{冯}", q"{陈}", q"{褚}"
		, q"{卫}", q"{蒋}", q"{沈}", q"{韩}", q"{杨}", q"{朱}", q"{秦}", q"{尤}", q"{许}", q"{何}", q"{吕}"
		, q"{施}", q"{张}", q"{孔}", q"{曹}", q"{严}", q"{华}", q"{金}", q"{魏}", q"{陶}", q"{姜}", q"{戚}"
		, q"{谢}", q"{邹}", q"{喻}", q"{柏}", q"{水}", q"{窦}", q"{章}", q"{云}", q"{苏}", q"{潘}", q"{葛}"
		, q"{奚}", q"{范}", q"{彭}", q"{郎}", q"{鲁}", q"{韦}", q"{昌}", q"{马}", q"{苗}", q"{凤}", q"{花}"
		, q"{方}", q"{俞}", q"{任}", q"{袁}", q"{柳}", q"{酆}", q"{鲍}", q"{史}", q"{唐}", q"{费}", q"{廉}"
		, q"{岑}", q"{薛}", q"{雷}", q"{贺}", q"{倪}", q"{汤}", q"{滕}", q"{殷}", q"{罗}", q"{毕}", q"{郝}"
		, q"{邬}", q"{安}", q"{常}", q"{乐}", q"{于}", q"{时}", q"{傅}", q"{皮}", q"{卞}", q"{齐}", q"{康}"
		, q"{伍}", q"{余}", q"{元}", q"{卜}", q"{顾}", q"{孟}", q"{平}", q"{黄}", q"{和}", q"{穆}", q"{萧}"
		, q"{尹}", q"{姚}", q"{邵}", q"{湛}", q"{汪}", q"{祁}", q"{毛}", q"{禹}", q"{狄}", q"{米}", q"{贝}"
		, q"{明}", q"{臧}", q"{计}", q"{伏}", q"{成}", q"{戴}", q"{谈}", q"{宋}", q"{茅}", q"{庞}", q"{熊}"
		, q"{纪}", q"{舒}", q"{屈}", q"{项}", q"{祝}", q"{董}", q"{梁}", q"{杜}", q"{阮}", q"{蓝}", q"{闵}"
		, q"{席}", q"{季}", q"{麻}", q"{强}", q"{贾}", q"{路}", q"{娄}", q"{危}", q"{江}", q"{童}", q"{颜}"
		, q"{郭}", q"{梅}", q"{盛}", q"{林}", q"{刁}", q"{锺}", q"{徐}", q"{邱}", q"{骆}", q"{高}", q"{夏}"
		, q"{蔡}", q"{田}", q"{樊}", q"{胡}", q"{凌}", q"{蹇}", q"{称}", q"{诺}", q"{来}", q"{多}", q"{繁}"
		, q"{戊}", q"{朴}", q"{回}", q"{毓}", q"{税}", q"{荤}", q"{靖}", q"{绪}", q"{愈}", q"{硕}", q"{牢}"
		, q"{买}", q"{但}", q"{巧}", q"{枚}", q"{撒}", q"{泰}", q"{秘}", q"{亥}", q"{绍}", q"{以}", q"{壬}"
		, q"{森}", q"{斋}", q"{释}", q"{奕}", q"{姒}", q"{朋}", q"{求}", q"{羽}", q"{用}", q"{占}", q"{真}"
		, q"{穰}", q"{翦}", q"{闾}", q"{漆}", q"{贵}", q"{代}", q"{贯}", q"{旁}", q"{崇}", q"{栋}", q"{告}"
		, q"{休}", q"{褒}", q"{谏}", q"{锐}", q"{皋}", q"{闳}", q"{在}", q"{歧}", q"{禾}", q"{示}", q"{是}"
		, q"{委}", q"{钊}", q"{频}", q"{嬴}", q"{呼}", q"{大}", q"{威}", q"{昂}", q"{律}", q"{冒}", q"{保}"
		, q"{系}", q"{抄}", q"{定}", q"{化}", q"{莱}", q"{校}", q"{么}", q"{抗}", q"{祢}", q"{綦}", q"{悟}"
		, q"{宏}", q"{功}", q"{庚}", q"{务}", q"{敏}", q"{捷}", q"{拱}", q"{兆}", q"{丑}", q"{丙}", q"{畅}"
		, q"{苟}", q"{随}", q"{类}", q"{卯}", q"{俟}", q"{友}", q"{答}", q"{乙}", q"{允}", q"{甲}", q"{留}"
		, q"{尾}", q"{佼}", q"{玄}", q"{乘}", q"{裔}", q"{延}", q"{植}", q"{环}", q"{矫}", q"{赛}", q"{昔}"
		, q"{侍}", q"{度}", q"{旷}", q"{遇}", q"{偶}", q"{前}", q"{由}", q"{咎}", q"{塞}", q"{敛}", q"{受}"
		, q"{泷}", q"{袭}", q"{衅}", q"{叔}", q"{圣}", q"{御}", q"{夫}", q"{仆}", q"{镇}", q"{藩}", q"{邸}"
		, q"{府}", q"{掌}", q"{首}", q"{员}", q"{焉}", q"{戏}", q"{可}", q"{智}", q"{尔}", q"{凭}", q"{悉}"
		, q"{进}", q"{笃}", q"{厚}", q"{仁}", q"{业}", q"{肇}", q"{资}", q"{合}", q"{仍}", q"{九}", q"{衷}"
		, q"{哀}", q"{刑}", q"{俎}", q"{仵}", q"{圭}", q"{夷}", q"{徭}", q"{蛮}", q"{汗}", q"{孛}", q"{乾}"
		, q"{帖}", q"{罕}", q"{洛}", q"{淦}", q"{洋}", q"{邶}", q"{郸}", q"{郯}", q"{邗}", q"{邛}", q"{剑}"
		, q"{虢}", q"{隋}", q"{蒿}", q"{茆}", q"{菅}", q"{苌}", q"{树}", q"{桐}", q"{锁}", q"{钟}", q"{机}"
		, q"{盘}", q"{铎}", q"{斛}", q"{玉}", q"{线}", q"{针}", q"{箕}", q"{庹}", q"{绳}", q"{磨}", q"{蒉}"
		, q"{瓮}", q"{弭}", q"{刀}", q"{疏}", q"{牵}", q"{浑}", q"{恽}", q"{势}", q"{世}", q"{仝}", q"{同}"
		, q"{蚁}", q"{止}", q"{戢}", q"{睢}", q"{冼}", q"{种}", q"{涂}", q"{肖}", q"{己}", q"{泣}", q"{潜}"
		, q"{卷}", q"{脱}", q"{谬}", q"{蹉}", q"{赧}", q"{浮}", q"{顿}", q"{说}", q"{次}", q"{错}", q"{念}"
		, q"{夙}", q"{斯}", q"{完}", q"{丹}", q"{表}", q"{聊}", q"{源}", q"{姓}", q"{吾}", q"{寻}", q"{展}"
		, q"{出}", q"{不}", q"{户}", q"{闭}", q"{才}", q"{无}", q"{书}", q"{学}", q"{愚}", q"{本}", q"{性}"
		, q"{雪}", q"{霜}", q"{烟}", q"{寒}", q"{少}", q"{字}", q"{桥}", q"{板}", q"{斐}", q"{独}", q"{千}"
		, q"{诗}", q"{嘉}", q"{扬}", q"{善}", q"{揭}", q"{祈}", q"{析}", q"{赤}", q"{紫}", q"{青}", q"{柔}"
		, q"{刚}", q"{奇}", q"{拜}", q"{佛}", q"{陀}", q"{弥}", q"{阿}", q"{素}", q"{长}", q"{僧}", q"{隐}"
		, q"{仙}", q"{隽}", q"{宇}", q"{祭}", q"{酒}", q"{淡}", q"{塔}", q"{琦}", q"{闪}", q"{始}", q"{星}"
		, q"{南}", q"{天}", q"{接}", q"{波}", q"{碧}", q"{速}", q"{禚}", q"{腾}", q"{潮}", q"{镜}", q"{似}"
		, q"{澄}", q"{潭}", q"{謇}", q"{纵}", q"{渠}", q"{奈}", q"{风}", q"{春}", q"{濯}", q"{沐}", q"{茂}"
		, q"{英}", q"{兰}", q"{檀}", q"{藤}", q"{枝}", q"{检}", q"{生}", q"{折}", q"{登}", q"{驹}", q"{骑}"
		, q"{貊}", q"{虎}", q"{肥}", q"{鹿}", q"{雀}", q"{野}", q"{禽}", q"{飞}", q"{节}", q"{宜}", q"{鲜}"
		, q"{粟}", q"{栗}", q"{豆}", q"{帛}", q"{官}", q"{布}", q"{衣}", q"{藏}", q"{宝}", q"{钞}", q"{银}"
		, q"{门}", q"{盈}", q"{庆}", q"{喜}", q"{及}", q"{普}", q"{建}", q"{营}", q"{巨}", q"{望}", q"{希}"
		, q"{道}", q"{载}", q"{声}", q"{漫}", q"{犁}", q"{力}", q"{贸}", q"{勤}", q"{革}", q"{改}", q"{兴}"
		, q"{亓}", q"{睦}", q"{修}", q"{信}", q"{闽}", q"{北}", q"{守}", q"{坚}", q"{勇}", q"{汉}", q"{练}"
		, q"{尉}", q"{士}", q"{旅}", q"{五}", q"{令}", q"{将}", q"{旗}", q"{军}", q"{行}", q"{奉}", q"{敬}"
		, q"{恭}", q"{仪}", q"{母}", q"{堂}", q"{丘}", q"{义}", q"{礼}", q"{慈}", q"{孝}", q"{理}", q"{伦}"
		, q"{卿}", q"{问}", q"{永}", q"{辉}", q"{位}", q"{让}", q"{尧}", q"{依}", q"{犹}", q"{介}", q"{承}"
		, q"{市}", q"{所}", q"{苑}", q"{杞}", q"{剧}", q"{第}", q"{零}", q"{谌}", q"{招}", q"{续}", q"{达}"
		, q"{忻}", q"{六}", q"{鄞}", q"{战}", q"{迟}", q"{候}", q"{宛}", q"{励}", q"{粘}", q"{萨}", q"{邝}"
		, q"{覃}", q"{辜}", q"{初}", q"{楼}", q"{城}", q"{区}", q"{局}", q"{台}", q"{原}", q"{考}", q"{妫}"
		, q"{纳}", q"{泉}", q"{老}", q"{清}", q"{德}", q"{卑}", q"{过}", q"{麦}", q"{曲}", q"{竹}", q"{百}"
		, q"{福}", q"{言}", q"{霍}", q"{虞}", q"{万}", q"{支}", q"{柯}", q"{昝}", q"{管}", q"{卢}", q"{莫}"
		, q"{经}", q"{房}", q"{裘}", q"{缪}", q"{干}", q"{解}", q"{应}", q"{宗}", q"{丁}", q"{宣}", q"{贲}"
		, q"{邓}", q"{单}", q"{杭}", q"{洪}", q"{包}", q"{诸}", q"{左}", q"{石}", q"{崔}", q"{吉}", q"{钮}"
		, q"{龚}", q"{程}", q"{嵇}", q"{邢}", q"{滑}", q"{裴}", q"{陆}", q"{荣}", q"{翁}", q"{荀}", q"{羊}"
		, q"{於}", q"{惠}", q"{甄}", q"{麴}", q"{家}", q"{封}", q"{芮}", q"{羿}", q"{储}", q"{靳}", q"{汲}"
		, q"{邴}", q"{糜}", q"{松}", q"{井}", q"{段}", q"{富}", q"{巫}", q"{乌}", q"{焦}", q"{巴}", q"{弓}"
		, q"{牧}", q"{隗}", q"{山}", q"{谷}", q"{车}", q"{侯}", q"{宓}", q"{蓬}", q"{全}", q"{郗}", q"{班}"
		, q"{仰}", q"{秋}", q"{仲}", q"{伊}", q"{宫}", q"{宁}", q"{仇}", q"{栾}", q"{暴}", q"{甘}", q"{钭}"
		, q"{历}", q"{戎}", q"{祖}", q"{武}", q"{符}", q"{刘}", q"{景}", q"{詹}", q"{束}", q"{龙}", q"{叶}"
		, q"{幸}", q"{司}", q"{韶}", q"{郜}", q"{黎}", q"{蓟}", q"{溥}", q"{印}", q"{宿}", q"{白}", q"{怀}"
		, q"{蒲}", q"{邰}", q"{召}", q"{有}", q"{舜}", q"{拉}", q"{丛}", q"{岳}", q"{寸}", q"{贰}", q"{皇}"
		, q"{侨}", q"{彤}", q"{竭}", q"{端}", q"{赫}", q"{实}", q"{甫}", q"{集}", q"{象}", q"{翠}", q"{狂}"
		, q"{辟}", q"{典}", q"{良}", q"{函}", q"{芒}", q"{苦}", q"{其}", q"{京}", q"{中}", q"{夕}", q"{之}"
		, q"{从}", q"{鄂}", q"{索}", q"{咸}", q"{籍}", q"{赖}", q"{卓}", q"{蔺}", q"{屠}", q"{蒙}", q"{池}"
		, q"{乔}", q"{阳}", q"{郁}", q"{胥}", q"{能}", q"{苍}", q"{双}", q"{闻}", q"{莘}", q"{党}", q"{翟}"
		, q"{谭}", q"{贡}", q"{劳}", q"{逄}", q"{姬}", q"{申}", q"{扶}", q"{堵}", q"{冉}", q"{宰}", q"{郦}"
		, q"{雍}", q"{却}", q"{璩}", q"{桑}", q"{桂}", q"{濮}", q"{牛}", q"{寿}", q"{通}", q"{边}", q"{扈}"
		, q"{燕}", q"{冀}", q"{僪}", q"{浦}", q"{尚}", q"{农}", q"{温}", q"{别}", q"{庄}", q"{晏}", q"{柴}"
		, q"{瞿}", q"{阎}", q"{充}", q"{慕}", q"{连}", q"{茹}", q"{习}", q"{宦}", q"{艾}", q"{鱼}", q"{容}"
		, q"{向}", q"{古}", q"{易}", q"{慎}", q"{戈}", q"{廖}", q"{庾}", q"{终}", q"{暨}", q"{居}", q"{衡}"
		, q"{步}", q"{都}", q"{耿}", q"{满}", q"{弘}", q"{匡}", q"{国}", q"{文}", q"{琴}", q"{况}", q"{亢}"
		, q"{缑}", q"{帅}", q"{寇}", q"{广}", q"{禄}", q"{阙}", q"{东}", q"{欧}", q"{殳}", q"{沃}", q"{利}"
		, q"{蔚}", q"{越}", q"{夔}", q"{隆}", q"{师}", q"{巩}", q"{厍}", q"{聂}", q"{晁}", q"{勾}", q"{敖}"
		, q"{融}", q"{冷}", q"{訾}", q"{辛}", q"{阚}", q"{那}", q"{简}", q"{饶}", q"{空}", q"{曾}", q"{毋}"
		, q"{沙}", q"{乜}", q"{养}", q"{鞠}", q"{须}", q"{丰}", q"{巢}", q"{关}", q"{蒯}", q"{相}", q"{查}"
		, q"{后}", q"{荆}", q"{红}", q"{游}", q"{特}", q"{察}", q"{竺}", q"{冠}", q"{宾}", q"{香}", q"{赏}"
		, q"{伯}", q"{佴}", q"{佘}", q"{佟}", q"{爱}", q"{年}", q"{笪}", q"{谯}", q"{哈}", q"{墨}", q"{牟}"
		, q"{商}", q"{海}", q"{归}", q"{钦}", q"{鄢}", q"{汝}", q"{法}", q"{闫}", q"{楚}", q"{晋}", q"{督}"
		, q"{仉}", q"{盖}", q"{逯}", q"{库}", q"{郏}", q"{逢}", q"{阴}", q"{薄}", q"{厉}", q"{稽}", q"{开}"
		, q"{光}", q"{操}", q"{瑞}", q"{眭}", q"{泥}", q"{运}", q"{摩}", q"{伟}", q"{铁}", q"{迮}", q"{果}"
		, q"{权}", q"{逮}", q"{盍}", q"{益}", q"{桓}", q"{公}", q"{万俟}", q"{司马}", q"{上官}", q"{欧阳}"
		, q"{夏侯}", q"{诸葛}", q"{闻人}", q"{东方}", q"{赫连}", q"{皇甫}", q"{尉迟}", q"{公羊}"
		, q"{澹台}", q"{公冶}", q"{宗政}", q"{濮阳}", q"{淳于}", q"{单于}", q"{太叔}", q"{申屠}"
		, q"{公孙}", q"{仲孙}", q"{轩辕}", q"{令狐}", q"{钟离}", q"{宇文}", q"{长孙}", q"{慕容}"
		, q"{司徒}", q"{司空}", q"{章佳}", q"{那拉}", q"{觉罗}", q"{纳喇}", q"{乌雅}", q"{范姜}"
		, q"{碧鲁}" ];

		return choice(strs, this.rnd);
	}

	override string personMaleFirstName() {
		const string[] strs =
		[ q"{建华}", q"{建国}", q"{建军}", q"{国强}", q"{国平}", q"{国良}", q"{国栋}", q"{国辉}"
		, q"{志国}", q"{志明}", q"{勇}", q"{军}", q"{伟}", q"{强}", q"{刚}", q"{涛}", q"{斌}", q"{波}"
		, q"{辉}", q"{磊}", q"{超}", q"{鹏}", q"{杰}", q"{浩}", q"{鑫}", q"{帅}", q"{宇}", q"{晨}", q"{诚}"
		, q"{成}", q"{民}", q"{明}", q"{阳}", q"{瑜}", q"{熙成}", q"{熙瑶}", q"{家豪}", q"{家明}"
		, q"{俊杰}", q"{俊熙}", q"{沐宸}", q"{浩宇}", q"{浩然}", q"{浩轩}", q"{浩晨}", q"{沐辰}"
		, q"{茗泽}", q"{奕辰}", q"{奕泽}", q"{宇泽}", q"{宇轩}", q"{宇航}", q"{沐阳}", q"{梓诚}"
		, q"{梓豪}", q"{梓睿}", q"{梓浩}", q"{浩辰}", q"{癸霖}", q"{一全}", q"{三锋}", q"{义轩}"
		, q"{俊凯}", q"{子豪}", q"{振东}", q"{智杰}", q"{哲新}", q"{文昊}", q"{中海}", q"{超栋}"
		, q"{治涛}", q"{治文}", q"{文韬}", q"{敬彪}", q"{敬阳}", q"{政君}", q"{立伟}", q"{呈轩}" ];

		return choice(strs, this.rnd);
	}

	override string vehicleBicycleType() {
		const string[] strs =
		[ q"{冒险公路自行车}", q"{小轮车自行车}", q"{城市自行车}", q"{巡洋舰自行车}"
		, q"{越野自行车}", q"{双运动自行车}", q"{健身自行车}", q"{平足舒适自行车}"
		, q"{折叠自行车}", q"{混合动力自行车}", q"{山地自行车}", q"{卧式自行车}"
		, q"{公路自行车}", q"{双人自行车}", q"{旅行自行车}", q"{场地/固定齿轮自行车}"
		, q"{铁人三项/计时自行车}", q"{三轮车}" ];

		return choice(strs, this.rnd);
	}

	override string vehicleFuel() {
		const string[] strs =
		[ q"{柴油}", q"{电动}", q"{汽油}", q"{混合动力}" ];

		return choice(strs, this.rnd);
	}

	override string vehicleManufacturer() {
		const string[] strs =
		[ q"{阿斯顿·马丁}", q"{奥迪}", q"{宾利}", q"{宝马}", q"{布加迪}", q"{卡迪拉克}"
		, q"{雪佛兰}", q"{克莱斯勒}", q"{躲闪}", q"{法拉利}", q"{菲亚特}", q"{福特}"
		, q"{本田}", q"{现代}", q"{捷豹}", q"{吉普车}", q"{起亚}", q"{兰博基尼}", q"{路虎}"
		, q"{玛莎拉蒂}", q"{马自达}", q"{奔驰}", q"{小型的}", q"{日产}", q"{极星}", q"{保时捷}"
		, q"{劳斯莱斯}", q"{聪明的}", q"{特斯拉}", q"{丰田}", q"{大众汽车}", q"{沃尔沃}" ];

		return choice(strs, this.rnd);
	}

	override string vehicleType() {
		const string[] strs =
		[ q"{货车}", q"{掀背车}", q"{面包车}", q"{客车}", q"{越野车}", q"{轿车}", q"{旅行车}" ];

		return choice(strs, this.rnd);
	}

	override string wordAdjective() {
		const string[] strs =
		[ q"{长}", q"{短}", q"{大}", q"{小}", q"{粗}", q"{细}", q"{红}", q"{绿}", q"{平坦}", q"{整齐}"
		, q"{雪白}", q"{笔直}", q"{绿油油}", q"{血淋淋}", q"{骨碌碌}", q"{黑不溜秋}"
		, q"{好}", q"{坏}", q"{伟大}", q"{勇敢}", q"{优秀}", q"{聪明}", q"{老实}", q"{鲁莽}"
		, q"{大方}", q"{软}", q"{硬}", q"{苦}", q"{甜}", q"{冷}", q"{热}", q"{坚固}", q"{平常}", q"{快}"
		, q"{慢}", q"{生动}", q"{熟练}", q"{轻松}", q"{清楚}", q"{马虎}", q"{干脆}", q"{许多}"
		, q"{好些}", q"{全部}", q"{全}", q"{整}", q"{多}", q"{少}" ];

		return choice(strs, this.rnd);
	}

	override string wordAdverb() {
		const string[] strs =
		[ q"{都}", q"{全}", q"{单}", q"{共}", q"{光}", q"{尽}", q"{净}", q"{仅}", q"{就}", q"{只}", q"{一共}"
		, q"{一起}", q"{一同}", q"{一道}", q"{一齐}", q"{一概}", q"{一味}", q"{统统}", q"{总共}"
		, q"{仅仅}", q"{惟独}", q"{可}", q"{倒}", q"{一定}", q"{必定}", q"{必然}", q"{却}", q"{幸亏}"
		, q"{难道}", q"{何尝}", q"{偏偏}", q"{索性}", q"{简直}", q"{反正}", q"{多亏}", q"{也许}"
		, q"{大约}", q"{好在}", q"{敢情}", q"{不}", q"{没}", q"{没有}", q"{别}", q"{仿佛}", q"{渐渐}"
		, q"{百般}", q"{特地}", q"{互相}", q"{擅自}", q"{几乎}", q"{逐渐}", q"{逐步}", q"{猛然}"
		, q"{依然}", q"{仍然}", q"{当然}", q"{毅然}", q"{果然}", q"{差点儿}", q"{很}", q"{极}"
		, q"{最}", q"{太}", q"{更}", q"{更加}", q"{格外}", q"{十分}", q"{极其}", q"{比较}", q"{相当}"
		, q"{稍微}", q"{略微}", q"{多么}" ];

		return choice(strs, this.rnd);
	}

	override string wordVerb() {
		const string[] strs =
		[ q"{打}", q"{吃}", q"{抿}", q"{做}", q"{坐}", q"{跑}", q"{跳}", q"{走}", q"{飞}", q"{爬}", q"{开}"
		, q"{滑}", q"{切}", q"{拆}", q"{咬}", q"{吞}", q"{吐}", q"{吮}", q"{吸}", q"{啃}", q"{喝}", q"{咀}"
		, q"{嚼}", q"{搀}", q"{抱}", q"{搂}", q"{扶}", q"{捉}", q"{擒}", q"{掐}", q"{推}", q"{拿}", q"{抽}"
		, q"{撕}", q"{摘}", q"{拣}", q"{捡}", q"{播}", q"{击}", q"{捏}", q"{撒}", q"{按}", q"{弹}", q"{撞}"
		, q"{提}", q"{扭}", q"{捶}", q"{持}", q"{揍}", q"{披}", q"{捣}", q"{搜}", q"{托}", q"{举}", q"{拖}"
		, q"{擦}", q"{敲}", q"{挖}", q"{抛}", q"{掘}", q"{抬}", q"{插}", q"{扔}", q"{写}", q"{抄}", q"{抓}"
		, q"{捧}", q"{掷}", q"{撑}", q"{摊}", q"{倒}", q"{摔}", q"{劈}", q"{画}", q"{搔}", q"{撬}", q"{挥}"
		, q"{揽}", q"{挡}", q"{捺}", q"{抚}", q"{搡}", q"{拉}", q"{摸}", q"{拍}", q"{摇}", q"{剪}", q"{拎}"
		, q"{拔}", q"{拧}", q"{拨}", q"{舞}", q"{握}", q"{攥}", q"{驾驶}", q"{移动}", q"{转动}", q"{操作}"
		, q"{蠕动}", q"{启动}", q"{关闭}" ];

		return choice(strs, this.rnd);
	}

}
