module faked.faker_mk;

import std.algorithm : map, joiner;
import std.array;
import std.conv : to;
import std.exception : enforce;
import std.format;
import std.random;
import std.range : iota, take, repeat;
import std.string : toUpper;
import std.typecons : Nullable, nullable;

import faked.customtypes;

import faked.faker_en;

class Faker_mk : Faker_en {
@safe:
	this(int seed) {
		super(seed);
	}

	override string cellPhoneFormats() {
		const string[] strs =
		[ q"{07# ### ####}", q"{+389 7# ### ####}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string companyNamePattern() {
		final switch(uniform(0, 3, this.rnd)) {
			case 0: return personLastName() ~ " " ~ companySuffix();
			case 1: return locationCityName() ~ " " ~ companySuffix();
			case 2: return personLastName() ~ ", " ~ personLastName() ~ " и " ~ personLastName();
		}
		return "";
	}

	override string companySuffix() {
		const string[] strs =
		[ q"{ДОО}", q"{ДООЕЛ}", q"{АД}", q"{ТП}" ];

		return choice(strs, this.rnd);
	}

	override string dateMonthWide() {
		const string[] strs =
		[ q"{јануари}", q"{февруари}", q"{март}", q"{април}", q"{мај}", q"{јуни}"
		, q"{јули}", q"{август}", q"{септември}", q"{октомври}", q"{ноември}"
		, q"{декември}" ];

		return choice(strs, this.rnd);
	}

	override string dateMonthAbbr() {
		const string[] strs =
		[ q"{јан}", q"{фев}", q"{мар}", q"{апр}", q"{мај}", q"{јун}", q"{јул}", q"{авг}"
		, q"{сеп}", q"{окт}", q"{ное}", q"{дек}" ];

		return choice(strs, this.rnd);
	}

	override string dateWeekdayWide() {
		const string[] strs =
		[ q"{недела}", q"{понеделник}", q"{вторник}", q"{среда}", q"{четврток}"
		, q"{петок}", q"{сабота}" ];

		return choice(strs, this.rnd);
	}

	override string dateWeekdayAbbr() {
		const string[] strs =
		[ q"{нед}", q"{пон}", q"{вто}", q"{сре}", q"{чет}", q"{пет}", q"{саб}" ];

		return choice(strs, this.rnd);
	}

	override string internetDomainSuffix() {
		const string[] strs =
		[ q"{mk}", q"{com}", q"{com.mk}", q"{org.mk}", q"{gov.mk}", q"{net.mk}", q"{inf.mk}", q"{net}", q"{org}"
		, q"{eu}", q"{мкд}" ];

		return choice(strs, this.rnd);
	}

	override string internetFreeEmail() {
		const string[] strs =
		[ q"{t.mk}", q"{gmail.com}", q"{yahoo.com}", q"{hotmail.com}" ];

		return choice(strs, this.rnd);
	}

	override string locationBuildingNumber() {
		const string[] strs =
		[ q"{#}", q"{##}", q"{###}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationCityName() {
		const string[] strs =
		[ q"{Аеродром}", q"{Арачиново}", q"{Берово}", q"{Битола}", q"{Богданци}"
		, q"{Боговиње}", q"{Босилово}", q"{Брвеница}", q"{Бутел}"
		, q"{Валандово}", q"{Василево}", q"{Вевчани}", q"{Велес}"
		, q"{Виница}", q"{Врапчиште}", q"{Гази Баба}", q"{Гевгелија}"
		, q"{Гостивар}", q"{Градско}", q"{Дебар}", q"{Дебрца}", q"{Делчево}"
		, q"{Демир Капија}", q"{Демир Хисар}", q"{Дојран}", q"{Долнени}"
		, q"{Ѓорче Петров}", q"{Желино}", q"{Зелениково}", q"{Зрновци}"
		, q"{Илинден}", q"{Јегуновце}", q"{Кавадарци}", q"{Карбинци}"
		, q"{Карпош}", q"{Кисела Вода}", q"{Кичево}", q"{Конче}", q"{Кочани}"
		, q"{Кратово}", q"{Крива Паланка}", q"{Кривогаштани}"
		, q"{Крушево}", q"{Куманово}", q"{Липково}", q"{Лозово}", q"{Маврово и Ростуше}"
		, q"{Македонска Каменица}", q"{Македонски Брод}"
		, q"{Могила}", q"{Неготино}", q"{Новаци}", q"{Ново Село}"
		, q"{Охрид}", q"{Петровец}", q"{Пехчево}", q"{Пласница}", q"{Прилеп}"
		, q"{Пробиштип}", q"{Радовиш}", q"{Ранковце}", q"{Ресен}"
		, q"{Росоман}", q"{Сарај}", q"{Свети Николе}", q"{Сопиште}"
		, q"{Старо Нагоричане}", q"{Струга}", q"{Струмица}", q"{Студеничани}"
		, q"{Теарце}", q"{Тетово}", q"{Центар}", q"{Центар Жупа}"
		, q"{Чаир}", q"{Чашка}", q"{Чешиново-Облешево}", q"{Чучер-Сандево}"
		, q"{Штип}", q"{Шуто Оризари}" ];

		return choice(strs, this.rnd);
	}

	override string locationCityPattern() {
		final switch(uniform(0, 1, this.rnd)) {
			case 0: return locationCityName();
		}
		return "";
	}

	override string locationCountry() {
		const string[] strs =
		[ q"{Авганистан}", q"{Австралија}", q"{Австрија}", q"{Азербејџан}"
		, q"{Албанија}", q"{Алжир}", q"{Американска Самоа}", q"{Американски Девствени Острови}"
		, q"{Ангила}", q"{Ангола}", q"{Андора}", q"{Антарктик}", q"{Антигва и Барбуда}"
		, q"{Аргентина}", q"{Аруба}", q"{Бангладеш}", q"{Барбадос}"
		, q"{Бахами}", q"{Бахреин}", q"{Белгија}", q"{Белиз}", q"{Белорусија}"
		, q"{Бенин}", q"{Бермуда}", q"{Божиќен Остров}", q"{Боливија}"
		, q"{Босна и Херцеговина}", q"{Боцвана}", q"{Бразил}"
		, q"{Брег на Слоновата Коска}", q"{Британска Индоокеанска Територија}"
		, q"{Британски Девствени Острови}", q"{Брунеј}", q"{Бугарија}"
		, q"{Буркина Фасо}", q"{Бурунди}", q"{Бутан}", q"{Валис и Футуна}"
		, q"{Вануату}", q"{Венецуела}", q"{Виетнам}", q"{Габон}", q"{Гамбија}"
		, q"{Гана}", q"{Гваделуп}", q"{Гвајана}", q"{Гватемала}", q"{Гвинеја}"
		, q"{Гвинеја-Бисао}", q"{Германија}", q"{Гернзи}", q"{Гибралтар}"
		, q"{Гренада}", q"{Гренланд}", q"{Грузија}", q"{Грција}", q"{Гуам}"
		, q"{Данска}", q"{Демократска Народна Република Кореја}"
		, q"{Доминика}", q"{Доминиканска Република}", q"{Египет}"
		, q"{Еквадор}", q"{Екваторска Гвинеја}", q"{Ел Салвадор}"
		, q"{Еритреја}", q"{Ерменија}", q"{Есватини}", q"{Естонија}"
		, q"{Етиопија}", q"{Замбија}", q"{Западна Сахара}", q"{Зелен ’Рт}"
		, q"{Зимбабве}", q"{Израел}", q"{Индија}", q"{Индонезија}"
		, q"{Ирак}", q"{Иран}", q"{Ирска}", q"{Исланд}", q"{Источен Тимор}"
		, q"{Италија}", q"{Јамајка}", q"{Јапонија}", q"{Јемен}", q"{Јордан}"
		, q"{Јужна Африка}", q"{Јужна Џорџија и Јужни Сендвички Острови}"
		, q"{Казакстан}", q"{Кајмански Острови}", q"{Камбоџа}"
		, q"{Камерун}", q"{Канада}", q"{Катар}", q"{Кенија}", q"{Кина}"
		, q"{Кипар}", q"{Киргистан}", q"{Кирибати}", q"{Кокосови Острови}"
		, q"{Колумбија}", q"{Комори}", q"{Конго}", q"{Костарика}"
		, q"{Куба}", q"{Кувајт}", q"{Кукови Острови}", q"{Лаос}", q"{Лесото}"
		, q"{Летонија}", q"{Либан}", q"{Либерија}", q"{Либија}", q"{Литванија}"
		, q"{Лихтенштајн}", q"{Луксембург}", q"{Мавританија}"
		, q"{Маврициус}", q"{Мадагаскар}", q"{Мајот}", q"{Макао}"
		, q"{Македонија}", q"{Малави}", q"{Малдиви}", q"{Малезија}"
		, q"{Мали}", q"{Мали оддалечени острови на САД}", q"{Малта}"
		, q"{Мароко}", q"{Мартиник}", q"{Маршалски Острови}"
		, q"{Мексико}", q"{Микронезија}", q"{Мјанмар}", q"{Мозамбик}"
		, q"{Молдавија}", q"{Монако}", q"{Монголија}", q"{Монтсерат}"
		, q"{Намибија}", q"{Науру}", q"{Непал}", q"{Нигер}", q"{Нигерија}"
		, q"{Никарагва}", q"{Ниуе}", q"{Нова Каледонија}", q"{Нов Зеланд}"
		, q"{Норвешка}", q"{Норфолшски Остров}", q"{Обединети Арапски Емирати}"
		, q"{Обединето Кралство}", q"{Оман}", q"{Остров Буве}"
		, q"{Остров Ман}", q"{Остров Хард и острови Мекдоналд}"
		, q"{Пакистан}", q"{Палау}", q"{Палестина (автономни територии)}"
		, q"{Панама}", q"{Папуа Нова Гвинеја}", q"{Парагвај}"
		, q"{Перу}", q"{Питкернски Острови}", q"{Полска}", q"{Порторико}"
		, q"{Португалија}", q"{Реинион}", q"{Република Кореја}"
		, q"{Романија}", q"{Руанда}", q"{Русија}", q"{Самоа}", q"{Сан Марино}"
		, q"{Сао Томе и Принсипе}", q"{Саудиска Арабија}"
		, q"{Свалбард и Јан Мајен}", q"{Света Елена (остров)}"
		, q"{Света Луција}", q"{Света Столица (Држава на градот Ватикан)}"
		, q"{Свети Вартоломеј}", q"{Свети Винсент и Гренадини}"
		, q"{Свети Кристофер и Невис}", q"{Свети Мартин (остров)}"
		, q"{Свети Пјер и Микелон}", q"{Северни Маријански Острови}"
		, q"{Сејшели}", q"{Сенегал}", q"{Сиера Леоне}", q"{Сингапур}"
		, q"{Сирија}", q"{Словачка}", q"{Словенија}", q"{Соединети Американски Држави}"
		, q"{Соломонски Острови}", q"{Сомалија}", q"{Србија}"
		, q"{Судан}", q"{Суринам}", q"{Тајван}", q"{Тајланд}", q"{Танзанија}"
		, q"{Таџикистан}", q"{Того}", q"{Токелау}", q"{Тонга}", q"{Тринидад и Тобаго}"
		, q"{Тувалу}", q"{Тунис}", q"{Туркменистан}", q"{Туркс и Кајкос}"
		, q"{Турција}", q"{Уганда}", q"{Узбекистан}", q"{Украина}"
		, q"{Унгарија}", q"{Уругвај}", q"{Фарски Острови}", q"{Филипини}"
		, q"{Финска}", q"{Фиџи}", q"{Фолкландски Острови}", q"{Франција}"
		, q"{Француска Гвајана}", q"{Француска Полинезија}"
		, q"{Француски јужни и арктички територии}", q"{Хаити}"
		, q"{Холандија}", q"{Холандски Антили}", q"{Хонгконг}"
		, q"{Хондурас}", q"{Хрватска}", q"{Централноафриканската Република}"
		, q"{Црна Гора}", q"{Чад}", q"{Чешка}", q"{Чиле}", q"{Џерси}", q"{Џибути}"
		, q"{Швајцарија}", q"{Шведска}", q"{Шпанија}", q"{Шри Ланка}" ];

		return choice(strs, this.rnd);
	}

	override string locationDefaultCountry() {
		const string[] strs =
		[ q"{Македонија}" ];

		return choice(strs, this.rnd);
	}

	override string locationPostcode() {
		const string[] strs =
		[ q"{####}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationSecondaryAddress() {
		const string[] strs =
		[ q"{кат #}", q"{стан ##}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationState() {
		const string[] strs =
		[ q"{Аеродром}", q"{Арачиново}", q"{Берово}", q"{Битола}", q"{Богданци}"
		, q"{Боговиње}", q"{Босилово}", q"{Брвеница}", q"{Бутел}"
		, q"{Валандово}", q"{Василево}", q"{Вевчани}", q"{Велес}"
		, q"{Виница}", q"{Врапчиште}", q"{Гази Баба}", q"{Гевгелија}"
		, q"{Гостивар}", q"{Градско}", q"{Дебар}", q"{Дебрца}", q"{Делчево}"
		, q"{Демир Капија}", q"{Демир Хисар}", q"{Дојран}", q"{Долнени}"
		, q"{Ѓорче Петров}", q"{Желино}", q"{Зелениково}", q"{Зрновци}"
		, q"{Илинден}", q"{Јегуновце}", q"{Кавадарци}", q"{Карбинци}"
		, q"{Карпош}", q"{Кисела Вода}", q"{Кичево}", q"{Конче}", q"{Кочани}"
		, q"{Кратово}", q"{Крива Паланка}", q"{Кривогаштани}"
		, q"{Крушево}", q"{Куманово}", q"{Липково}", q"{Лозово}", q"{Маврово и Ростуше}"
		, q"{Македонска Каменица}", q"{Македонски Брод}"
		, q"{Могила}", q"{Неготино}", q"{Новаци}", q"{Ново Село}"
		, q"{Охрид}", q"{Петровец}", q"{Пехчево}", q"{Пласница}", q"{Прилеп}"
		, q"{Пробиштип}", q"{Радовиш}", q"{Ранковце}", q"{Ресен}"
		, q"{Росоман}", q"{Сарај}", q"{Свети Николе}", q"{Сопиште}"
		, q"{Старо Нагоричане}", q"{Струга}", q"{Струмица}", q"{Студеничани}"
		, q"{Теарце}", q"{Тетово}", q"{Центар}", q"{Центар Жупа}"
		, q"{Чаир}", q"{Чашка}", q"{Чешиново-Облешево}", q"{Чучер-Сандево}"
		, q"{Штип}", q"{Шуто Оризари}" ];

		return choice(strs, this.rnd);
	}

	override string locationStreetAddress() {
		const LocationStreetAddressEnum[] enums = [ LocationStreetAddressEnum.normal, LocationStreetAddressEnum.full ];
		return locationStreetAddress(choice(enums, this.rnd));
	}

	override string locationStreetAddress(LocationStreetAddressEnum which) {
		final switch(which) {
			case LocationStreetAddressEnum.normal: return locationStreet() ~ " " ~ locationBuildingNumber();
			case LocationStreetAddressEnum.full: return locationStreet() ~ " " ~ locationBuildingNumber() ~ " " ~ locationSecondaryAddress();
		}
		return "";
	}

	override string locationStreetName() {
		const string[] strs =
		[ q"{11. Октомври}", q"{12. Македонска Народноослободителна Ударна Бригада}"
		, q"{13. Август}", q"{13. Ноември}", q"{14. Декември}", q"{15. Македонски Корпус}"
		, q"{20. Октомври}", q"{23. Октомври}", q"{50. Македонска Дивизија}"
		, q"{8. Март}", q"{8. Септември}", q"{9. Мај}", q"{Аврам Пишевски}"
		, q"{Австралиска}", q"{Александар Бујанов}", q"{Александар Македонски}"
		, q"{Александар Мартулков}", q"{Александар Пушкин}"
		, q"{Александар Турунџев}", q"{Александар Урдаревски - Санде}"
		, q"{Алексо Демниевски - Бауман}", q"{Алжирска}", q"{Аминта III}"
		, q"{Анастас Митрев}", q"{Ангел Винички}", q"{Ангел Димовски}"
		, q"{Ангел Динев}", q"{Андон Дуков}", q"{Андон Кецкаров}"
		, q"{Андон Папрадишки}", q"{Андон Тошев}", q"{Андреа Зограф}"
		, q"{Анкарска}", q"{Анте Хаџи Митков}", q"{Антифашистички Фронт на Жените}"
		, q"{Антифашистичко Собрание на Народното Ослободување на Македонија}", q"{Антон Панов}"
		, q"{Антон Попов}", q"{Антон Чехов}", q"{Апостол Гусларот}"
		, q"{Апостол Петков}", q"{Арсениј Јовков}", q"{Арсо Мицков}"
		, q"{Архиепископ Ангелариј}", q"{Архиепископ Доситеj}"
		, q"{Архимедова}", q"{Архитект Сотир Томовски}", q"{Атанас Димитров - Бабата}"
		, q"{Атанас Иљовски}", q"{Атанас Раздолов}", q"{Атинска}"
		, q"{Ацо Караманов}", q"{Ацо Шопов}", q"{Бабуна}", q"{Багдадска}"
		, q"{Балканска}", q"{Банатска}", q"{Баница}", q"{Банско}"
		, q"{Бардовечки Пат}", q"{Беласица}", q"{Белградска}"
		, q"{Бел Камен}", q"{Белчишка}", q"{Беровска}", q"{Бертранд Расел}"
		, q"{Бистра}", q"{Бетовенова}", q"{Битолска}", q"{Битпазарска}"
		, q"{Благоја Вујов}", q"{Благоја Гојан}", q"{Благоја Стефковски}"
		, q"{Благој Давков - Блацки}", q"{Благој Деспотовски - Шовељ}"
		, q"{Благој Јанков - Мучето}", q"{Благој Страчков}"
		, q"{Блаже Крстев - Биринчето}", q"{Блажо Нешков}"
		, q"{Бледски Договор}", q"{Богомилски Поход}", q"{Божидар Аџија}"
		, q"{Божин Николов - Силни}", q"{Божин Стизов}", q"{Божин Стојков}"
		, q"{Бојаџиска}", q"{Боривој Милошевски}", q"{Борис Бојаџиски}"
		, q"{Борис Кидрич}", q"{Борис Сарафов}", q"{Борис Траjковски}"
		, q"{Борка Талески}", q"{Боро Боцевски - Боте}", q"{Боро Камчевски}"
		, q"{Боро Кралевски}", q"{Боро Менков}", q"{Боро Петрушевски}"
		, q"{Боца Ивановска}", q"{Браќа Галеви}", q"{Браќа Кошулчеви}"
		, q"{Бранко Заревски}", q"{Брегалница}", q"{Бриселска}"
		, q"{Будимпештанска}", q"{Букурешка}", q"{Бутелска}"
		, q"{Бутелски Венец}", q"{Валандовска}", q"{Вангел Тодоровски - Мајорот}"
		, q"{Ванчо Мицков}", q"{Вардар}", q"{Вардарска}", q"{Варшавска}"
		, q"{Васил Аџиларски}", q"{Васил Главинов}", q"{Васил Ѓоргов}"
		, q"{Васил Стефановски}", q"{Васил Чакаларов}", q"{Васко Карајанов}"
		, q"{Васко Карангелески}", q"{Ваташа}", q"{Веле Марков}"
		, q"{Велешка}", q"{Венијамин Мачуковски}", q"{Вера Циривири - Трена}"
		, q"{Видое Смилевски - Бато}", q"{Виенска}", q"{Виетнамска}"
		, q"{Виктор Иго}", q"{Вилијам Шекспир}", q"{Виничка}"
		, q"{Винсент Ван Гог}", q"{Владимир Каваев}", q"{Владимир Мајаковски}"
		, q"{Владимир Полежиноски - Полежина}", q"{Влае}"
		, q"{Внатрешна Македонска Револуционерна Организација}", q"{Воденска}"
		, q"{Водоча}", q"{Војвода Ивец}", q"{Војдан Чернодрински}"
		, q"{Волковска}", q"{Волфганг Амадеус Моцарт}", q"{Востаничка}"
		, q"{Гаврил Лесновски}", q"{Гаврило Радомир}", q"{Галичица}"
		, q"{Галичник}", q"{Гемиџиска}", q"{Георги Димитров}"
		, q"{Георгиј Кастриот - Скендер Бег}", q"{Георги Казепов}"
		, q"{Георги Пешков}", q"{Георги Поп Христов}", q"{Георги Стрижевски}"
		, q"{Герман}", q"{Герника}", q"{Гиго Михајловски}", q"{Ѓорѓе Андреевиќ - Кун}"
		, q"{Ѓорѓи Абаџиев}", q"{Ѓорѓи Динков - Динката}"
		, q"{Ѓорѓија Пулески}", q"{Ѓорѓи Капчев}", q"{Ѓорѓи Костовски}"
		, q"{Ѓорѓи Сугарев}", q"{Ѓоре Ѓорески}", q"{Горноврановска}"
		, q"{Горно Лисиче}", q"{Ѓорче Петров}", q"{Гостиварска}"
		, q"{Гоце Делчев}", q"{Григор Прличев}", q"{Груица Војвода}"
		, q"{Ѓузепе Гарибалди}", q"{Ѓуро Малешевец}", q"{Ѓуро Салај}"
		, q"{Ѓуро Стругар}", q"{Ѓурчин Кокале}", q"{Дабничка}"
		, q"{Дамаска}", q"{Даме Груев}", q"{Дамјан Крапчев - Стари}"
		, q"{Даскал Камче}", q"{Даутица}", q"{Дебарска}", q"{Дебарца}"
		, q"{Дејан Војвода}", q"{Демир Трајко}", q"{Депа Кавајова}"
		, q"{Дижонска}", q"{Диме Анцин}", q"{Диме Мечето}", q"{Димитар Благоев}"
		, q"{Димитар Василев - Македонски}", q"{Димитар Влахов}"
		, q"{Димитар Гуштанов}", q"{Димитар Мирачиев}", q"{Димитар Николовски - Таки Даскалот}"
		, q"{Димитар Пандилов}", q"{Димитар Поп-Георгиев Беровски}"
		, q"{Димитар Туриманџоски}", q"{Димитрија Чуповски}"
		, q"{Димо Хаџи Димов}", q"{Димче Мирчев}", q"{Дичо Петров}"
		, q"{Добри Даскалов}", q"{Драган Ѓаконовски - Шпато}"
		, q"{Драга Стојановска}", q"{Драмска}", q"{Дрезденска}"
		, q"{Дренак}", q"{Дреновска Клисура}", q"{Дринска}", q"{Дубровничка}"
		, q"{Дурмиторска}", q"{Душко Бојковски}", q"{Евлија Челебија}"
		, q"{Езерци}", q"{Елисие Поповски - Марко}", q"{Емил Зола}"
		, q"{Ениџе Вардар}", q"{Ернесто Че Гевара}", q"{Ефтим Спространов}"
		, q"{Жданец}", q"{Жеденска}", q"{Женевска}", q"{Живко Чинго}"
		, q"{Жил Верн}", q"{Жорж Бизе}", q"{Загребска}", q"{Зејнел Ајдини}"
		, q"{Зеленгора}", q"{Зеничка}", q"{Зеф Љуш Марку}", q"{Злате Михајловски}"
		, q"{Златко Шнајдер}", q"{Ибе Паликуќа}", q"{Иван Аговски}"
		, q"{Иван Козаров}", q"{Иван Мажураниќ}", q"{Иван Наумов - Алабакот}"
		, q"{Иван Тургењев}", q"{Иван Хаџи Николов}", q"{Иван Цанкар}"
		, q"{Извор}", q"{Илија Димовски - Гоце}", q"{Илија Марков}"
		, q"{Илија Плавев}", q"{Илија Ристовски}", q"{Илинден}"
		, q"{Иљо Војвода}", q"{Индира Ганди}", q"{Индустриска}"
		, q"{Исаија Мажовски}", q"{Истарска}", q"{Јабланица}"
		, q"{Јадранска}", q"{Јајце}", q"{Јакупица}", q"{Јане Сандански}"
		, q"{Јани Лукровски}", q"{Јоаким Крчовски}", q"{Јован Кукузел}"
		, q"{Јорганџиска}", q"{Јордан Николов - Орце}", q"{Јордан Пиперков - Пиперката}"
		, q"{Јордан Поп Јорданов - Орцето}", q"{Јордан Филиповски}"
		, q"{Јордан Хаџи Константинов - Џинот}", q"{Јордан Чопела - Орде}"
		, q"{Јосип Јуриј Штросмаер}", q"{Јосиф Даскалов}"
		, q"{Јосиф Јосифовски - Свештарот}", q"{Јосиф Михајловиќ}"
		, q"{Јохан Гутенберг}", q"{Јуриј Гагарин}", q"{Јуриј Розентал}"
		, q"{Јустинијан I}", q"{Кавадаречка}", q"{Кавалска}", q"{Кадињача}"
		, q"{Казанџиска}", q"{Каирска}", q"{Кајларска}", q"{Камник}"
		, q"{Капиштец}", q"{Караорман}", q"{Кара Трифун}", q"{Караџица}"
		, q"{Карбуница}", q"{Карпошово Востание}", q"{Катлановска}"
		, q"{Кемал Сејфула}", q"{Керамидница}", q"{Кипарска}"
		, q"{Кирe Гаврилоски - Јане}", q"{Кирил и Методиј}"
		, q"{Кирил Манчев}", q"{Кирил Пејчиновиќ - Тетоец}"
		, q"{Киро Глигоров}", q"{Киро Димишков}", q"{Киро Крстески - Платник}"
		, q"{Киро Нацев - Фетак}", q"{Китка}", q"{Кичевска}", q"{Клепа}"
		, q"{Климент Охридски}", q"{Клисурска}", q"{Ковачка}"
		, q"{Кожув}", q"{Козјак}", q"{Козле}", q"{Коле Канински}"
		, q"{Коле Неделковски}", q"{Копачка}", q"{Кораб}", q"{Корџевска}"
		, q"{Коста Абраш}", q"{Коста Веселинов}", q"{Коста Кирков}"
		, q"{Коста Ристовски}", q"{Коста Солев}", q"{Коста Шахов}"
		, q"{Костурска}", q"{Костурски Херои}", q"{Коце Металец}"
		, q"{Кочанска}", q"{Кочо Рацин}", q"{Краишка}", q"{Крали Марко}"
		, q"{Кратовска}", q"{Кримска}", q"{Крсте Асенов}", q"{Крсте Гермов - Шаќир}"
		, q"{Крсте Мисирков}", q"{Крсто Раковски}", q"{Крушевска Република}"
		, q"{Крчин}", q"{Кузман Јосифоски - Питу}", q"{Кузман Шапкарев}"
		, q"{Кујунџиска}", q"{Кукушка}", q"{Кумановска}", q"{Кумбара}"
		, q"{Кумровец}", q"{Лав Толстој}", q"{Лавчанска Корија}"
		, q"{Лазар Дамовски - Ошенски}", q"{Лазар Димитров}"
		, q"{Лазар Личеноски}", q"{Лазар Поп Трајков}", q"{Лазар Танев}"
		, q"{Лазар Трповски}", q"{Лазо Дренков}", q"{Лазо Москов}"
		, q"{Лајош Кошут}", q"{Леринска}", q"{Лесновска}", q"{Лисец}"
		, q"{Лихнида}", q"{Локов}", q"{Лондонска}", q"{Луj Пастер}"
		, q"{Лудвиг Ван Бетовен}", q"{Љубин}", q"{Љубљанска}"
		, q"{Љубо Здравковски - Орлов}", q"{Људевит Гај}"
		, q"{Мавровска}", q"{Мајка Тереза}", q"{Мајски Манифест}"
		, q"{Македонија}", q"{Македонска Војска}", q"{Македонска Преродба}"
		, q"{Македонски Кралеви}", q"{Македонско-косовска ударна бригада}"
		, q"{Максим Горки}", q"{Малешевска}", q"{Малина Попиванова}"
		, q"{МАНАПО}", q"{Манчу Матак}", q"{Мара Междуречка}"
		, q"{Марија Кири Склодовска}", q"{Мариовска}", q"{Марјан Лазевски}"
		, q"{Маркова Река}", q"{Марко Цепенков}", q"{Марк Твен}"
		, q"{Маршал Тито}", q"{Махатма Ганди}", q"{Маџари}", q"{Маџир Маало}"
		, q"{Мегленска}", q"{Места}", q"{Методија Андонов - Ченто}"
		, q"{Методија Патчев}", q"{Методија Шаторов - Шарло}"
		, q"{Метохиска}", q"{Мечкин Камен}", q"{Мијачка}", q"{Милан Комненоски}"
		, q"{Миле Поп Јорданов}", q"{Мирка Гинова}", q"{Мирче Ацев}"
		, q"{Мирче Мацанов}", q"{Мис Елен Стон}", q"{Мите Богоевски}"
		, q"{Мито Хаџивасилев - Јасмин}", q"{Митре Влаот}"
		, q"{Михаил Глинка}", q"{Михаил и Ефтихиј}", q"{Михаил Цоков}"
		, q"{Михаил Чаков}", q"{Мице Козароски - Јандре}"
		, q"{Мишевска}", q"{Мишко Михајловски}", q"{Модест Мусогорски}"
		, q"{Мокра}", q"{Момин Поток}", q"{Морава}", q"{Московска}"
		, q"{Мостарска}", q"{Мраморец}", q"{Мрежичка}", q"{Мукос}"
		, q"{Мустафа Кемал Ататурк}", q"{Мутавџиска}", q"{Надбискуп Чекада}"
		, q"{Надежда Крупскаја}", q"{Народен Фронт}", q"{Натанаил Кучевишки}"
		, q"{Наум Наумоски - Борче}", q"{Наум Охридски}", q"{Наум Чакаров}"
		, q"{Невена Георгиева - Дуња}", q"{Неврокопска}", q"{Негоричанска}"
		, q"{Неготинска}", q"{Никола Вапцаров}", q"{Никола Грчето}"
		, q"{Николај Островски}", q"{Никола Карев}", q"{Никола Киров - Мајски}"
		, q"{Никола Кљусев}", q"{Никола Коперник}", q"{Никола Малешевски}"
		, q"{Никола Мартиноски}", q"{Никола Парапунов}", q"{Никола Петров}"
		, q"{Никола Петров - Русински}", q"{Никола Пушкаров}"
		, q"{Никола Тесла}", q"{Никола Тримпаре}", q"{Ниџе Планина}"
		, q"{Нов Живот}", q"{Новопроектирана}", q"{Њуделхиска}"
		, q"{Овчеполска}", q"{Огражден}", q"{Опинчарска}", q"{Оровска}"
		, q"{Осло}", q"{Островска}", q"{Отокар Кершовани}", q"{Отон Жупанчич}"
		, q"{Охридска}", q"{Павел Шатев}", q"{Павле Илиќ}", q"{Пајак Планина}"
		, q"{Палмиро Тољати}", q"{Панајот Гиновски}", q"{Пандил Шишков}"
		, q"{Пандо Кљашев}", q"{Панко Брашнаров}", q"{Панче Арсовски}"
		, q"{Панче Неделковски}", q"{Папуџиска}", q"{Париска}"
		, q"{Париска Комуна}", q"{Партение Зографски}", q"{Партизански Одреди}"
		, q"{Патрис Лумумба}", q"{Пејо Јаворов}", q"{Пелинце}"
		, q"{Пелистерска}", q"{Пере Тошев}", q"{Перо Наков}", q"{Петар Ацев}"
		, q"{Петар Драпшин}", q"{Петар Ичко}", q"{Петар Манџуков}"
		, q"{Петар Поп Арсов}", q"{Петар Чајковски}", q"{Петар Чангов}"
		, q"{Петар Чаулев}", q"{Петко Јанчевски}", q"{Петре Георгиев}"
		, q"{Петре Пирузе}", q"{Петре Филиповски - Гарката}"
		, q"{Петричка}", q"{Пехчевска}", q"{Пијанец}", q"{Пиринска}"
		, q"{Питу Гули}", q"{Плачковица}", q"{Покриена Чаршија}"
		, q"{Полог}", q"{Поп Богомил}", q"{Прашка}", q"{Презвитер Константин}"
		, q"{Пресека}", q"{Преспанска}", q"{Пржино}", q"{Призренска}"
		, q"{Прилепска}", q"{Пробиштипска}", q"{Пролет}", q"{Просек}"
		, q"{Прохор Пчињски}", q"{Раде Јовчевски - Корчагин}"
		, q"{Радика}", q"{Радишанска}", q"{Радњанска}", q"{Радобил}"
		, q"{Радослав Петковски}", q"{Радушка}", q"{Разловечко Востание}"
		, q"{Разлошка}", q"{Рајко Жинзифов}", q"{Рампо Левков - Левката}"
		, q"{Рафаел Батино}", q"{Рељо Шесто Крило}", q"{Ресенска}"
		, q"{Речиште}", q"{Ризо Ризов}", q"{Римска}", q"{Ристо Равановски}"
		, q"{Ристо Шишков}", q"{Роcа Плавева}", q"{Роза Луксембург}"
		, q"{Рокомија}", q"{Романија}", q"{Ромен Ролан}", q"{Роналд Реган}"
		, q"{Рударска}", q"{Рудо}", q"{Румена Хаџи Панзова}", q"{Сава Михајлов}"
		, q"{Салих Асим}", q"{Самарџиска}", q"{Самоилова}", q"{Сараевска}"
		, q"{Сарачка}", q"{Саса}", q"{Свеќарска}", q"{Светиниколска}"
		, q"{Светозар Марковиќ}", q"{Серава}", q"{Сердарот}"
		, q"{Серска}", q"{Симеон Кавракиров}", q"{Симче Настевски}"
		, q"{Сирма Војвода}", q"{Славе Георгиевски - Шнајдер}"
		, q"{Славе Деловски}", q"{Славејко Арсов}", q"{Славеј Планина}"
		, q"{Славка Димкова}", q"{Славчо Стојменски}", q"{Сливовска}"
		, q"{Смилевска}", q"{Солунска}", q"{Солунска Глава}"
		, q"{Софиска}", q"{Софре Марковски}", q"{Спиро Големџиојски - Црне}"
		, q"{Спиро Гулапчев}", q"{Стале Попов}", q"{Стари Новак}"
		, q"{Стефан Верковиќ}", q"{Стефан Јакимов - Дедов}"
		, q"{Стефан Наумов - Стив}", q"{Стјепан Филиповиќ - Стево}"
		, q"{Стоби}", q"{Стогово}", q"{Стојко Јовановски}", q"{Стојна Стевкова}"
		, q"{Стокхолмска}", q"{Страхил Пинџуров}", q"{Страшо Пинџур}"
		, q"{Стрезово}", q"{Стрмашево}", q"{Струма}", q"{Струмичка}"
		, q"{Струмјани}", q"{Струшка}", q"{Тајмишка}", q"{Тале Христов}"
		, q"{Тасино Чешмиче}", q"{Ташкентска}", q"{Ташко Караџа}"
		, q"{Темко Попов}", q"{Теодосиј Гологанов}", q"{Теодосиј Синаитски}"
		, q"{Тиранска}", q"{Товарник}", q"{Тодор Александров}"
		, q"{Тодор Циповски - Мерџан}", q"{Тодор Чангов}"
		, q"{Тодор Чапов}", q"{Томас Минцер}", q"{Томе Арсовски}"
		, q"{Томе Пуре}", q"{Томе Стефановски}", q"{Томе Томшиќ}"
		, q"{Топаанска}", q"{Тоше Проески}", q"{Трајко Иванов}"
		, q"{Трајко Китанчев}", q"{Три Круши}", q"{Трифун Бузев}"
		, q"{Трифун Пановски}", q"{Трифун Хаџи Јанев}", q"{Трнодол}"
		, q"{Трпе Петревски}", q"{Тушинска}", q"{Ужичка Република}"
		, q"{Февруарски Поход}", q"{Федерико Гарсија Лорка}"
		, q"{Ферид Бајрам}", q"{Ферид Заири}", q"{Филип II Македонски}"
		, q"{Финска}", q"{Фјодор Достоевски}", q"{Франклин Рузвелт}"
		, q"{Франсоа Волтер}", q"{Франце Прешерн}", q"{Франц Лист}"
		, q"{Фрањо Клуз}", q"{Фредерик Шопен}", q"{Фуштанска}"
		, q"{Хаванска}", q"{Хаџи Јован Шишков}", q"{Хаџи Трајко}"
		, q"{Хашка}", q"{Хелсинки}", q"{Хераклеа Линкестис}"
		, q"{Хо Ши Мин}", q"{Христијан Тодоровски - Карпош}"
		, q"{Христо Батанџиев}", q"{Христо Смирненски}", q"{Христо Татарчев}"
		, q"{Христо Узунов}", q"{Христо Чернопеев}", q"{Хусеин Бајрам}"
		, q"{Цветан Димов - Чаирчанец}", q"{Цветан Цветковски}"
		, q"{Церска}", q"{Цетињска}", q"{Црвена Вода}", q"{Црвени Брегови}"
		, q"{Црниче}", q"{Црногорска}", q"{Црноок}", q"{Црноризец Храбар}"
		, q"{Чаирска}", q"{Чудомир Кантарџиев}", q"{Чупино Брдо}"
		, q"{Џумајска}", q"{Шандор Петефи}", q"{Шар Планина}"
		, q"{Шарски Одред}", q"{Шина Стојанова}", q"{Штипска}"
		, q"{Шундаревска}" ];

		return choice(strs, this.rnd);
	}

	override string locationStreetPattern() {
		final switch(uniform(0, 1, this.rnd)) {
			case 0: return locationStreetName();
		}
		return "";
	}

	override string personFemaleFirstName() {
		const string[] strs =
		[ q"{Ава}", q"{Александра}", q"{Ана}", q"{Анастасија}", q"{Анѓа}"
		, q"{Ангела}", q"{Ангелина}", q"{Анче}", q"{Атанасија}", q"{Билјана}"
		, q"{Бисера}", q"{Бистра}", q"{Блага}", q"{Благица}", q"{Благојка}"
		, q"{Благородна}", q"{Благуна}", q"{Блаженка}", q"{Богдана}"
		, q"{Богиња}", q"{Божана}", q"{Бојана}", q"{Борјана}", q"{Борка}"
		, q"{Босилка}", q"{Бранка}", q"{Валентина}", q"{Вања}", q"{Варвара}"
		, q"{Василка}", q"{Василија}", q"{Васка}", q"{Велика}", q"{Вера}"
		, q"{Вероника}", q"{Весела}", q"{Весна}", q"{Виолета}", q"{Војданка}"
		, q"{Воскресија}", q"{Габриела}", q"{Галаба}", q"{Галена}"
		, q"{Голубинка}", q"{Гордана}", q"{Горица}", q"{Горјана}"
		, q"{Грозда}", q"{Дамјана}", q"{Даница}", q"{Данка}", q"{Даринка}"
		, q"{Дафина}", q"{Деница}", q"{Десанка}", q"{Деспина}", q"{Дивна}"
		, q"{Добрила}", q"{Добринка}", q"{Домника}", q"{Донка}", q"{Драга}"
		, q"{Драгана}", q"{Душанка}", q"{Душка}", q"{Ѓурѓа}", q"{Ѓурѓица}"
		, q"{Ева}", q"{Евгенија}", q"{Евдокија}", q"{Екатерина}", q"{Елена}"
		, q"{Елеонора}", q"{Елисавета}", q"{Елица}", q"{Елка}", q"{Есма}"
		, q"{Ефимија}", q"{Ефросина}", q"{Живка}", q"{Загорка}", q"{Зафирка}"
		, q"{Захаринка}", q"{Здравка}", q"{Злата}", q"{Зора}", q"{Зорица}"
		, q"{Зорка}", q"{Ѕвезда}", q"{Ива}", q"{Ивана}", q"{Иванка}", q"{Илинденка}"
		, q"{Илинка}", q"{Ирина}", q"{Искра}", q"{Јаворка}", q"{Јагода}"
		, q"{Јадранка}", q"{Јана}", q"{Јанка}", q"{Јасна}", q"{Јована}"
		, q"{Јовка}", q"{Јордана}", q"{Јорданка}", q"{Јулијана}", q"{Калина}"
		, q"{Каранфилка}", q"{Ката}", q"{Катерина}", q"{Катина}", q"{Катица}"
		, q"{Катја}", q"{Кераца}", q"{Кита}", q"{Климентина}", q"{Константина}"
		, q"{Косара}", q"{Костадинка}", q"{Крстана}", q"{Лена}", q"{Ленче}"
		, q"{Лепа}", q"{Лидија}", q"{Лика}", q"{Лилјана}", q"{Лина}", q"{Љуба}"
		, q"{Љубинка}", q"{Љубица}", q"{Љупка}", q"{Магдалена}", q"{Македонка}"
		, q"{Макрина}", q"{Мара}", q"{Марија}", q"{Марика}", q"{Марина}"
		, q"{Марта}", q"{Матрона}", q"{Меглена}", q"{Меланија}", q"{Мена}"
		, q"{Мери}", q"{Милева}", q"{Милена}", q"{Милица}", q"{Милка}"
		, q"{Мирјана}", q"{Мирка}", q"{Нада}", q"{Надежда}", q"{Наумка}"
		, q"{Невенка}", q"{Неда}", q"{Неделка}", q"{Никодина}", q"{Николина}"
		, q"{Олга}", q"{Оливера}", q"{Павлина}", q"{Павлинка}", q"{Параскева}"
		, q"{Пауна}", q"{Пелагија}", q"{Петкана}", q"{Петра}", q"{Петранка}"
		, q"{Писана}", q"{Радмила}", q"{Рајна}", q"{Ракита}", q"{Рафаила}"
		, q"{Рахела}", q"{Рахилка}", q"{Ристана}", q"{Родна}", q"{Роса}"
		, q"{Роска}", q"{Ружа}", q"{Румена}", q"{Русалина}", q"{Русанка}"
		, q"{Сава}", q"{Сандра}", q"{Сара}", q"{Сашка}", q"{Светлана}"
		, q"{Серафима}", q"{Симјанка}", q"{Симона}", q"{Славенка}"
		, q"{Славица}", q"{Славјанка}", q"{Славка}", q"{Слободанка}"
		, q"{Снежана}", q"{Сончица}", q"{Софија}", q"{Спаса}", q"{Спасена}"
		, q"{Споменка}", q"{Сребра}", q"{Стамена}", q"{Стефанија}"
		, q"{Стефанка}", q"{Стојанка}", q"{Стојна}", q"{Стојмена}"
		, q"{Сузана}", q"{Тамара}", q"{Таска}", q"{Татјана}", q"{Темјана}"
		, q"{Теодора}", q"{Теодосија}", q"{Теофилка}", q"{Тодорка}"
		, q"{Трајанка}", q"{Трена}", q"{Трендафилка}", q"{Убавка}"
		, q"{Фана}", q"{Фанка}", q"{Филимена}", q"{Флоринка}", q"{Фросина}"
		, q"{Христина}", q"{Цара}", q"{Цвета}", q"{Цветанка}" ];

		return choice(strs, this.rnd);
	}

	override string personFemalePrefix() {
		const string[] strs =
		[ q"{г-ѓа}", q"{г-ца}", q"{д-р}", q"{м-р}" ];

		return choice(strs, this.rnd);
	}

	override string personFirstName() {
		const string[] strs =
		[ q"{Ѓоко}", q"{Ѓоре}", q"{Ѓорче}", q"{Ѓорѓи}", q"{Ѓурчин}", q"{Ѓурѓа}"
		, q"{Ѓурѓица}", q"{Ѕвезда}", q"{Ѕвездан}", q"{Ѕвонко}", q"{Јаворка}"
		, q"{Јагода}", q"{Јадранка}", q"{Јаков}", q"{Јана}", q"{Јане}"
		, q"{Јанка}", q"{Јасна}", q"{Јоаким}", q"{Јован}", q"{Јована}"
		, q"{Јованче}", q"{Јовица}", q"{Јовка}", q"{Јово}", q"{Јозо}", q"{Јонче}"
		, q"{Јордан}", q"{Јордана}", q"{Јорданка}", q"{Јосиф}", q"{Јулијана}"
		, q"{Љуба}", q"{Љубе}", q"{Љубен}", q"{Љубинка}", q"{Љубица}", q"{Љубиша}"
		, q"{Љубомир}", q"{Љупка}", q"{Љупчо}", q"{Ава}", q"{Александар}"
		, q"{Александра}", q"{Алексо}", q"{Ана}", q"{Анастасија}"
		, q"{Ангел}", q"{Ангела}", q"{Ангеле}", q"{Ангелина}", q"{Андон}"
		, q"{Андреј}", q"{Андреја}", q"{Анте}", q"{Антим}", q"{Антон}"
		, q"{Антониј}", q"{Анче}", q"{Анѓа}", q"{Апостол}", q"{Арсениј}"
		, q"{Асен}", q"{Атанас}", q"{Атанасиј}", q"{Атанасија}", q"{Ацо}"
		, q"{Билјана}", q"{Бисера}", q"{Бистра}", q"{Блага}", q"{Благе}"
		, q"{Благица}", q"{Благородна}", q"{Благој}", q"{Благоја}"
		, q"{Благојка}", q"{Благуна}", q"{Блаже}", q"{Блаженка}", q"{Богатин}"
		, q"{Богдан}", q"{Богдана}", q"{Богиња}", q"{Богослав}", q"{Богоја}"
		, q"{Божана}", q"{Божидар}", q"{Божин}", q"{Божо}", q"{Борис}"
		, q"{Борислав}", q"{Борка}", q"{Борко}", q"{Боро}", q"{Борјан}"
		, q"{Борјана}", q"{Босилка}", q"{Бошко}", q"{Бојан}", q"{Бојана}"
		, q"{Бранка}", q"{Бранко}", q"{Валентина}", q"{Вангел}", q"{Ване}"
		, q"{Ванче}", q"{Ванчо}", q"{Варвара}", q"{Васил}", q"{Василиј}"
		, q"{Василија}", q"{Василка}", q"{Василко}", q"{Васка}", q"{Вања}"
		, q"{Велика}", q"{Велимир}", q"{Величко}", q"{Велјан}", q"{Венко}"
		, q"{Вера}", q"{Вероника}", q"{Весела}", q"{Веселин}", q"{Весна}"
		, q"{Вељо}", q"{Видое}", q"{Виктор}", q"{Виолета}", q"{Владимир}"
		, q"{Владо}", q"{Властимир}", q"{Воислав}", q"{Волче}", q"{Воскресија}"
		, q"{Војдан}", q"{Војданка}", q"{Војкан}", q"{Габриела}", q"{Гаврил}"
		, q"{Галаба}", q"{Галена}", q"{Гане}", q"{Георги}", q"{Герасим}"
		, q"{Глигор}", q"{Гого}", q"{Голубинка}", q"{Горан}", q"{Гордана}"
		, q"{Горица}", q"{Горјан}", q"{Горјана}", q"{Гоце}", q"{Григор}"
		, q"{Грозда}", q"{Гроздан}", q"{Давид}", q"{Дамјан}", q"{Дамјана}"
		, q"{Данаил}", q"{Даниел}", q"{Даница}", q"{Данка}", q"{Данчо}"
		, q"{Даринка}", q"{Дарко}", q"{Дафина}", q"{Делчо}", q"{Делјан}"
		, q"{Деница}", q"{Десанка}", q"{Деспина}", q"{Дејан}", q"{Дивна}"
		, q"{Диме}", q"{Димитар}", q"{Димитрие}", q"{Димитриј}", q"{Димитрија}"
		, q"{Димко}", q"{Димо}", q"{Димче}", q"{Добри}", q"{Добрила}", q"{Добринка}"
		, q"{Домника}", q"{Донка}", q"{Доротеј}", q"{Дојчин}", q"{Драга}"
		, q"{Драган}", q"{Драгана}", q"{Драги}", q"{Драгиша}", q"{Драгомир}"
		, q"{Драгослав}", q"{Драгољуб}", q"{Душан}", q"{Душанка}"
		, q"{Душка}", q"{Душко}", q"{Ева}", q"{Евгениј}", q"{Евгенија}"
		, q"{Евдокија}", q"{Евтим}", q"{Екатерина}", q"{Елена}", q"{Елеонора}"
		, q"{Елисавета}", q"{Елица}", q"{Елка}", q"{Емануел}", q"{Емил}"
		, q"{Еразмо}", q"{Есма}", q"{Ефимија}", q"{Ефросина}", q"{Ефтим}"
		, q"{Живка}", q"{Живко}", q"{Загорка}", q"{Зафир}", q"{Зафирка}"
		, q"{Захаринка}", q"{Захариј}", q"{Здравка}", q"{Здравко}"
		, q"{Злата}", q"{Златан}", q"{Злате}", q"{Златко}", q"{Зора}", q"{Зоран}"
		, q"{Зорица}", q"{Зорка}", q"{Ива}", q"{Иван}", q"{Ивана}", q"{Иванка}"
		, q"{Ивко}", q"{Иво}", q"{Игнат}", q"{Игор}", q"{Илинденка}", q"{Илинка}"
		, q"{Илија}", q"{Ирина}", q"{Исак}", q"{Искра}", q"{Калина}", q"{Каранфилка}"
		, q"{Ката}", q"{Катерина}", q"{Катина}", q"{Катица}", q"{Катја}"
		, q"{Кераца}", q"{Кирил}", q"{Киро}", q"{Кита}", q"{Климент}", q"{Климентина}"
		, q"{Козма}", q"{Коле}", q"{Константин}", q"{Константина}"
		, q"{Косара}", q"{Костадин}", q"{Костадинка}", q"{Коце}", q"{Кочо}"
		, q"{Крстана}", q"{Крсте}", q"{Крсто}", q"{Круме}", q"{Ксенте}"
		, q"{Кузман}", q"{Лазар}", q"{Лазо}", q"{Лена}", q"{Ленче}", q"{Леонид}"
		, q"{Лепа}", q"{Лидија}", q"{Лика}", q"{Лилјана}", q"{Лина}", q"{Лука}"
		, q"{Магдалена}", q"{Македон}", q"{Македонка}", q"{Макрина}"
		, q"{Максим}", q"{Мара}", q"{Марика}", q"{Марин}", q"{Марина}"
		, q"{Марија}", q"{Марко}", q"{Марта}", q"{Марјан}", q"{Мате}", q"{Матеја}"
		, q"{Матрона}", q"{Меглена}", q"{Меланија}", q"{Мена}", q"{Мери}"
		, q"{Мето}", q"{Методи}", q"{Методиј}", q"{Методија}", q"{Милан}"
		, q"{Миле}", q"{Милева}", q"{Милена}", q"{Милица}", q"{Милка}"
		, q"{Милош}", q"{Милчо}", q"{Минчо}", q"{Миодраг}", q"{Мирка}"
		, q"{Мирко}", q"{Мирослав}", q"{Мирче}", q"{Мирјана}", q"{Митре}"
		, q"{Михаил}", q"{Михајло}", q"{Михо}", q"{Мичо}", q"{Младен}"
		, q"{Момо}", q"{Момчило}", q"{Нада}", q"{Надежда}", q"{Нанче}"
		, q"{Наум}", q"{Наумка}", q"{Небојша}", q"{Невенка}", q"{Неда}"
		, q"{Неделка}", q"{Неделко}", q"{Ненад}", q"{Неофит}", q"{Нестор}"
		, q"{Нешо}", q"{Никита}", q"{Никифор}", q"{Никодим}", q"{Никодина}"
		, q"{Никола}", q"{Николина}", q"{Огнен}", q"{Олга}", q"{Оливер}"
		, q"{Оливера}", q"{Орде}", q"{Павле}", q"{Павлина}", q"{Павлинка}"
		, q"{Пантелејмон}", q"{Панче}", q"{Параскева}", q"{Партениј}"
		, q"{Паскал}", q"{Пауна}", q"{Пелагија}", q"{Пенчо}", q"{Перо}"
		, q"{Петар}", q"{Петкана}", q"{Петко}", q"{Петра}", q"{Петранка}"
		, q"{Петре}", q"{Пеце}", q"{Пимен}", q"{Писана}", q"{Прокопиј}"
		, q"{Прохор}", q"{Раде}", q"{Радмила}", q"{Радован}", q"{Ракита}"
		, q"{Ранко}", q"{Рафаила}", q"{Рахела}", q"{Рахилка}", q"{Рајко}"
		, q"{Рајна}", q"{Ризо}", q"{Ристана}", q"{Ристе}", q"{Ристо}", q"{Родна}"
		, q"{Ромил}", q"{Роса}", q"{Роска}", q"{Ружа}", q"{Румена}", q"{Русалина}"
		, q"{Русанка}", q"{Сава}", q"{Саве}", q"{Саво}", q"{Самоил}", q"{Самуил}"
		, q"{Санде}", q"{Сандра}", q"{Сара}", q"{Сашка}", q"{Сашко}", q"{Светлана}"
		, q"{Серафима}", q"{Силјан}", q"{Симон}", q"{Симона}", q"{Симјанка}"
		, q"{Славе}", q"{Славенка}", q"{Славица}", q"{Славка}", q"{Славко}"
		, q"{Славчо}", q"{Славјанка}", q"{Слободан}", q"{Слободанка}"
		, q"{Снежана}", q"{Сократ}", q"{Сончица}", q"{Сотир}", q"{Софе}"
		, q"{Софија}", q"{Софрониј}", q"{Спаса}", q"{Спасе}", q"{Спасена}"
		, q"{Спиро}", q"{Споменка}", q"{Србо}", q"{Сребра}", q"{Сребре}"
		, q"{Стале}", q"{Стамена}", q"{Стево}", q"{Стефан}", q"{Стефанија}"
		, q"{Стефанка}", q"{Стоилко}", q"{Стојан}", q"{Стојанка}"
		, q"{Стојмен}", q"{Стојмена}", q"{Стојна}", q"{Стојче}", q"{Страте}"
		, q"{Страхил}", q"{Сузана}", q"{Тамара}", q"{Танас}", q"{Таска}"
		, q"{Татјана}", q"{Ташко}", q"{Ташо}", q"{Темелко}", q"{Темјана}"
		, q"{Теодор}", q"{Теодора}", q"{Теодосиј}", q"{Теодосија}"
		, q"{Теофан}", q"{Теофил}", q"{Теофилка}", q"{Тихо}", q"{Тихомир}"
		, q"{Тоде}", q"{Тодор}", q"{Тодорка}", q"{Томе}", q"{Томислав}"
		, q"{Трајан}", q"{Трајанка}", q"{Трајко}", q"{Трајче}", q"{Трена}"
		, q"{Трендафилка}", q"{Трифун}", q"{Тришо}", q"{Убавка}", q"{Фана}"
		, q"{Фанка}", q"{Филимена}", q"{Филип}", q"{Флоринка}", q"{Фросина}"
		, q"{Харалампие}", q"{Христина}", q"{Христијан}", q"{Христо}"
		, q"{Цара}", q"{Цвета}", q"{Цветан}", q"{Цветанка}", q"{Цветко}"
		, q"{Цеко}", q"{Часлав}", q"{Чедо}", q"{Чедомир}", q"{Шишман}" ];

		return choice(strs, this.rnd);
	}

	override string personLastName() {
		const string[] strs =
		[ q"{Ѓаконовска}", q"{Ѓаконовски}", q"{Ѓелев}", q"{Ѓелева}"
		, q"{Ѓорчев}", q"{Ѓорчева}", q"{Ѓорѓевска}", q"{Ѓорѓевски}"
		, q"{Ѓузелев}", q"{Ѓузелева}", q"{Ѓурлуков}", q"{Ѓурлукова}"
		, q"{Ѓурчинов}", q"{Ѓурчинова}", q"{Јакимовска}", q"{Јакимовски}"
		, q"{Јаконов}", q"{Јаконова}", q"{Јаневска}", q"{Јаневски}"
		, q"{Јанчевска}", q"{Јанчевски}", q"{Јачев}", q"{Јачева}"
		, q"{Јованов}", q"{Јованова}", q"{Јовановска}", q"{Јовановски}"
		, q"{Јовчевска}", q"{Јовчевски}", q"{Јорданов}", q"{Јорданова}"
		, q"{Јордановска}", q"{Јордановски}", q"{Јосифовска}"
		, q"{Јосифовски}", q"{Јосифоска}", q"{Јосифоски}", q"{Јуруков}"
		, q"{Јурукова}", q"{Јурукоска}", q"{Јурукоски}", q"{Љутков}"
		, q"{Љуткова}", q"{Ќамилов}", q"{Ќамилова}", q"{Ќорнаков}"
		, q"{Ќорнакова}", q"{Ќортошев}", q"{Ќортошева}", q"{Ќурчиев}"
		, q"{Ќурчиева}", q"{Џамбаз}", q"{Џамбазов}", q"{Џамбазова}"
		, q"{Џаџев}", q"{Џаџева}", q"{Џеков}", q"{Џекова}", q"{Џинлеска}"
		, q"{Џинлески}", q"{Џорлев}", q"{Џорлева}", q"{Џувалековска}"
		, q"{Џувалековски}", q"{Џунов}", q"{Џунова}", q"{Абаџиев}"
		, q"{Абаџиева}", q"{Абова}", q"{Аврамов}", q"{Аврамова}", q"{Аврамовска}"
		, q"{Аврамовски}", q"{Аврамчев}", q"{Аврамчева}", q"{Алексиев}"
		, q"{Алексиева}", q"{Алексов}", q"{Алексова}", q"{Алексовска}"
		, q"{Алексовски}", q"{Ангеловска}", q"{Ангеловски}", q"{Андов}"
		, q"{Андова}", q"{Андонов}", q"{Андонова}", q"{Андоновска}"
		, q"{Андоновски}", q"{Андреевска}", q"{Андреевски}", q"{Антонов}"
		, q"{Антонова}", q"{Анчевска}", q"{Анчевски}", q"{Апостолов}"
		, q"{Апостолова}", q"{Апостолска}", q"{Апостолски}", q"{Арсов}"
		, q"{Арсова}", q"{Арсовска}", q"{Арсовски}", q"{Атанасов}"
		, q"{Атанасова}", q"{Атанасовска}", q"{Атанасовски}"
		, q"{Атков}", q"{Аткова}", q"{Ацев}", q"{Ацева}", q"{Ацевска}"
		, q"{Ацевски}", q"{Ајановска}", q"{Ајановски}", q"{Аџимитревска}"
		, q"{Аџимитревски}", q"{Бабамовска}", q"{Бабамовски}"
		, q"{Бабунска}", q"{Бабунски}", q"{Бавтировска}", q"{Бавтировски}"
		, q"{Бакевска}", q"{Бакевски}", q"{Балабанов}", q"{Балабанова}"
		, q"{Басаровска}", q"{Басаровски}", q"{Бачовска}", q"{Бачовски}"
		, q"{Бајалска}", q"{Бајалски}", q"{Беличанец}", q"{Белковска}"
		, q"{Белковски}", q"{Беловска}", q"{Беловски}", q"{Белогаска}"
		, q"{Белогаски}", q"{Белчев}", q"{Белчева}", q"{Бендевска}"
		, q"{Бендевски}", q"{Билбиловска}", q"{Билбиловски}"
		, q"{Билјановска}", q"{Билјановски}", q"{Бислимовска}"
		, q"{Бислимовски}", q"{Битовска}", q"{Битовски}", q"{Блажевска}"
		, q"{Блажевски}", q"{Близнаков}", q"{Близнакова}", q"{Богданов}"
		, q"{Богданова}", q"{Богдановска}", q"{Богдановски}"
		, q"{Богданска}", q"{Богдански}", q"{Богоев}", q"{Богоева}"
		, q"{Богоеска}", q"{Богоески}", q"{Божиков}", q"{Божикова}"
		, q"{Божинов}", q"{Божинова}", q"{Божиновска}", q"{Божиновски}"
		, q"{Боцевска}", q"{Боцевски}", q"{Бошевска}", q"{Бошевски}"
		, q"{Бошков}", q"{Бошкова}", q"{Бошковска}", q"{Бошковски}"
		, q"{Бојановска}", q"{Бојановски}", q"{Бојаџи}", q"{Бојаџиев}"
		, q"{Бојаџиева}", q"{Брезоска}", q"{Брезоски}", q"{Бубуловска}"
		, q"{Бубуловски}", q"{Бужаровска}", q"{Бужаровски}", q"{Бузев}"
		, q"{Бузева}", q"{Бунев}", q"{Бунева}", q"{Бујуклиев}", q"{Бујуклиева}"
		, q"{Варсаковска}", q"{Варсаковски}", q"{Василевска}"
		, q"{Василевски}", q"{Василеска}", q"{Василески}", q"{Васков}"
		, q"{Васкова}", q"{Величковска}", q"{Величковски}", q"{Велков}"
		, q"{Велкова}", q"{Велјанов}", q"{Велјанова}", q"{Висулчев}"
		, q"{Висулчева}", q"{Владимирска}", q"{Владимирски}"
		, q"{Владов}", q"{Владова}", q"{Влахов}", q"{Влахова}", q"{Влахчев}"
		, q"{Влахчева}", q"{Вражалска}", q"{Вражалски}", q"{Гаврилска}"
		, q"{Гаврилски}", q"{Галевска}", q"{Галевски}", q"{Гапо}"
		, q"{Гаревска}", q"{Гаревски}", q"{Гајдов}", q"{Гајдова}"
		, q"{Генов}", q"{Генова}", q"{Георгиев}", q"{Георгиева}", q"{Георгиевска}"
		, q"{Георгиевски}", q"{Герасимовска}", q"{Герасимовски}"
		, q"{Гермов}", q"{Гермова}", q"{Геров}", q"{Герова}", q"{Гечевска}"
		, q"{Гечевски}", q"{Гешоска}", q"{Гешоски}", q"{Гигов}", q"{Гигова}"
		, q"{Гиевска}", q"{Гиевски}", q"{Главаш}", q"{Глигоров}", q"{Глигорова}"
		, q"{Глигоровска}", q"{Глигоровски}", q"{Голабовска}"
		, q"{Голабовски}", q"{Грабул}", q"{Грабулоска}", q"{Грабулоски}"
		, q"{Грозданов}", q"{Грозданова}", q"{Грошев}", q"{Грошева}"
		, q"{Групче}", q"{Грујовска}", q"{Грујовски}", q"{Гугувчевска}"
		, q"{Гугувчевски}", q"{Гучев}", q"{Гучева}", q"{Давидовска}"
		, q"{Давидовски}", q"{Давков}", q"{Давкова}", q"{Давчев}"
		, q"{Давчева}", q"{Давчевска}", q"{Давчевски}", q"{Дамеска}"
		, q"{Дамески}", q"{Дамовска}", q"{Дамовски}", q"{Дворчанец}"
		, q"{Демниев}", q"{Демниева}", q"{Деспотовска}", q"{Деспотовски}"
		, q"{Дејанов}", q"{Дејанова}", q"{Дилев}", q"{Дилева}", q"{Димитриев}"
		, q"{Димитриева}", q"{Димитров}", q"{Димитрова}", q"{Димковска}"
		, q"{Димковски}", q"{Димов}", q"{Димова}", q"{Димовска}", q"{Димовски}"
		, q"{Динев}", q"{Динева}", q"{Диневска}", q"{Диневски}", q"{Дирјан}"
		, q"{Добревска}", q"{Добревски}", q"{Доброхотов}", q"{Додевска}"
		, q"{Додевски}", q"{Доневска}", q"{Доневски}", q"{Дојчинов}"
		, q"{Дојчинова}", q"{Дракул}", q"{Дренков}", q"{Дренкова}"
		, q"{Дрнков}", q"{Дрнкова}", q"{Дуганов}", q"{Дуганова}", q"{Дуковска}"
		, q"{Дуковски}", q"{Евремов}", q"{Евремова}", q"{Едиповска}"
		, q"{Едиповски}", q"{Ежов}", q"{Ежова}", q"{Ефтимов}", q"{Ефтимова}"
		, q"{Жеков}", q"{Жекова}", q"{Железаров}", q"{Железарова}"
		, q"{Жерновска}", q"{Жерновски}", q"{Забазноска}", q"{Забазноски}"
		, q"{Зафировска}", q"{Зафировски}", q"{Здравев}", q"{Здравева}"
		, q"{Здравковска}", q"{Здравковски}", q"{Зографска}"
		, q"{Зографски}", q"{Иванов}", q"{Иванова}", q"{Ивановска}"
		, q"{Ивановски}", q"{Иваноска}", q"{Иваноски}", q"{Игновска}"
		, q"{Игновски}", q"{Игњатовска}", q"{Игњатовски}", q"{Икономов}"
		, q"{Икономова}", q"{Илиев}", q"{Илиева}", q"{Илиевска}", q"{Илиевски}"
		, q"{Исаковска}", q"{Исаковски}", q"{Ицев}", q"{Ицева}", q"{Иљоска}"
		, q"{Иљоски}", q"{Калајџиска}", q"{Калајџиски}", q"{Калчевска}"
		, q"{Калчевски}", q"{Камберска}", q"{Камберски}", q"{Кантарџиев}"
		, q"{Кантарџиева}", q"{Карадак}", q"{Караман}", q"{Каранфиловска}"
		, q"{Каранфиловски}", q"{Караѓозов}", q"{Караѓозова}"
		, q"{Караџа}", q"{Карев}", q"{Карева}", q"{Каров}", q"{Карова}"
		, q"{Каровска}", q"{Каровски}", q"{Картов}", q"{Картова}"
		, q"{Катарџиев}", q"{Катарџиева}", q"{Кепеска}", q"{Кепески}"
		, q"{Керамитчиев}", q"{Керамитчиева}", q"{Керамичиев}"
		, q"{Керамичиева}", q"{Кирјазовска}", q"{Кирјазовски}"
		, q"{Киселинов}", q"{Киселинова}", q"{Китаноска}", q"{Китаноски}"
		, q"{Кичевска}", q"{Кичевски}", q"{Кодра}", q"{Колишевска}"
		, q"{Колишевски}", q"{Колозов}", q"{Колозова}", q"{Кондов}"
		, q"{Кондова}", q"{Кондовска}", q"{Кондовски}", q"{Конеска}"
		, q"{Конески}", q"{Константинов}", q"{Константинова}"
		, q"{Константиновска}", q"{Константиновски}", q"{Кордалов}"
		, q"{Кордалова}", q"{Коробар}", q"{Корубин}", q"{Костадинов}"
		, q"{Костадинова}", q"{Костовска}", q"{Костовски}", q"{Котевска}"
		, q"{Котевски}", q"{Котеска}", q"{Котески}", q"{Коцаре}", q"{Коцо}"
		, q"{Кочовска}", q"{Кочовски}", q"{Коџоман}", q"{Крле}", q"{Крстев}"
		, q"{Крстева}", q"{Крстевска}", q"{Крстевски}", q"{Крстеска}"
		, q"{Крстески}", q"{Крцковска}", q"{Крцковски}", q"{Кузмановска}"
		, q"{Кузмановски}", q"{Кулишев}", q"{Кулишева}", q"{Куновска}"
		, q"{Куновски}", q"{Куноска}", q"{Куноски}", q"{Кутурец}"
		, q"{Кушевска}", q"{Кушевски}", q"{Кљусев}", q"{Кљусева}"
		, q"{Ладинска}", q"{Ладински}", q"{Лазаревска}", q"{Лазаревски}"
		, q"{Лазаров}", q"{Лазарова}", q"{Лазеска}", q"{Лазески}"
		, q"{Лазовска}", q"{Лазовски}", q"{Лакинска}", q"{Лакински}"
		, q"{Лактинска}", q"{Лактински}", q"{Лапе}", q"{Лахтов}", q"{Лахтова}"
		, q"{Левенска}", q"{Левенски}", q"{Лековска}", q"{Лековски}"
		, q"{Леов}", q"{Леова}", q"{Лечевска}", q"{Лечевски}", q"{Липов}"
		, q"{Липова}", q"{Личеноска}", q"{Личеноски}", q"{Лозановска}"
		, q"{Лозановски}", q"{Луловска}", q"{Луловски}", q"{Мазев}"
		, q"{Мазева}", q"{Македонска}", q"{Македонски}", q"{Малевска}"
		, q"{Малевски}", q"{Малеска}", q"{Малески}", q"{Маловска}"
		, q"{Маловски}", q"{Манаковска}", q"{Манаковски}", q"{Мангов}"
		, q"{Мангова}", q"{Манговска}", q"{Манговски}", q"{Манев}"
		, q"{Манева}", q"{Маневска}", q"{Маневски}", q"{Манивилов}"
		, q"{Манивилова}", q"{Манчев}", q"{Манчева}", q"{Манчевска}"
		, q"{Манчевски}", q"{Маринов}", q"{Маринова}", q"{Марковска}"
		, q"{Марковски}", q"{Мартиновска}", q"{Мартиновски}"
		, q"{Мартиноска}", q"{Мартиноски}", q"{Масин}", q"{Матевска}"
		, q"{Матевски}", q"{Матковска}", q"{Матковски}", q"{Матовска}"
		, q"{Матовски}", q"{Мајсторов}", q"{Мајсторова}", q"{Маџиров}"
		, q"{Маџирова}", q"{Миладинов}", q"{Миладинова}", q"{Милосавлев}"
		, q"{Милосавлева}", q"{Милошевска}", q"{Милошевски}"
		, q"{Милчин}", q"{Минчев}", q"{Минчева}", q"{Миовска}", q"{Миовски}"
		, q"{Миронска}", q"{Миронски}", q"{Мисирков}", q"{Мисиркова}"
		, q"{Митевска}", q"{Митевски}", q"{Митревска}", q"{Митревски}"
		, q"{Митриќеска}", q"{Митриќески}", q"{Михајлов}", q"{Михајлова}"
		, q"{Михајловска}", q"{Михајловски}", q"{Мицев}", q"{Мицева}"
		, q"{Мицевска}", q"{Мицевски}", q"{Мицковска}", q"{Мицковски}"
		, q"{Мицов}", q"{Мицова}", q"{Мишковска}", q"{Мишковски}"
		, q"{Миљовска}", q"{Миљовски}", q"{Младенов}", q"{Младенова}"
		, q"{Младеновска}", q"{Младеновски}", q"{Мокров}", q"{Мокрова}"
		, q"{Момировска}", q"{Момировски}", q"{Мошин}", q"{Мојсовска}"
		, q"{Мојсовски}", q"{Мукаетов}", q"{Мукаетова}", q"{Муратовска}"
		, q"{Муратовски}", q"{Мусалевска}", q"{Мусалевски}", q"{Мустачки}"
		, q"{Наков}", q"{Накова}", q"{Наневска}", q"{Наневски}", q"{Настев}"
		, q"{Настева}", q"{Наумов}", q"{Наумова}", q"{Наумовска}"
		, q"{Наумовски}", q"{Наумческа}", q"{Наумчески}", q"{Начев}"
		, q"{Начева}", q"{Најденов}", q"{Најденова}", q"{Најдовска}"
		, q"{Најдовски}", q"{Најческа}", q"{Најчески}", q"{Неделковска}"
		, q"{Неделковски}", q"{Нестор}", q"{Несторовска}", q"{Несторовски}"
		, q"{Нетков}", q"{Неткова}", q"{Нешковска}", q"{Нешковски}"
		, q"{Николеска}", q"{Николески}", q"{Николов}", q"{Николова}"
		, q"{Николовска}", q"{Николовски}", q"{Никушев}", q"{Никушева}"
		, q"{Нинов}", q"{Нинова}", q"{Оровчанец}", q"{Ортаков}", q"{Ортакова}"
		, q"{Османли}", q"{Павловска}", q"{Павловски}", q"{Павлоска}"
		, q"{Павлоски}", q"{Паковска}", q"{Паковски}", q"{Паликрушев}"
		, q"{Паликрушева}", q"{Панговска}", q"{Панговски}", q"{Пандеска}"
		, q"{Пандески}", q"{Пандилов}", q"{Пандилова}", q"{Пандовска}"
		, q"{Пандовски}", q"{Панков}", q"{Панкова}", q"{Панов}", q"{Панова}"
		, q"{Пановска}", q"{Пановски}", q"{Панчевска}", q"{Панчевски}"
		, q"{Папрадишки}", q"{Пајтонџиев}", q"{Пајтонџиева}"
		, q"{Пендовска}", q"{Пендовски}", q"{Пенушлиска}", q"{Пенушлиски}"
		, q"{Пепељуговска}", q"{Пепељуговски}", q"{Перинска}"
		, q"{Перински}", q"{Перчинковска}", q"{Перчинковски}"
		, q"{Петковска}", q"{Петковски}", q"{Петров}", q"{Петрова}"
		, q"{Петровска}", q"{Петровски}", q"{Петрушев}", q"{Петрушева}"
		, q"{Петрушевска}", q"{Петрушевски}", q"{Пејов}", q"{Пејова}"
		, q"{Пиперковска}", q"{Пиперковски}", q"{Планинска}"
		, q"{Планински}", q"{Подгорец}", q"{Полежиноска}", q"{Полежиноски}"
		, q"{Полјанска}", q"{Полјански}", q"{Попов}", q"{Попова}"
		, q"{Поповска}", q"{Поповски}", q"{Попоска}", q"{Попоски}"
		, q"{Преспанска}", q"{Преспански}", q"{Прилепчанска}"
		, q"{Прилепчански}", q"{Прличко}", q"{Псалтиров}", q"{Псалтирова}"
		, q"{Пуцков}", q"{Пуцкова}", q"{Равановска}", q"{Равановски}"
		, q"{Радическа}", q"{Радически}", q"{Раковска}", q"{Раковски}"
		, q"{Рацин}", q"{Реџепова}", q"{Ризов}", q"{Ризова}", q"{Ристов}"
		, q"{Ристова}", q"{Ристовска}", q"{Ристовски}", q"{Ристоска}"
		, q"{Ристоски}", q"{Руменов}", q"{Руменова}", q"{Русоманов}"
		, q"{Русоманова}", q"{Русјаков}", q"{Русјакова}", q"{Салџиев}"
		, q"{Салџиева}", q"{Санев}", q"{Санева}", q"{Сариевска}", q"{Сариевски}"
		, q"{Светиев}", q"{Светиева}", q"{Серафимов}", q"{Серафимова}"
		, q"{Серафимовска}", q"{Серафимовски}", q"{Сидовска}"
		, q"{Сидовски}", q"{Силјановска}", q"{Силјановски}", q"{Симов}"
		, q"{Симова}", q"{Симовска}", q"{Симовски}", q"{Симоновска}"
		, q"{Симоновски}", q"{Скаловска}", q"{Скаловски}", q"{Славенска}"
		, q"{Славенски}", q"{Славеска}", q"{Славески}", q"{Сланев}"
		, q"{Сланева}", q"{Смаќоска}", q"{Смаќоски}", q"{Смилевска}"
		, q"{Смилевски}", q"{Смокварска}", q"{Смокварски}", q"{Соколов}"
		, q"{Соколова}", q"{Солев}", q"{Солева}", q"{Солунска}", q"{Солунски}"
		, q"{Софрониевска}", q"{Софрониевски}", q"{Спасеновска}"
		, q"{Спасеновски}", q"{Спасов}", q"{Спасова}", q"{Спасовска}"
		, q"{Спасовски}", q"{Спиров}", q"{Спирова}", q"{Спировска}"
		, q"{Спировски}", q"{Ставрев}", q"{Ставрева}", q"{Ставреска}"
		, q"{Ставрески}", q"{Стаматоска}", q"{Стаматоски}", q"{Станков}"
		, q"{Станкова}", q"{Станковска}", q"{Станковски}", q"{Старделов}"
		, q"{Старделова}", q"{Стеванов}", q"{Стеванова}", q"{Стевковска}"
		, q"{Стевковски}", q"{Стефанов}", q"{Стефанова}", q"{Стефановска}"
		, q"{Стефановски}", q"{Стојанов}", q"{Стојанова}", q"{Стојановска}"
		, q"{Стојановски}", q"{Стојаноска}", q"{Стојаноски}"
		, q"{Стојков}", q"{Стојкова}", q"{Стојковска}", q"{Стојковски}"
		, q"{Стојменска}", q"{Стојменски}", q"{Стојчев}", q"{Стојчева}"
		, q"{Такев}", q"{Такева}", q"{Таковска}", q"{Таковски}", q"{Талевска}"
		, q"{Талевски}", q"{Талеска}", q"{Талески}", q"{Темелкоска}"
		, q"{Темелкоски}", q"{Теодосиевска}", q"{Теодосиевски}"
		, q"{Терзиев}", q"{Терзиева}", q"{Тодоров}", q"{Тодорова}"
		, q"{Тодоровска}", q"{Тодоровски}", q"{Тозија}", q"{Толевска}"
		, q"{Толевски}", q"{Томовска}", q"{Томовски}", q"{Тофоска}"
		, q"{Тофоски}", q"{Точко}", q"{Тошев}", q"{Тошева}", q"{Тошевска}"
		, q"{Тошевски}", q"{Трајковска}", q"{Трајковски}", q"{Тренеска}"
		, q"{Тренески}", q"{Тренчевска}", q"{Тренчевски}", q"{Трифуновска}"
		, q"{Трифуновски}", q"{Тројачанец}", q"{Трпеновска}"
		, q"{Трпеновски}", q"{Тушевска}", q"{Тушевски}", q"{Угриновска}"
		, q"{Угриновски}", q"{Узунов}", q"{Узунова}", q"{Узуновска}"
		, q"{Узуновски}", q"{Урдин}", q"{Филиповска}", q"{Филиповски}"
		, q"{Фирфов}", q"{Фирфова}", q"{Фотев}", q"{Фотева}", q"{Хаџиманов}"
		, q"{Хаџиманова}", q"{Хаџиниколов}", q"{Хаџиниколова}"
		, q"{Христов}", q"{Христова}", q"{Христовска}", q"{Христовски}"
		, q"{Цанев}", q"{Цанева}", q"{Цветановска}", q"{Цветановски}"
		, q"{Цеков}", q"{Цекова}", q"{Цековска}", q"{Цековски}", q"{Ценев}"
		, q"{Ценева}", q"{Црвенковска}", q"{Црвенковски}", q"{Црвенов}"
		, q"{Црвенова}", q"{Чакар}", q"{Чакмаков}", q"{Чакмакова}"
		, q"{Чаловска}", q"{Чаловски}", q"{Чапаровска}", q"{Чапаровски}"
		, q"{Чаушев}", q"{Чаушева}", q"{Чашуле}", q"{Чевревска}", q"{Чевревски}"
		, q"{Чемерска}", q"{Чемерски}", q"{Чемков}", q"{Чемкова}"
		, q"{Чејковска}", q"{Чејковски}", q"{Чипан}", q"{Чокревска}"
		, q"{Чокревски}", q"{Чундев}", q"{Чундева}", q"{Чупона}", q"{Чучков}"
		, q"{Чучкова}", q"{Чушкаров}", q"{Чушкарова}", q"{Шаревска}"
		, q"{Шаревски}", q"{Ширилов}", q"{Ширилова}", q"{Шишков}"
		, q"{Шишкова}", q"{Шијак}", q"{Шијаков}", q"{Шијакова}", q"{Шијаковска}"
		, q"{Шијаковски}", q"{Шопов}", q"{Шопова}", q"{Шоптрајанов}"
		, q"{Шоптрајанова}", q"{Штерјоска}", q"{Штерјоски}", q"{Шулинчевска}"
		, q"{Шулинчевски}" ];

		return choice(strs, this.rnd);
	}

	override string personMaleFirstName() {
		const string[] strs =
		[ q"{Александар}", q"{Алексо}", q"{Ангел}", q"{Ангеле}", q"{Андон}"
		, q"{Андреј}", q"{Андреја}", q"{Анте}", q"{Антим}", q"{Антон}"
		, q"{Антониј}", q"{Апостол}", q"{Арсениј}", q"{Асен}", q"{Атанас}"
		, q"{Атанасиј}", q"{Ацо}", q"{Благе}", q"{Благој}", q"{Благоја}"
		, q"{Блаже}", q"{Богатин}", q"{Богдан}", q"{Богоја}", q"{Богослав}"
		, q"{Божидар}", q"{Божин}", q"{Божо}", q"{Бојан}", q"{Борис}", q"{Борислав}"
		, q"{Борјан}", q"{Борко}", q"{Боро}", q"{Бошко}", q"{Бранко}", q"{Вангел}"
		, q"{Ване}", q"{Ванче}", q"{Ванчо}", q"{Васил}", q"{Василиј}", q"{Василко}"
		, q"{Велимир}", q"{Величко}", q"{Велјан}", q"{Вељо}", q"{Венко}"
		, q"{Веселин}", q"{Видое}", q"{Виктор}", q"{Владимир}", q"{Владо}"
		, q"{Властимир}", q"{Воислав}", q"{Војдан}", q"{Војкан}", q"{Волче}"
		, q"{Гаврил}", q"{Гане}", q"{Георги}", q"{Герасим}", q"{Глигор}"
		, q"{Гого}", q"{Горан}", q"{Горјан}", q"{Гоце}", q"{Григор}", q"{Гроздан}"
		, q"{Давид}", q"{Дамјан}", q"{Данаил}", q"{Даниел}", q"{Данчо}"
		, q"{Дарко}", q"{Дејан}", q"{Делјан}", q"{Делчо}", q"{Диме}", q"{Димитар}"
		, q"{Димитрие}", q"{Димитриј}", q"{Димитрија}", q"{Димко}"
		, q"{Димо}", q"{Димче}", q"{Добри}", q"{Дојчин}", q"{Доротеј}"
		, q"{Драган}", q"{Драги}", q"{Драгиша}", q"{Драгољуб}", q"{Драгомир}"
		, q"{Драгослав}", q"{Душан}", q"{Душко}", q"{Ѓоко}", q"{Ѓорѓи}"
		, q"{Ѓоре}", q"{Ѓорче}", q"{Ѓурчин}", q"{Евгениј}", q"{Евтим}"
		, q"{Емануел}", q"{Емил}", q"{Еразмо}", q"{Ефтим}", q"{Живко}"
		, q"{Зафир}", q"{Захариј}", q"{Здравко}", q"{Златан}", q"{Злате}"
		, q"{Златко}", q"{Зоран}", q"{Ѕвездан}", q"{Ѕвонко}", q"{Иван}"
		, q"{Ивко}", q"{Иво}", q"{Игнат}", q"{Игор}", q"{Илија}", q"{Исак}"
		, q"{Јаков}", q"{Јане}", q"{Јоаким}", q"{Јован}", q"{Јованче}"
		, q"{Јовица}", q"{Јово}", q"{Јозо}", q"{Јонче}", q"{Јордан}", q"{Јосиф}"
		, q"{Кирил}", q"{Киро}", q"{Климент}", q"{Козма}", q"{Коле}", q"{Константин}"
		, q"{Костадин}", q"{Коце}", q"{Кочо}", q"{Крсте}", q"{Крсто}", q"{Круме}"
		, q"{Ксенте}", q"{Кузман}", q"{Лазар}", q"{Лазо}", q"{Леонид}"
		, q"{Лука}", q"{Љубе}", q"{Љубен}", q"{Љубиша}", q"{Љубомир}", q"{Љупчо}"
		, q"{Македон}", q"{Максим}", q"{Марин}", q"{Марјан}", q"{Марко}"
		, q"{Мате}", q"{Матеја}", q"{Мето}", q"{Методи}", q"{Методиј}"
		, q"{Методија}", q"{Милан}", q"{Миле}", q"{Милош}", q"{Милчо}"
		, q"{Минчо}", q"{Миодраг}", q"{Мирко}", q"{Мирослав}", q"{Мирче}"
		, q"{Митре}", q"{Михаил}", q"{Михајло}", q"{Михо}", q"{Мичо}", q"{Младен}"
		, q"{Момо}", q"{Момчило}", q"{Нанче}", q"{Наум}", q"{Небојша}"
		, q"{Неделко}", q"{Ненад}", q"{Неофит}", q"{Нестор}", q"{Нешо}"
		, q"{Никита}", q"{Никифор}", q"{Никодим}", q"{Никола}", q"{Огнен}"
		, q"{Оливер}", q"{Орде}", q"{Павле}", q"{Пантелејмон}", q"{Панче}"
		, q"{Партениј}", q"{Паскал}", q"{Пенчо}", q"{Перо}", q"{Петар}"
		, q"{Петко}", q"{Петре}", q"{Пеце}", q"{Пимен}", q"{Прокопиј}"
		, q"{Прохор}", q"{Раде}", q"{Радован}", q"{Рајко}", q"{Ранко}"
		, q"{Ризо}", q"{Ристе}", q"{Ристо}", q"{Ромил}", q"{Саве}", q"{Саво}"
		, q"{Самоил}", q"{Самуил}", q"{Санде}", q"{Сашко}", q"{Силјан}"
		, q"{Симон}", q"{Славе}", q"{Славко}", q"{Славчо}", q"{Слободан}"
		, q"{Сократ}", q"{Сотир}", q"{Софе}", q"{Софрониј}", q"{Спасе}"
		, q"{Спиро}", q"{Србо}", q"{Сребре}", q"{Стале}", q"{Стево}", q"{Стефан}"
		, q"{Стоилко}", q"{Стојан}", q"{Стојмен}", q"{Стојче}", q"{Страте}"
		, q"{Страхил}", q"{Танас}", q"{Ташко}", q"{Ташо}", q"{Темелко}"
		, q"{Теодор}", q"{Теодосиј}", q"{Теофан}", q"{Теофил}", q"{Тихо}"
		, q"{Тихомир}", q"{Тоде}", q"{Тодор}", q"{Томе}", q"{Томислав}"
		, q"{Трајан}", q"{Трајко}", q"{Трајче}", q"{Трифун}", q"{Тришо}"
		, q"{Филип}", q"{Харалампие}", q"{Христијан}", q"{Христо}"
		, q"{Цветан}", q"{Цветко}", q"{Цеко}", q"{Часлав}", q"{Чедо}", q"{Чедомир}"
		, q"{Шишман}" ];

		return choice(strs, this.rnd);
	}

	override string personMalePrefix() {
		const string[] strs =
		[ q"{г-дин}", q"{д-р}", q"{м-р}" ];

		return choice(strs, this.rnd);
	}

	override string personName() {
		const int rndInt = uniform(0, 9, this.rnd);

		if(rndInt >= 0 && rndInt < 1) {
			return personPrefix() ~ " " ~ personFirstName() ~ " " ~ personLastName();
		}
		if(rndInt >= 1 && rndInt < 9) {
			return personFirstName() ~ " " ~ personLastName();
		}

		return "";
	}

	override string personPrefix() {
		const string[] strs =
		[ q"{г-дин}", q"{г-ца}", q"{г-ѓа}", q"{д-р}", q"{м-р}" ];

		return choice(strs, this.rnd);
	}

	override string personTitleDescriptor() {
		const string[] strs =
		[ q"{Главен}", q"{Генерален}", q"{Корпоративен}", q"{Државен}"
		, q"{Регионален}", q"{Окружен}", q"{Централен}", q"{Глобален}"
		, q"{Меѓународен}" ];

		return choice(strs, this.rnd);
	}

	override string personTitleLevel() {
		const string[] strs =
		[ q"{програмски}", q"{истражен}", q"{маркетиншки}", q"{интеграциски}"
		, q"{операциски}", q"{комуникациски}", q"{креативен}"
		, q"{кориснички}" ];

		return choice(strs, this.rnd);
	}

	override string personTitleJob() {
		const string[] strs =
		[ q"{директор}", q"{соработник}", q"{управител}", q"{инженер}"
		, q"{специјалист}", q"{координатор}", q"{администратор}"
		, q"{архитект}", q"{аналитичар}", q"{дизајнер}", q"{техничар}"
		, q"{консултант}", q"{помошник}", q"{агент}", q"{застапник}" ];

		return choice(strs, this.rnd);
	}

	override string phoneNumberFormats() {
		const string[] strs =
		[ q"{02 ### ####}", q"{03# ### ###}", q"{04# ### ###}", q"{+389 2 ### ####}", q"{+389 3# ### ###}"
		, q"{+389 4# ### ###}", q"{00389 2 ### ####}", q"{00389 3# ### ###}", q"{00389 4# ### ###}" ];

		return numberBuild(choice(strs, this.rnd));
	}

}
