module faked.faker_th;

import std.algorithm : map, joiner;
import std.array;
import std.conv : to;
import std.exception : enforce;
import std.format;
import std.random;
import std.range : iota, take, repeat;
import std.string : toUpper;
import std.typecons : Nullable, nullable;

import faked.customtypes;
import faked.fakerenums;

import faked.faker_en;

class Faker_th : Faker_en {
@safe:
	this(int seed) {
		super(seed);
	}

	override string animalCat() {
		const string[] strs =
		[ q"{เอเซียนกึ่งขนยาว}", q"{บาลินีส}"
		, q"{เบอร์แมน}", q"{บริติชขนยาว}", q"{ชานทิลลี}"
		, q"{หิมาลายัน}", q"{จาวานีส}", q"{เมนคูน}"
		, q"{เนบีลัง}", q"{นอร์เวเจียนฟอเรสต์}"
		, q"{โอเรียนทัลขนยาว}", q"{เปอร์เซีย}"
		, q"{แร็กดอลล์}", q"{รากามัฟฟิน}", q"{ไซบีเรียน}"
		, q"{เทอร์คิชแวน}", q"{เทอร์คิชแองโกรา}"
		, q"{ยอร์กช็อกโกแลต}", q"{อะบิสซิเนียน}"
		, q"{อเมริกันขนสั้น}", q"{ออสเตรเลียนมิสต์}"
		, q"{บอมเบย์}", q"{บริติชขนสั้น}", q"{เบอร์มีส}"
		, q"{ส้ม}", q"{เบอร์มิลลา}", q"{แคลิฟอร์เนียสแปงเกิลด์}"
		, q"{ชาร์ตรู}", q"{คัลเลอร์พอยต์ขนสั้น}"
		, q"{อียิปเทียนมัว}", q"{ยูโรเปียนขนสั้น}"
		, q"{เอกโซติก}", q"{ฮาวานาบราวน์}", q"{โคราช}"
		, q"{อ็อกซิแคต}", q"{โอเรียนทัลขนสั้น}"
		, q"{รัสเซียนบลู}", q"{สยามีส}", q"{สิงหปุระ}"
		, q"{สโนว์ชู}", q"{โซโกเก}", q"{โซมาลี}", q"{ตองกินีส}"
		, q"{อเมริกันบ็อบเทล}", q"{อเมริกันเคิร์ล}"
		, q"{อเมริกันไวร์แฮร์}", q"{คอร์นิชเรกซ์}"
		, q"{ซิมริก}", q"{ดีวอนเรกซ์}", q"{เยอรมันเรกซ์}"
		, q"{แจแพนีสบ็อบเทล}", q"{ลาเปิร์ม}"
		, q"{แมงซ์}", q"{มึนชกิน}", q"{โอโจสแอซูเลส}"
		, q"{เพเทอร์บัลด์}", q"{พิกซีบ็อบ}", q"{เซลเกิร์กเรกซ์}"
		, q"{สกอตติชโฟลด์}", q"{สฟิงซ์}", q"{เบงกอล}"
		, q"{ชอซี}", q"{ชีโต}", q"{ซาวันนา}", q"{เซเรนเจตี}"
		, q"{ทอยเกอร์}", q"{อาชีร่า}" ];

		return choice(strs, this.rnd);
	}

	override string animalDog() {
		const string[] strs =
		[ q"{เกรตเดน}", q"{เกรทเทอร์สวิสส์เมาน์เทนด๊อก}"
		, q"{เกรย์ฮาวนด์}", q"{โกลเดินริทรีฟเวอร์}"
		, q"{คลัมเบอร์สแปเนียล}", q"{คอลลี}"
		, q"{คะเนเดียนเอสกิโมด็อก}", q"{คาอิเคน}"
		, q"{คิชู}", q"{คันกัล}", q"{แคทาลันชีปด็อก}"
		, q"{แคร์นเทร์เรียร์}", q"{แควาเลียร์คิงชาลส์สแปเนียล}"
		, q"{โคมอนดอร์}", q"{โคเรียนชินโด}", q"{เคนคอร์โซ่}"
		, q"{คุนหมิงวูลฟ์ด็อก}", q"{คอเคเซียนเชเพิร์ดด็อก}"
		, q"{แจ็กรัสเซลล์เทร์เรียร์}", q"{แจพานีสชิน}"
		, q"{แจพานีสเทร์เรียร์}", q"{แจพานีสสปิตซ์}"
		, q"{ชาผี}", q"{ชิโกะกุ}", q"{ชิบะอินุ}", q"{ชิวาวา}"
		, q"{เชตแลนด์ชีปด็อก}", q"{เชาเชา}", q"{ไชนีสเครสติดด็อก}"
		, q"{ซามอยิด}", q"{ซาลูกี}", q"{ซือจื่อ}", q"{เซนต์เบอร์นาร์ด}"
		, q"{ไซบีเรียนฮัสกี}", q"{แด็กซันด์}"
		, q"{แดนดีดินมอนต์เทร์เรียร์}", q"{แดลเมเชียน}"
		, q"{โดโกอาร์เฆนติโน}", q"{โดเบอร์แมนพินเชอร์}"
		, q"{ด็อจเดบอร์โดซ์}", q"{ดัตช์เชเพิร์ด}"
		, q"{ทิเบตันแมสติฟฟ์}", q"{ไทยบางแก้ว}"
		, q"{ไทยหลังอาน}", q"{โทสะอินุ}", q"{นโปเลียนแมสติฟฟ์}"
		, q"{บรักโกอีตาเลียโน}", q"{บรักแซ็ง-แฌร์แม็ง}"
		, q"{บรักโดแวร์ญ}", q"{บรักดูว์บูร์บอแน}"
		, q"{บรักดูว์ปุย}", q"{บรักฟร็องแซ}"
		, q"{บรัสเซิลส์กริฟฟัน}", q"{บราซิเลียนโดโก}"
		, q"{บราซิเลียนเทร์เรียร์}", q"{บริตทานี; บริตทานีสแปเนียล}"
		, q"{บรีแกกรีฟงว็องเดแอ็ง}", q"{บรีอาร์ด}"
		, q"{บรูโนจูราฮาวนด์}", q"{บลัดฮาวนด์}"
		, q"{บลูทิกคูนฮาวนด์}", q"{บลูพอลเทร์เรียร์}"
		, q"{บลูเลซี}", q"{บ็อกเซอร์}", q"{บอยคินสแปเนียล}"
		, q"{บอร์ซอย}", q"{บอร์เดอร์คอลลี}", q"{บอร์เดอร์เทร์เรียร์}"
		, q"{บอสตันเทร์เรียร์}", q"{บอสเนียคอร์ส-แฮด์ฮาวนด์}"
		, q"{บาคาร์วัลด็อก}", q"{บาแซกรีฟงว็องเดแอ็ง}"
		, q"{บาแซเบลอเดอกัสกอญ}", q"{บาแซโฟฟว์เดอเบรอตาญ}"
		, q"{บาแซอาร์เตเซียงนอร์ม็อง}", q"{บาร์แบ}"
		, q"{บาแวเรียนเมาน์เทนฮาวนด์}", q"{บาสก์เชเพิร์ดด็อก}"
		, q"{บาเซนจี}", q"{บิยานูโกเดลัสเองการ์ตาซิโอเนส}"
		, q"{บิวเซรอน}", q"{บีเกิล}", q"{บีเกิล-แฮร์เรียร์}"
		, q"{บีชันฟรีส}", q"{บีลี}", q"{บุลล์เทร์เรียร์}"
		, q"{บุลล์แมสติฟฟ์}", q"{บุลล์แอนด์เทร์เรียร์}"
		, q"{บุลเลินไบส์เซอร์}", q"{บูลด็อก}"
		, q"{บูโกวีนาเชเพิร์ดด็อก}", q"{บูร์บุล}"
		, q"{บูวีเยเดซาร์แดน}", q"{บูวีเยเดฟล็องดร์}"
		, q"{เบดลิงตันเทร์เรียร์}", q"{เบลเจียนเชเพิร์ดด็อก}"
		, q"{เบลอเดอกัสกอญ}", q"{เบอร์นีสเมาน์เทนด็อก}"
		, q"{เบียร์ดดิดคอลลี}", q"{แบร์กามัสโกเชเพิร์ด}"
		, q"{แบร์เฌบล็องซุอิส}", q"{แบร์เฌปีการ์}"
		, q"{แบร์เนอร์นีเดอร์เลาฟ์ฮุนท์}", q"{แบล็กนอร์วีเจียนเอลก์ฮาวนด์}"
		, q"{แบล็กเมาท์เคอร์}", q"{แบล็กรัชเชียนเทร์เรียร์}"
		, q"{แบล็กแอนด์แทนคูนฮาวนด์}", q"{แบล็กแอนด์แทนเวอร์จิเนียฟอกซ์ฮาวนด์}"
		, q"{แบสซิตฮาวนด์}", q"{โบรฮอลเมอร์}"
		, q"{โบสรง}", q"{โบโลญเญเซ}", q"{โบฮีเมียนเชเพิร์ด}"
		, q"{ปั๊ก}", q"{ปักกิ่ง}", q"{ปาปียง}", q"{เปรูเวียนแฮร์เลสสด็อก}"
		, q"{เปอร์โรเดอร์ปรีซ่าคานาริโอ}", q"{พอเมอเรเนียน}"
		, q"{พาร์ซันแจ็กรัสเซลล์เทร์เรียร์}", q"{พูเดิล}"
		, q"{ฟิล่าบราซิเลียโร}", q"{เฟรนช์บูลด็อก}"
		, q"{มอลทีส}", q"{มาเรมมาชีปด็อก}", q"{มินะเจอร์ชเนาเซอร์}"
		, q"{มินะเจอร์พินเชอร์}", q"{เม็กซิกันแฮร์เลสสด็อก}"
		, q"{แมนเชสเตอร์เทร์เรียร์}", q"{ยอร์กเชอร์เทร์เรียร์}"
		, q"{เยอรมันเชเพิร์ด}", q"{เยอรมันช็อตแฮร์พอยน์เตอร์}"
		, q"{รอทท์ไวเลอร์}", q"{รัสเซลล์เทร์เรียร์}"
		, q"{แรตเทร์เรียร์}", q"{โรดีเชียนริดจ์แบ็ค}"
		, q"{ลาซาแอปโซ}", q"{แลบราดอร์ริทรีฟเวอร์}"
		, q"{เลิฟเชิน}", q"{วิฌลอ}", q"{วิปพิต}", q"{เวลช์คอร์กี}"
		, q"{เวลช์เทร์เรียร์}", q"{เวลช์สปริงเงอร์สแปเนียล}"
		, q"{เวสต์ไฮต์แลนด์ไวต์เทร์เรียร์}", q"{ไวมาราเนอร์}"
		, q"{สกอตติชเดียร์ฮาวนด์}", q"{สกอตติชเทร์เรียร์}"
		, q"{อเมริกันคอกเกอร์สแปเนียล}", q"{อเมริกันบูลด็อก}"
		, q"{อเมริกันพิตบุลล์เทร์เรียร์}", q"{อเมริกันฟอกซ์ฮาวนด์}"
		, q"{อเมริกันวอเตอร์สแปเนียล}", q"{อเมริกันสแตฟฟอร์ดเชอร์เทร์เรียร์}"
		, q"{อเมริกันเอสกิโมด็อก}", q"{อ็องกลอ-ฟร็องแซเดอเปอติตเวเนอรี}"
		, q"{อเมริกันแฮร์เลสส์เทร์เรียร์}", q"{ออสเตรเลียนเคลพี}"
		, q"{ออสเตรเลียนแคตเทิลด็อก}", q"{ออสเตรเลียนเชเพิร์ด}"
		, q"{ออสเตรเลียนซิลกีเทร์เรียร์}", q"{ออสเตรเลียนเทร์เรียร์}"
		, q"{ออสเตรเลียนสตัมปีเทลแคตเทิลด็อก}", q"{ออสเตรียนแบล็กแอนด์แทนฮาวนด์}"
		, q"{ออสเตรียนพินเชอร์}", q"{อะกิตะอินุ}"
		, q"{อะแลสกันแมละมิวต์}", q"{อะแลสกันคลีไค}"
		, q"{อักบัช}", q"{อัพเพินเซ็ลเลอร์เซ็นเนินฮุนท์}"
		, q"{อัฟเฟินพินเชอร์}", q"{อาซาวัก}"
		, q"{อาร์ตัวฮาวนด์}", q"{อาร์มีเนียนแกมเพอร์ด็อก}"
		, q"{อาร์ม็อง}", q"{อารีเยฌัว}", q"{อาเรียฌพอยน์เตอร์}"
		, q"{อาลาโนเอสปัญญอล}", q"{อาอีดี}", q"{อิงกลิชคอกเกอร์สแปเนียล}"
		, q"{อิงกลิชเซตเตอร์}", q"{อิงกลิชแมสติฟฟ์}"
		, q"{อิตาเลียนเกรย์ฮาวด์}", q"{แอนดาลูซีอันฮาวนด์}"
		, q"{แอนาโทเลียนเชเพิร์ดด็อก}", q"{แอฟแกนเชเพิร์ด}"
		, q"{แอฟแกนฮาวนด์}", q"{แอร์เดลเทร์เรียร์}"
		, q"{แอลไพน์ดัคส์บรัคเคอ}", q"{แอลไพน์สแปเนียล}"
		, q"{โอลด์อิงลิชชีปด็อก}", q"{ฮกไกโด}" ];

		return choice(strs, this.rnd);
	}

	override string dateMonthWide() {
		const string[] strs =
		[ q"{มกราคม}", q"{กุมภาพันธ์}", q"{มีนาคม}"
		, q"{เมษายน}", q"{พฤษภาคม}", q"{มิถุนายน}"
		, q"{กรกฎาคม}", q"{สิงหาคม}", q"{กันยายน}"
		, q"{ตุลาคม}", q"{พฤศจิกายน}", q"{ธันวาคม}" ];

		return choice(strs, this.rnd);
	}

	override string dateMonthAbbr() {
		const string[] strs =
		[ q"{ม.ค.}", q"{ก.พ.}", q"{มี.ค.}", q"{เม.ย.}", q"{พ.ค.}", q"{มิ.ย.}"
		, q"{ก.ค.}", q"{ส.ค.}", q"{ก.ย.}", q"{ต.ค.}", q"{พ.ย.}", q"{ธ.ค.}" ];

		return choice(strs, this.rnd);
	}

	override string dateWeekdayWide() {
		const string[] strs =
		[ q"{วันอาทิตย์}", q"{วันจันทร์}", q"{วันอังคาร}"
		, q"{วันพุธ}", q"{วันพฤหัสบดี}", q"{วันศุกร์}"
		, q"{วันเสาร์}" ];

		return choice(strs, this.rnd);
	}

	override string dateWeekdayAbbr() {
		const string[] strs =
		[ q"{อา.}", q"{จ.}", q"{อ.}", q"{พ.}", q"{พฤ.}", q"{ศ.}", q"{ส.}" ];

		return choice(strs, this.rnd);
	}

	override string internetDomainSuffix() {
		const string[] strs =
		[ q"{co.th}", q"{com}", q"{net}", q"{th}" ];

		return choice(strs, this.rnd);
	}

	override string locationBuildingNumber() {
		const string[] strs =
		[ q"{#}", q"{##}", q"{###}", q"{####}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationCityName() {
		const string[] strs =
		[ q"{กรุงเทพมหานคร}", q"{ปากเกร็ด}", q"{เมืองสมุทรปราการ}"
		, q"{เมืองนนทบุรี}", q"{อุดรธานี}", q"{ชลบุรี}"
		, q"{นครศรีธรรมราช}", q"{เชียงราย}", q"{พิษณุโลก}"
		, q"{พัทยา}" ];

		return choice(strs, this.rnd);
	}

	override string locationCityPattern() {
		switch(uniform(0, 1, this.rnd)) {
			case 0: return locationCityName();
			default: return "";
		}
	}

	override string locationCountry() {
		const string[] strs =
		[ q"{จีน}", q"{อินเดีย}", q"{สหรัฐ}", q"{อินโดนีเซีย}"
		, q"{บราซิล}", q"{ญี่ปุ่น}", q"{รัสเซีย}", q"{เม็กซิโก}"
		, q"{ปากีสถาน}", q"{เยอรมนี}", q"{เวียดนาม}"
		, q"{ฟิลิปปินส์}", q"{สหราชอาณาจักร}"
		, q"{ไนจีเรีย}", q"{ฝรั่งเศส}", q"{ตุรกี}"
		, q"{อิหร่าน}", q"{เกาหลีใต้}", q"{ไทย}", q"{อียิปต์}"
		, q"{สเปน}", q"{อิตาลี}", q"{แคนาดา}", q"{อาร์เจนตินา}"
		, q"{แอฟริกาใต้}", q"{โคลอมเบีย}", q"{บังกลาเทศ}"
		, q"{โปแลนด์}", q"{ซาอุดีอาระเบีย}", q"{มาเลเซีย}"
		, q"{ยูเครน}", q"{โมร็อกโก}", q"{ไต้หวัน}"
		, q"{ออสเตรเลีย}", q"{เวเนซุเอลา}", q"{แอลจีเรีย}"
		, q"{เอธิโอเปีย}", q"{อิรัก}", q"{อุซเบกิสถาน}"
		, q"{พม่า}", q"{เนเธอร์แลนด์}", q"{เปรู}", q"{ชิลี}"
		, q"{คาซัคสถาน}", q"{โรมาเนีย}", q"{ซูดาน}"
		, q"{กานา}", q"{โกตดิวัวร์}", q"{ยูกันดา}"
		, q"{เบลเยียม}", q"{สวีเดน}", q"{เอกวาดอร์}"
		, q"{แทนซาเนีย}", q"{สหรัฐอาหรับเอมิเรตส์}"
		, q"{เคนยา}", q"{เช็กเกีย}", q"{สวิตเซอร์แลนด์}"
		, q"{กรีซ}", q"{อาเซอร์ไบจาน}", q"{ออสเตรีย}"
		, q"{โปรตุเกส}", q"{เยเมน}", q"{ฮังการี}", q"{ศรีลังกา}"
		, q"{เบลารุส}", q"{สาธารณรัฐประชาธิปไตยคองโก}"
		, q"{สาธารณรัฐโดมินิกัน}", q"{กัวเตมาลา}"
		, q"{อิสราเอล}", q"{ฮ่องกง}", q"{จอร์แดน}"
		, q"{ตูนิเซีย}", q"{เนปาล}", q"{ซีเรีย}", q"{เซอร์เบีย}"
		, q"{โมซัมบิก}", q"{คิวบา}", q"{แคเมอรูน}"
		, q"{เดนมาร์ก}", q"{กัมพูชา}", q"{นอร์เวย์}"
		, q"{โบลิเวีย}", q"{ฟินแลนด์}", q"{สิงคโปร์}"
		, q"{แซมเบีย}", q"{เลบานอน}", q"{เซเนกัล}"
		, q"{บัลแกเรีย}", q"{ซิมบับเว}", q"{สโลวาเกีย}"
		, q"{นิวซีแลนด์}", q"{แองโกลา}", q"{ปารากวัย}"
		, q"{อัฟกานิสถาน}" ];

		return choice(strs, this.rnd);
	}

	override string locationDefaultCountry() {
		const string[] strs =
		[ q"{ไทย}" ];

		return choice(strs, this.rnd);
	}

	override string locationPostcode() {
		const string[] strs =
		[ q"{####0}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationState() {
		const string[] strs =
		[ q"{กรุงเทพมหานคร}", q"{กระบี่}", q"{กาญจนบุรี}"
		, q"{กาฬสินธุ์}", q"{กำแพงเพชร}", q"{ขอนแก่น}"
		, q"{จันทบุรี}", q"{ฉะเชิงเทรา}", q"{ชลบุรี}"
		, q"{ชัยนาท}", q"{ชัยภูมิ}", q"{ชุมพร}", q"{ตรัง}"
		, q"{ตราด}", q"{ตาก}", q"{นครนายก}", q"{นครปฐม}"
		, q"{นครพนม}", q"{นครราชสีมา}", q"{นครศรีธรรมราช}"
		, q"{นครสวรรค์}", q"{นนทบุรี}", q"{นราธิวาส}"
		, q"{น่าน}", q"{บึงกาฬ}", q"{บุรีรัมย์}", q"{ปทุมธานี}"
		, q"{ประจวบคีรีขันธ์}", q"{ปราจีนบุรี}"
		, q"{ปัตตานี}", q"{พระนครศรีอยุธยา}"
		, q"{พะเยา}", q"{พังงา}", q"{พัทลุง}", q"{พิจิตร}"
		, q"{พิษณุโลก}", q"{ภูเก็ต}", q"{มหาสารคาม}"
		, q"{มุกดาหาร}", q"{ยะลา}", q"{ยโสธร}", q"{ระนอง}"
		, q"{ระยอง}", q"{ราชบุรี}", q"{ร้อยเอ็ด}", q"{ลพบุรี}"
		, q"{ลำปาง}", q"{ลำพูน}", q"{ศรีสะเกษ}", q"{สกลนคร}"
		, q"{สงขลา}", q"{สตูล}", q"{สมุทรปราการ}", q"{สมุทรสงคราม}"
		, q"{สมุทรสาคร}", q"{สระบุรี}", q"{สระแก้ว}"
		, q"{สิงห์บุรี}", q"{สุพรรณบุรี}", q"{สุราษฎร์ธานี}"
		, q"{สุรินทร์}", q"{สุโขทัย}", q"{หนองคาย}"
		, q"{หนองบัวลำภู}", q"{อำนาจเจริญ}", q"{อุดรธานี}"
		, q"{อุตรดิตถ์}", q"{อุทัยธานี}", q"{อุบลราชธานี}"
		, q"{อ่างทอง}", q"{เชียงราย}", q"{เชียงใหม่}"
		, q"{เพชรบุรี}", q"{เพชรบูรณ์}", q"{เลย}", q"{แพร่}"
		, q"{แม่ฮ่องสอน}" ];

		return choice(strs, this.rnd);
	}

	override string locationStreetName() {
		const string[] strs =
		[ q"{กรุงเกษม}", q"{กรุงเทพกรีฑา}", q"{กรุงเทพฯ-นนทบุรี}"
		, q"{กรุงธนบุรี}", q"{กรุงแมน}", q"{กล้วยน้ำไทตัดใหม่}"
		, q"{กลันตัน}", q"{กษาปณ์}", q"{กะออม}", q"{กัลปพฤกษ์}"
		, q"{กัลยาณไมตรี}", q"{กาญจนาภิเษก}"
		, q"{กำนันแม้น}", q"{กำแพงเพชร}", q"{กำแพงเพชร 1}"
		, q"{กำแพงเพชร 2}", q"{กำแพงเพชร 3}", q"{กำแพงเพชร 4}"
		, q"{กำแพงเพชร 5}", q"{กำแพงเพชร 6}", q"{กำแพงเพชร 7}"
		, q"{กิ่งแก้ว}", q"{กิจพานิช}", q"{เกษมราษฎร์}"
		, q"{แก้ว}", q"{แก้วเงินทอง}", q"{โกสุมรวมใจ}"
		, q"{ไกรสีห์}", q"{ขวัญ}", q"{ขาว}", q"{ข้าวสาร}"
		, q"{ข้าวหลาม}", q"{ขุมทอง-ลำต้อยติ่ง}"
		, q"{เขียวไข่กา}", q"{ครุใน}", q"{คลองเก้า}"
		, q"{คลองถมวัดพิเรนทร์}", q"{คลองถมวัดสระเกศ}"
		, q"{คลองถมวัดโสมนัส}", q"{คลองลำเจียก}"
		, q"{คลองลำปัก}", q"{คลองสิบ-คลองสิบสี่}"
		, q"{คอนแวนต์}", q"{คุ้มเกล้า}", q"{คู้-คลองสิบ}"
		, q"{คู้บอน}", q"{เคหะร่มเกล้า}", q"{งามวงศ์วาน}"
		, q"{จตุโชติ}", q"{จตุรทิศ}", q"{จรัญสนิทวงศ์}"
		, q"{จรัสเมือง}", q"{จรัสเวียง}", q"{จรูญเวียง}"
		, q"{จอมทอง}", q"{จอมทองบูรณะ}", q"{จักรพงษ์}"
		, q"{จักรพรรดิพงษ์}", q"{จักรเพชร}", q"{จักรวรรดิ}"
		, q"{จันทน์}", q"{จันทน์เก่า}", q"{จันทรุเบกษา}"
		, q"{จารุเมือง}", q"{จึงเจริญพาณิชย์}"
		, q"{เจริญกรุง}", q"{เจริญนคร}", q"{เจริญพัฒนา}"
		, q"{เจริญเมือง}", q"{เจริญรัถ}", q"{เจริญราษฎร์}"
		, q"{เจริญเวียง}", q"{เจ้าคำรบ}", q"{เจ้าคุณทหาร}"
		, q"{เจ้าพระยาสยาม}", q"{เจ้าฟ้า}", q"{แจ้งวัฒนะ}"
		, q"{ฉลองกรุง}", q"{ฉิมพลี}", q"{เฉลิมเขต 1}"
		, q"{เฉลิมเขต 2}", q"{เฉลิมเขต 3}", q"{เฉลิมเขต 4}"
		, q"{เฉลิมพงษ์}", q"{เฉลิมพระเกียรติจุฬาภรณ์}"
		, q"{เฉลิมพระเกียรติ ร.9}", q"{แฉล้มนิมิตร}"
		, q"{ชักพระ}", q"{ชัยพฤกษ์}", q"{ช่างอากาศอุทิศ}"
		, q"{ชิดลม}", q"{เชตุพน}", q"{เชิดวุฒากาศ}"
		, q"{เชียงใหม่}", q"{เชื้อเพลิง}", q"{เชื่อมคลองมอญ}"
		, q"{เชื่อมสัมพันธ์}", q"{โชคชัย 4}", q"{ณ ระนอง}"
		, q"{ดวงพิทักษ์}", q"{ดาวข่าง}", q"{ดำรงรักษ์}"
		, q"{ดินแดง}", q"{ดินแดง 1}", q"{ดินสอ}", q"{ดิสมาร์ค}"
		, q"{เดชะตุงคะ}", q"{เดโช}", q"{ตรีเพชร}", q"{ตรีมิตร}"
		, q"{ตะนาว}", q"{ตานี}", q"{ตีทอง}", q"{เตชะวนิช}"
		, q"{ทรงวาด}", q"{ทรงสวัสดิ์}", q"{ทรงเสริม}"
		, q"{ทรัพย์}", q"{ทรัพย์สิน}", q"{ทวีวัฒนา}"
		, q"{ทวีวัฒนา-กาญจนาภิเษก}", q"{ทหาร}"
		, q"{ทหารอากาศอุทิศ}", q"{ทับยาว}", q"{ท่าเกษม}"
		, q"{ท่าข้าม}", q"{ทางรถไฟสายเก่าปากน้ำ}"
		, q"{ท่าดินแดง}", q"{ท้ายวัง}", q"{ทุ่งมังกร}"
		, q"{เทพรักษ์}", q"{เทศบาลนฤมาณ}", q"{เทศบาลนิมิตใต้}"
		, q"{เทศบาลนิมิตเหนือ}", q"{เทศบาลรังรักษ์ใต้}"
		, q"{เทศบาลรังรักษ์เหนือ}", q"{เทศบาลรังสรรใต้}"
		, q"{เทศบาลรังสรรเหนือ}", q"{เทศบาลรังสฤษดิ์ใต้}"
		, q"{เทศบาลรังสฤษดิ์เหนือ}", q"{เทศบาลสงเคราะห์}"
		, q"{เทอดดำริ}", q"{เทอดไท}", q"{เทิดราชัน}"
		, q"{เทียมร่วมมิตร}", q"{ไทยรามัญ}", q"{ธนิยะ}"
		, q"{นครไชยศรี}", q"{นครปฐม}", q"{นครราชสีมา}"
		, q"{นครลุง}", q"{นครสวรรค์}", q"{นนทรี}", q"{นราธิวาสราชนครินทร์}"
		, q"{นเรศ}", q"{นวมินทร์}", q"{นวลจันทร์}"
		, q"{นักกีฬาแหลมทอง}", q"{นาคนิวาส}"
		, q"{นาคราช}", q"{นางลิ้นจี่}", q"{นาวงประชาพัฒนา}"
		, q"{นิคมมักกะสัน}", q"{นิมิตใหม่}", q"{นี้จงสวัสดิ์}"
		, q"{บรมราชชนนี}", q"{บรรทัดทอง}", q"{บริพัตร}"
		, q"{บวรนิเวศน์}", q"{บางกระดี่}", q"{บางขุนเทียน}"
		, q"{บางขุนเทียนชายทะเล}", q"{บางขุนนนท์}"
		, q"{บางแค}", q"{บางเชือกหนัง}", q"{บางนา-ตราด}"
		, q"{บางบอน 1}", q"{บางบอน 2}", q"{บางบอน 3}", q"{บางบอน 4}"
		, q"{บางบอน 5}", q"{บางบอนสายเดิม}", q"{บางไผ่}"
		, q"{บางพรม}", q"{บางระมาด}", q"{บางแวก}", q"{บ้านหม้อ}"
		, q"{บำรุงเมือง}", q"{บึงขวาง}", q"{บุญศิริ}"
		, q"{บุรีภิรมย์}", q"{บูรณศาสตร์}", q"{บูรพา}"
		, q"{แบนชะโด}", q"{แบรสต์}", q"{ประชาชื่น}"
		, q"{ประชาทร}", q"{ประชาธิปก}", q"{ประชาธิปไตย}"
		, q"{ประชาพัฒนา}", q"{ประชาร่วมใจ}", q"{ประชาราษฎร์ สาย 1}"
		, q"{ประชาราษฎร์ สาย 2}", q"{ประชาราษฎร์บำเพ็ญ}"
		, q"{ประชาสงเคราะห์}", q"{ประชาสำราญ}"
		, q"{ประชาสุข}", q"{ประชาอุทิศ}", q"{ประดิพัทธ์}"
		, q"{ประดิษฐ์มนูธรรม}", q"{ประมวญ}", q"{ประเสริฐมนูกิจ}"
		, q"{ปรินายก}", q"{ปั้น}", q"{ปากน้ำกระโจมทอง}"
		, q"{ปากน้ำฝั่งเหนือ}", q"{แปลงนาม}"
		, q"{ผดุงด้าว}", q"{ผดุงพันธ์}", q"{พญาไท}"
		, q"{พญาไม้}", q"{พรมแดน}", q"{พรหมราษฎร์}"
		, q"{พระจันทร์}", q"{พระพิทักษ์}", q"{พระพิพิธ}"
		, q"{พระยาสุเรนทร์}", q"{พระราม 9}", q"{พระรามที่ 1}"
		, q"{พระรามที่ 2}", q"{พระรามที่ 3}", q"{พระรามที่ 4}"
		, q"{พระรามที่ 5}", q"{พระรามที่ 6}", q"{พระสุเมรุ}"
		, q"{พระอาทิตย์}", q"{พรานนก}", q"{พรานนก-พุทธมณฑล สาย 4}"
		, q"{พลับพลาไชย}", q"{พ่วงศิริ}", q"{พหลโยธิน}"
		, q"{พะเนียง}", q"{พัฒน์พงศ์}", q"{พัฒนา}"
		, q"{พัฒนาการ}", q"{พัฒนาชนบท}", q"{พัฒนาชนบท 2}"
		, q"{พัฒนาชนบท 3}", q"{พัฒนาชนบท 4}", q"{พาณิชยการธนบุรี}"
		, q"{พาดสาย}", q"{พาหุรัด}", q"{พิชัย}", q"{พิบูลสงคราม}"
		, q"{พิษณุโลก}", q"{พีรพงษ์}", q"{พุทธบูชา}"
		, q"{พุทธมณฑล สาย 1}", q"{พุทธมณฑล สาย 2}"
		, q"{พุทธมณฑล สาย 3}", q"{เพชรเกษม}", q"{เพชรบุรี}"
		, q"{เพชรพระราม}", q"{เพชรอุทัย}", q"{เพลินจิต}"
		, q"{เพาะพานิชย์}", q"{เพิ่มสิน}", q"{แพร่งนรา}"
		, q"{แพร่งภูธร}", q"{แพร่งสรรพศาสตร์}"
		, q"{โพธิ์แก้ว}", q"{เฟื่องนคร}", q"{ภาณุรังษี}"
		, q"{ภุชงค์}", q"{โภคี}", q"{มนธาตุราชศรีพิจิตร์}"
		, q"{มหรรณพ}", q"{มหาจักร}", q"{มหาไชย}", q"{มหานคร}"
		, q"{มหาพฤฒาราม}", q"{มหาราช}", q"{มหาเศรษฐ์}"
		, q"{มเหสักข์}", q"{มไหสวรรย์}", q"{มอเตอร์เวย์}"
		, q"{มังกร}", q"{มาเจริญ}", q"{มิตรพันธ์}"
		, q"{มิตรภาพไทย-จีน}", q"{มิตรไมตรี}"
		, q"{มิตรไมตรี 1}", q"{มิตรไมตรี 2}", q"{มิตรไมตรี 3}"
		, q"{มีนพัฒนา}", q"{แมนไท}", q"{ไมตรีจิต}"
		, q"{ไมตรีจิตต์}", q"{ยมราชสุขุม}", q"{ยังพัธนา}"
		, q"{ยานนาวา}", q"{ยี่สิบสองกรกฎาคม 1}"
		, q"{ยี่สิบสองกรกฎาคม 2}", q"{ยี่สิบสองกรกฎาคม 3}"
		, q"{ยี่สิบสองกรกฎาคม 4}", q"{ยี่สิบสองกรกฎาคม 5}"
		, q"{ยุคล 1}", q"{ยุคล 2}", q"{เย็นจิต}", q"{เย็นอากาศ}"
		, q"{เยาวพานิชย์}", q"{เยาวราช}", q"{แยกสวนสยาม}"
		, q"{โยธา}", q"{โยธา 1}", q"{โยธินพัฒนา}", q"{โยธี}"
		, q"{ร่มเกล้า}", q"{ร่วมจิตต์}", q"{ร่วมพัฒนา}"
		, q"{รองเมือง}", q"{ระนอง 1}", q"{ระนอง 2}", q"{รัชดาภิเษก}"
		, q"{รัชดา-รามอินทรา}", q"{รัชมงคลประสาธน์}"
		, q"{รางน้ำ}", q"{ราชดำเนินกลาง}", q"{ราชดำเนินนอก}"
		, q"{ราชดำเนินใน}", q"{ราชดำริ}", q"{ราชบพิธ}"
		, q"{ราชปรารภ}", q"{ราชพฤกษ์}", q"{ราชมนตรี}"
		, q"{ราชวงศ์}", q"{ราชวิถี}", q"{ราชินี}", q"{รามคำแหง}"
		, q"{รามคำแหง 2}", q"{รามบุตรี}", q"{รามอินทรา}"
		, q"{ราษฎร์นิมิต}", q"{ราษฎร์บูรณะ}"
		, q"{ราษฎร์พัฒนา}", q"{ราษฎร์ร่วมใจ}"
		, q"{ราษฎร์รัฐพัฒนา}", q"{ราษฎร์อุทิศ}"
		, q"{ริมคลองประปาฝั่งขวา}", q"{ริมคลองประปาฝั่งซ้าย}"
		, q"{รุ่งประชา}", q"{ลงท่า}", q"{ลาซาล}", q"{ลาซาล-แบริ่ง}"
		, q"{ลาดกระบัง}", q"{ลาดปลาเค้า}", q"{ลาดพร้าว}"
		, q"{ลาดพร้าว 101}", q"{ลาดพร้าววังหิน}"
		, q"{ลาดหญ้า}", q"{ลำไทร}", q"{ลำพู}", q"{ลำพูนไชย}"
		, q"{ลำมะเขือขื่น}", q"{ลิขิต}", q"{ลูกหลวง}"
		, q"{เลียบคลองเนินทราย}", q"{เลียบคลองบางเขน}"
		, q"{เลียบคลองบางพรม}", q"{เลียบคลองปทุม}"
		, q"{เลียบคลองผดุงกรุงเกษม}", q"{เลียบคลองพิทยาลงกรณ์}"
		, q"{เลียบคลองภาษีเจริญฝั่งใต้}", q"{เลียบคลองภาษีเจริญฝั่งเหนือ}"
		, q"{เลียบคลองมอญ}", q"{เลียบคลองลำกอไผ่}"
		, q"{เลียบคลองสอง}", q"{เลียบคลองสิบสามฝั่งตะวันตก}"
		, q"{เลียบคลองสิบสามฝั่งตะวันออก}", q"{เลียบทะเลสาบ}"
		, q"{เลียบทางรถไฟสายใต้}", q"{เลียบวารี}"
		, q"{วงศ์สว่าง}", q"{วงแหวนอุตสาหกรรม}"
		, q"{วรจักร}", q"{วังเจ้าสาย}", q"{วังเดิม}"
		, q"{วังหลัง}", q"{วัชรพล}", q"{วัฒนธรรม}"
		, q"{วัดเวฬุวนาราม}", q"{วัดสุขใจ}", q"{วัดใหม่เจริญราษฎร์}"
		, q"{วิทยุ}", q"{วิบูลย์สาธุกิจ}", q"{วิภาวดีรังสิต}"
		, q"{วิวัฒน์เวียง}", q"{วิสุทธิกษัตริย์}"
		, q"{วุฒากาศ}", q"{ศรีธรรมาธิราช}", q"{ศรีนครินทร์}"
		, q"{ศรีนครินทร์-ร่มเกล้า}", q"{ศรีบูรพา}"
		, q"{ศรีวรา}", q"{ศรีเวียง}", q"{ศรีอยุธยา}"
		, q"{ศาลธนบุรี}", q"{ศาลาแดง}", q"{ศาลาธรรมสพน์}"
		, q"{ศิริเกษม}", q"{ศิริพงษ์}", q"{ศุภมิตร}"
		, q"{เศรษฐศิริ}", q"{เศรษฐศิริ 2}", q"{สกุลดี}"
		, q"{สตรีวิทยา 2}", q"{สนามไชย}", q"{สมเด็จเจ้าพระยา}"
		, q"{สมเด็จพระเจ้าตากสิน}", q"{สมเด็จพระปิ่นเกล้า}"
		, q"{สรงประภา}", q"{สรณคมน์}", q"{สรรพาวุธ}"
		, q"{สราญรมย์}", q"{สวนผัก}", q"{สวนพลู}", q"{สวนสยาม}"
		, q"{สวนอ้อยซอยกลาง}", q"{สวรรคโลก}"
		, q"{สวัสดิการ 1}", q"{สวัสดิการ 2}", q"{สวัสดิการ 3}"
		, q"{สว่าง}", q"{สะแกงาม}", q"{สะพานพุทธ}"
		, q"{สังคมสงเคราะห์}", q"{สังคโลก}", q"{สังฆประชา}"
		, q"{สังฆสันติสุข}", q"{สันติภาพ}", q"{สาทรใต้}"
		, q"{สาทรเหนือ}", q"{สาธุประดิษฐ์}", q"{สามวา}"
		, q"{สามเสน}", q"{สายไหม}", q"{สารสิน}", q"{สารีบุตร}"
		, q"{สารีบุตร-ทับยาว}", q"{สาลีรัฐวิภาค}"
		, q"{สิบสามห้าง}", q"{สิรินธร}", q"{สี่พระยา}"
		, q"{สีลม}", q"{สีหบุรานุกิจ}", q"{สุขสวัสดิ์}"
		, q"{สุขาภิบาล 2}", q"{สุขาภิบาล 5}", q"{สุขาภิบาลบางระมาด}"
		, q"{สุขุมวิท}", q"{สุขุมวิท 71}", q"{สุโขทัย}"
		, q"{สุคนธสวัสดิ์}", q"{สุคันธาราม}"
		, q"{สุดประเสริฐ}", q"{สุทธาวาส}", q"{สุทธิสารวินิจฉัย}"
		, q"{สุนทรโกษา}", q"{สุพรรณ}", q"{สุรวงศ์}"
		, q"{สุรศักดิ์}", q"{สุวินทวงศ์}", q"{สุเหร่าคลองหนึ่ง}"
		, q"{เสนานิคม 1}", q"{เสรีไทย}", q"{เสือป่า}"
		, q"{แสนเกษม}", q"{แสมดำ}", q"{หทัยมิตร}", q"{หทัยราษฎร์}"
		, q"{หนองแขม-วัดศรีนวล}", q"{หนองระแหง}"
		, q"{หน้าพระธาตุ}", q"{หน้าพระลาน}", q"{หน้าหับเผย}"
		, q"{หม่อมเจ้าสง่างาม สุประดิษฐ์}", q"{หมู่บ้านเศรษฐกิจ}"
		, q"{หลวง}", q"{หลวงพรตพิทยพยัต}", q"{หลวงแพ่ง}"
		, q"{หลักเมือง}", q"{หลังสวน}", q"{หลานหลวง}"
		, q"{หอวัง}", q"{หัวหมาก}", q"{อนันตนาค}", q"{อนามัยงามเจริญ}"
		, q"{อนุวงศ์}", q"{อยู่เย็น}", q"{อยู่วิทยา}"
		, q"{อรุณอมรินทร์}", q"{อโศก-ดินแดง}"
		, q"{อโศกมนตรี}", q"{อ่อนนุช}", q"{อังรีดูนังต์}"
		, q"{อัศวพิเชษฐ์}", q"{อัษฎางค์}", q"{อัสสัมชัญ}"
		, q"{อาจณรงค์}", q"{อำนวยสงคราม}", q"{อินทรพิทักษ์}"
		, q"{อินทราวาส}", q"{อิสรภาพ}", q"{อุณากรรณ}"
		, q"{อุดมสุข}", q"{อุทยาน}", q"{อู่ทองนอก}"
		, q"{อู่ทองใน}", q"{เอกชัย}", q"{แฮปปี้แลนด์}"
		, q"{60 พรรษามหาราชินี}" ];

		return choice(strs, this.rnd);
	}

	override string locationStreetPattern() {
		switch(uniform(0, 1, this.rnd)) {
			case 0: return locationStreetName();
			default: return "";
		}
	}

	override string personFemaleFirstName() {
		const string[] strs =
		[ q"{อารียา}", q"{อุบลรัตน์}", q"{นิธิมา}"
		, q"{เกศศรินทร์}", q"{วิจิตร}", q"{กุสุมา}"
		, q"{ชณัญชิดา}", q"{กาญจนาพร}", q"{อริสา}"
		, q"{กฤติยาณี}", q"{ณัฐธิชา}", q"{มลธิญา}"
		, q"{ปทุมทิพย์}", q"{ปริยากร}", q"{พิศพิไล}"
		, q"{มธุรดา}", q"{ลักษิกา}", q"{พิรารัตน์}"
		, q"{จิระภัทร}", q"{น้ำฝน}", q"{อธิชา}", q"{วิไลวรรณ}"
		, q"{อรณิชา}", q"{จณิสตา}", q"{ขนิษฐา}", q"{เพ็ญพักตร์}"
		, q"{ธัญลักษณ์}", q"{จันติมา}", q"{วนิดา}"
		, q"{วันวิสา}", q"{กุ้ง}", q"{ทัดดาว}", q"{กาญจนิจนันท์}"
		, q"{ชมัยพร}", q"{สายชล}", q"{พชรมน}", q"{กชมน}"
		, q"{จิรวรรณ}", q"{นนทพร}", q"{ลินดา}", q"{สุพัฒนา}"
		, q"{เบ็ญจวรรณ}", q"{ธณิษราภรณ์}", q"{ศิริขวัญ}"
		, q"{นภัทร}", q"{วีร์ชัญญา}", q"{ยุพาวดี}"
		, q"{อาภานันท์}", q"{จันทร์ณภาพร}", q"{เอมมิกา}"
		, q"{เย็นฤดี}", q"{นวัชภรณ์}", q"{อัญชลี}"
		, q"{ช่อแก้ว}", q"{ณัฐวดี}", q"{ยุภาพร}", q"{โสรญา}"
		, q"{อรอุมา}", q"{ปรารถนา}", q"{จินตนา}", q"{นภัณ}"
		, q"{ปุณยาพร}", q"{วริษรา}", q"{กฤษฎาวรรณ}"
		, q"{สุภาลักษณ์}", q"{พัชรนันท์}", q"{กาญจนา}"
		, q"{ธีรนิดา}", q"{ณิชญา}", q"{เเพรวนภา}", q"{วลัญช์รัตน์}"
		, q"{สัณห์สินี}", q"{ผูกขวัญ}", q"{กีรติกา}"
		, q"{นวรัตน์}", q"{ณัฐธิณีภรณ์}", q"{ทิพย์สุดา}"
		, q"{กัญญาณี}", q"{พารีด๊ะ}", q"{รัชฏาพร}"
		, q"{ณัชชา}", q"{บุศญารัตน์}", q"{ทิตติยา}"
		, q"{สิตารัตน์}", q"{รติรส}", q"{ดวงเดือน}"
		, q"{กนกวรรณ}", q"{ประภาพร}", q"{นิธิพร}", q"{วรินลดา}"
		, q"{สิริรดา}", q"{นิรชา}", q"{น้องนุช}", q"{เกศินี}"
		, q"{ธิดารัตน์}", q"{กุลธรา}", q"{ปิยธิดา}"
		, q"{พิมลนาฎ}", q"{นภิศรา}", q"{ฟาริดา}", q"{มณทิญา}"
		, q"{สุมณฑา}", q"{ภูริชญา}", q"{อารญา}", q"{ณิชมน}"
		, q"{ปิยภัทร}", q"{สิรารัตน์}", q"{รวิวรรณ}"
		, q"{เกศสุดา}", q"{นันต์ธีรา}", q"{ซัยนับ}"
		, q"{ณัทกาญจน์}", q"{อันธิกา}", q"{พรรณกาญจน์}"
		, q"{สุทธาศิณี}", q"{พรสินี}", q"{นุชนาฏ}"
		, q"{สุทธิดา}", q"{ญานิกา}", q"{กรวิภา}", q"{กัลยดา}"
		, q"{นารี}", q"{พรรัตน์}", q"{สิรีธร}", q"{นัฐริกา}"
		, q"{ธิติกร}", q"{จุฑาพัตธน์}", q"{ณัฐฐานันท์}"
		, q"{ธาดารัตน์}", q"{พิรานันท์}", q"{ณัฏฐ์กุลนันท์}"
		, q"{บวรลักษณ์}", q"{ปราชิญา}", q"{ณัฏฐณิชา}"
		, q"{มณีวรรณ}", q"{รอฮานา}", q"{จิดาภา}", q"{ณภัสร์ประภา}"
		, q"{ภัทร์ชนก}", q"{กฤติกา}", q"{สุวรรณรัตน์}"
		, q"{จิราพร}", q"{ฮูดา}", q"{วริสรา}", q"{รุสณี}"
		, q"{สุทธวรรณ}", q"{ภัคจิรา}", q"{อติกานต์}"
		, q"{โยธิการ์}", q"{วิณัฐตา}", q"{กรุณามิตร}"
		, q"{กันตพร}", q"{เบญจมาภรณ์}", q"{มานิดา}"
		, q"{ดุษฎี}", q"{กาญจนาภรณ์}", q"{ฐาปนี}", q"{ธลิตา}"
		, q"{เบญญาภา}", q"{กมลรัตน์}", q"{นัจพรรณ}"
		, q"{สุนิสา}", q"{ธนิตา}", q"{ณัฎฐา}", q"{จุฑามาส}"
		, q"{สุภาภรณ์}", q"{กชามาศ}", q"{ณัฐพร}", q"{พรนิภา}"
		, q"{สุชาติพรรณ}", q"{ฤทัยรัตน์}", q"{อภิชญา}"
		, q"{ธิดาทิพย์}", q"{ปวีณ์สุดา}", q"{ฐานิสา}"
		, q"{ฮานาน}", q"{ศิริโฉม}", q"{เปรียว}", q"{นิตติยา}"
		, q"{ลลิตา}", q"{เกษรา}", q"{สโรชา}", q"{กัญจนา}"
		, q"{ปิยะธิดา}", q"{พิชยา}", q"{สุทธิวรรณ}"
		, q"{ขจิตลักษณ์}", q"{อภิรดี}", q"{วรัญรัตน์}"
		, q"{ศรสุดา}", q"{ทักษิณา}", q"{ศกุลตลา}", q"{นาลินนี}"
		, q"{โสภจรี}", q"{ธนฉัตร}", q"{ประภาวดี}", q"{ปวีณา}"
		, q"{พิมพ์นภา}", q"{วิภาวิน}", q"{จารุตา}"
		, q"{ปิยกาญจน์}", q"{บุณย์ธิดา}", q"{นิรัญตรี}"
		, q"{ปัจมาศ}", q"{จงกล}", q"{มารีแย}", q"{อัจฉรี}"
		, q"{กรรณ์ขนิษฐา}", q"{สุวคนธ์}", q"{นิศาชล}"
		, q"{พิมพ์พรรณ}", q"{ศิริษร}", q"{ประเทืองทิพย์}"
		, q"{พิมพ์ลานนา}", q"{เสาวลักษณ์}", q"{ชาลิสา}"
		, q"{เรณู}", q"{จรรญาทิพย์}", q"{ศศิวมล}", q"{โสรยา}"
		, q"{สุภาวดี}", q"{ตอยบัส}", q"{อินท์วาริน}"
		, q"{มารตี}", q"{สมจริง}", q"{บุญรื่น}", q"{สุพรรณพิมพ์}"
		, q"{นสิตา}", q"{อาภาศิริ}", q"{ทิภากรณ์}"
		, q"{นัฐมล}", q"{วันเพ็ญ}", q"{ปวิณา}", q"{เฉลียว}"
		, q"{ปัทมวรรณ}", q"{อรญา}", q"{กันตนา}", q"{ภทรชนก}"
		, q"{มัทวรรณ}", q"{วริศรา}", q"{ณัชกานต์}"
		, q"{มนิดา}", q"{อัคคเดนาย}", q"{พรวันเพ็ญ}"
		, q"{เกตนิภา}", q"{ละอองดาว}", q"{ธนาภา}", q"{จีระนันท์}"
		, q"{นับทอง}", q"{ศิริภรณ์}", q"{ชญาณ์นันท์}"
		, q"{นิยดา}", q"{กมลวรรณ}", q"{บูรณิมา}", q"{ทัศวรรณ}"
		, q"{สุชาวดี}", q"{สมัชญา}", q"{เพชรรุ้ง}"
		, q"{สุริยา}", q"{ธนาภรณ์}", q"{ขวัญมาศ}", q"{วาศิณี}"
		, q"{วิลาศิณี}", q"{สุพัตรา}", q"{ญาณิศา}"
		, q"{จิรสุดา}", q"{ภัชรีญา}", q"{ศุภกาญจน์}"
		, q"{กรวรรณ}", q"{สวรรยา}", q"{วัชรีวรรณ}"
		, q"{ยูซนีย์}", q"{พรรณไม้}", q"{นูรเดียนา}"
		, q"{ไซตุล}", q"{ยุธิดา}", q"{ลัดดาวัลย์}"
		, q"{ยุพดี}", q"{พิชญาภัค}", q"{กิตติยาภรณ์}"
		, q"{ณัฏฐ์รดา}", q"{นิสรา}", q"{วัชรี}", q"{ฟารานัส}"
		, q"{สุชารัตน์}", q"{ปรีดาพร}", q"{นริณธร}"
		, q"{ชไมพร}", q"{มัญชุพร}", q"{ทิพย์วัลย์}"
		, q"{ปรีดินันท์}", q"{ซีตีรอกีเยาะ}"
		, q"{สุนิตา}", q"{อัลวีณา}", q"{ภัททิรา}", q"{รัตน์ติการ}"
		, q"{อาริณี}", q"{กัณฐมณี}", q"{จุฑาทิพย์}"
		, q"{กนกพร}", q"{ศศิพิไล}", q"{เรวดี}", q"{อารี}"
		, q"{อภิศรา}", q"{นิติยา}", q"{ศุภสุดา}", q"{ธัญวลัย}"
		, q"{ภคญาณี}", q"{วีณา}", q"{กานต์ทิตา}", q"{ณัฐติยา}"
		, q"{ธนณัฏฐ์}", q"{ภัทรพร}", q"{ฐิติมา}", q"{อนุสรา}"
		, q"{ณัฐธิดา}", q"{นูรีซะห์}", q"{ปิยะเนตร}"
		, q"{พาดีล๊ะ}", q"{วานี}", q"{มาลินี}", q"{ภิญญดา}"
		, q"{ธีรกานต์}", q"{ธันยพร}", q"{ณัฏฐวีรยา}"
		, q"{ญาณ์สุมินทร์}", q"{ชลดา}", q"{ยารอน๊ะ}"
		, q"{วลัดดา}", q"{กัญชพร}", q"{อิลมี}", q"{อาทิติยา}"
		, q"{นพมาศ}", q"{รังสิยาภรณ์}", q"{เมทินี}"
		, q"{ธัญยาเรศ}", q"{จุฑามาศ}", q"{วนิสรา}"
		, q"{พรรณวาา}", q"{มาริษา}", q"{กมลศรี}", q"{สิริมาภรณ์}"
		, q"{อรวรรณ}", q"{กรองทอง}", q"{สัญญาลักษณ์}"
		, q"{แสงโสม}", q"{พิมพ์ภัทร}", q"{ทิราพร}"
		, q"{นลินา}", q"{ญาดา}", q"{สุชาดา}", q"{สิราพร}"
		, q"{มุทิตา}", q"{แพรพรรณ}", q"{ประภาลักษณ์}"
		, q"{สุจิตรา}", q"{ฤชุตา}", q"{นิรุชา}", q"{ธรรศชนก}"
		, q"{ภัณภิรา}", q"{ภัทราพร}", q"{อรพรรณ}", q"{ณัฐริกา}"
		, q"{วิกาณดา}", q"{เอกนรี}", q"{วรรณี}", q"{พัชริญา}"
		, q"{ศิริรักษ์}", q"{นรรณิษา}", q"{มาลีวรรณ}"
		, q"{ดาราธิป}", q"{สุธินี}", q"{ภัชราวดี}"
		, q"{ศุภัสสรณ์}", q"{ขวัญตา}", q"{ศิริวรรณ}"
		, q"{ภัทรจีรา}", q"{สุพิตรา}", q"{รัตติยากร}"
		, q"{แวรอยฮัน}", q"{รัตมล}", q"{ธิดากานต์}"
		, q"{สุรัสวดี}", q"{ทัศนีวรรณ}", q"{นันทิตา}"
		, q"{ภัทรสุดา}", q"{หนูพิศ}", q"{ขวัญเรือน}"
		, q"{คฑามาศ}", q"{สุรภา}", q"{กฤศณา}", q"{นันท์ธนา}"
		, q"{เนตรนภา}", q"{เนตรยา}", q"{แมะยะ}", q"{ศุภาณีย์}"
		, q"{ชณิชา}", q"{พาดีฮะ}", q"{นฤมล}", q"{กัญญาลักษณ์}"
		, q"{วิชญาณี}", q"{สุวงศ์ษา}", q"{อณิษา}", q"{ธารารัตน์}"
		, q"{ณิชย์ฐกานต์}", q"{จริญญา}", q"{แก้วใจ}"
		, q"{ศิริพร}", q"{สไบทิพย์}", q"{ปริญสิรา}"
		, q"{อชิรญาณ์}", q"{รัชกร}", q"{หทัยรัตน์}"
		, q"{รุจิภา}", q"{มนทกานติ์}", q"{ภัทรภร}"
		, q"{อนิศรา}", q"{จันทนิภา}", q"{วิมาลิน}"
		, q"{ชลิดา}", q"{ฑิตฐิตา}", q"{สรัลรัตน์}"
		, q"{จารวี}", q"{ภานิณี}", q"{ฟิรดาวส์}", q"{แพรวพลอย}"
		, q"{มลศิมา}", q"{รัชพิมล}", q"{กวินทิพย์}"
		, q"{อาภรณ์}", q"{จิรภิญญา}", q"{ปฐมาวดี}"
		, q"{เจนนิสา}", q"{ภาวินี}", q"{ซูไรญา}", q"{วิรินทร์ญา}"
		, q"{อิศราภรณ์}", q"{นาเดีย}", q"{ภานุมาศ}"
		, q"{ปรินรัตน์}", q"{พเยาว์}", q"{นงนภัส}"
		, q"{วรวีย์}", q"{อมลวรรณ}", q"{วิลาสินี}"
		, q"{วรดา}", q"{เกษร}", q"{พุธธิญา}", q"{กอบกุล}"
		, q"{ปิยพร}", q"{กรรณิการ์}", q"{จันทมาศ}"
		, q"{วงศิยา}", q"{โชติกา}", q"{มานิตา}", q"{บุปผลักษณ์}"
		, q"{ญานิศา}", q"{ณัฐมนต์}", q"{สิริลักษณ์}"
		, q"{ปิยนุช}", q"{วิชุดา}", q"{สลินทิพย์}"
		, q"{เมทนี}", q"{เจนจิรา}", q"{สุวนันต์}", q"{จุฑามณี}"
		, q"{ชุรีภรณ์}", q"{อัญญารัตน์}", q"{รุสดา}"
		, q"{หนูซิน}", q"{กรรณิกา}", q"{พกาวรรณ}", q"{พรวลัย}"
		, q"{กัลยรัตน์}", q"{เกวลี}", q"{พัชรพร}", q"{สุพรรณ์}"
		, q"{อริญา}", q"{วิไลรัตน์}", q"{ธมลพรรณ}"
		, q"{พิมพ์ตินันท์}", q"{คณาพฤฒ}", q"{ลมุล}"
		, q"{วิสุดา}", q"{สิริมา}", q"{กฤษณา}", q"{สุวลี}"
		, q"{กุลภัสสรณ์}", q"{กัญญารัตน์}", q"{สรวงสุดา}"
		, q"{พิมพมาศ}", q"{นรีกานต์}", q"{ขวัญรัตน์}"
		, q"{โมนา}", q"{จุฑารัตน์}", q"{จิราภรณ์}"
		, q"{ปนัดดา}", q"{นิลุบล}", q"{มะลิ}", q"{อิลฮัม}"
		, q"{ธัญญา}", q"{พรรณรายณ์}", q"{สาธิตา}", q"{อภิวรรณ}"
		, q"{พนิตสิรี}", q"{ฐิตินันท์}", q"{ธัญสินี}"
		, q"{จันทิมา}", q"{วิไลลักษณ์}", q"{ภัสสร}"
		, q"{สายฝน}", q"{สุธิดา}", q"{ศิริญา}", q"{ปานทิพย์}"
		, q"{เบญจวรรณ}", q"{มูนีเราะห์}", q"{นิลยา}"
		, q"{ธณพร}", q"{เพชรรัตน์}", q"{มณฑิตา}", q"{กฤตยา}"
		, q"{เกศรินทร์}", q"{อิสรีย์}", q"{อริยา}"
		, q"{สุชานาฎ}", q"{อุบลวรรณ}", q"{สาวตา}", q"{กุลภัสสร}"
		, q"{นงลักษณ์}", q"{สาฝีย๊ะ}", q"{วลัทยา}"
		, q"{ขวัญเนตร}", q"{ซูเซียนา}", q"{พัชทนัน}"
		, q"{วราภรณ์}", q"{พริมรตา}", q"{รุ่งทิวา}"
		, q"{ศิริลักษณ์}", q"{แสงสุรีย์}", q"{โซรายา}"
		, q"{สุนิษา}", q"{นงพร}", q"{สุรางรัตน์}", q"{ปนัฎดา}"
		, q"{ศิวัชญา}", q"{ชนิธาดา}", q"{มนัศรา}", q"{ระพีพรรณ}"
		, q"{กัญญณภัส}", q"{อาทิตติยา}", q"{สุดธิดา}"
		, q"{ทัศนีย์}", q"{รัชนิดา}", q"{สรัสนันท์}"
		, q"{ทิภาพรรณ}", q"{อนัญญา}", q"{นัฐวรรณ}"
		, q"{ภัทราภรณ์}", q"{จุไรวรรณ}", q"{ชลธร}"
		, q"{จิรากัญ}", q"{ปาณิศา}", q"{พลอยรุ้ง}"
		, q"{มณทารัตน์}", q"{ปทุมพร}", q"{ศินีนุช}"
		, q"{ฐิตินันทา}", q"{กันติชา}", q"{ศศิมา}"
		, q"{สิริญา}", q"{วิมลทิพย์}", q"{นริศรา}"
		, q"{จารุวรรณ}", q"{เปมนีย์}", q"{ชนัดดา}"
		, q"{นูรฮานาน}", q"{ณัฐนิชา}", q"{ดาวรุ่ง}"
		, q"{พรปิยา}", q"{พรทิมา}", q"{สิริพร}", q"{กิติยา}"
		, q"{เกศราภรณ์}", q"{พัชรินทร์}", q"{มามิ}"
		, q"{ประภัสสร}", q"{บุญปลูก}", q"{ปฐมาภรณ์}"
		, q"{กมลชนก}", q"{ลำยอง}", q"{จินดารัตน์}"
		, q"{ยัสมี}", q"{นัฐพร}", q"{ธนาพร}", q"{รังษี}"
		, q"{เพชรี}", q"{ณัฐฐิญา}", q"{ภัทรศยา}", q"{ศุภิสรา}"
		, q"{ดวงฤทัย}", q"{ซูไรฮา}", q"{ภัคเปมิกา}"
		, q"{เพ็ญไพลิน}", q"{จินตพร}", q"{ฟารีนา}"
		, q"{วนาลี}", q"{ชนาธิป}", q"{ณัชนภาพัชร์}"
		, q"{อักษราภัค}", q"{อรไท}", q"{รัชฎาบูรณ์}"
		, q"{สุนันทิณี}", q"{รายาวดี}", q"{บุญญาพร}"
		, q"{ศุภัคศร}", q"{ณัฐสิยา}", q"{ชุลีพร}", q"{ศศินา}"
		, q"{จิตต์นิภา}", q"{ผกามาศ}", q"{เกตน์นิภา}"
		, q"{ทิวาพร}", q"{สกลวรรญ์}", q"{ศุภัชฌา}"
		, q"{ศรินยา}", q"{นันทิกานต์}", q"{ต่วนนูรียะห์}"
		, q"{วารุณี}", q"{อัญมณี}", q"{สุขประวีณ์}"
		, q"{สุธาสินี}", q"{ยุพาภรณ์}", q"{หายาตี}"
		, q"{พุทธชาติ}", q"{สุชิลา}", q"{ปริศนา}", q"{จุไรรัตน์}"
		, q"{วิยะดา}", q"{อังคณา}", q"{สุดารัตน์}"
		, q"{นันทรัตน์}", q"{ภัฏชนก}", q"{พิมพ์สุดา}"
		, q"{เกศกนก}", q"{ชุติวรรณ}", q"{อุไร}", q"{รุ่งฤดี}"
		, q"{กัลยาณี}", q"{ปริชาติ}", q"{ณัฐวรา}", q"{ธนัญญา}"
		, q"{วุฒชริน}", q"{ธัญญารัตน์}", q"{นวพรรณ}"
		, q"{ศรัณรัตน์}", q"{ปรัศนี}", q"{บุษบา}", q"{รัตติภรณ์}"
		, q"{มณีรุ่ง}", q"{นูรีดา}", q"{อามีเนาะ}"
		, q"{วลี}", q"{กุลสิริ}", q"{สุธาดา}", q"{ฎาริกา}"
		, q"{รัตติกาล}", q"{มุกธิดา}", q"{ซันนีย๊ะ}"
		, q"{พีรพร}", q"{ฟาติเมาะ}", q"{สราริน}", q"{ชลลดา}"
		, q"{พลอยวรินทร์}", q"{กนิษฐา}", q"{ธัญย์ชนก}"
		, q"{ศิราณี}", q"{ธุดลกัญจ์}", q"{แอนนา}", q"{อรชา}"
		, q"{มะลิวรรณ์}", q"{สุธาทิพย์}", q"{กันยารัตน์}"
		, q"{สถิดา}", q"{เพ็ญทิพย์}", q"{ปณิชา}", q"{นิชาภา}"
		, q"{ณฐพร}" ];

		return choice(strs, this.rnd);
	}

	override string personFemalePrefix() {
		const string[] strs =
		[ q"{พญ.}", q"{ดร.}", q"{ผศ.ดร.}" ];

		return choice(strs, this.rnd);
	}

	override string personLastName() {
		const string[] strs =
		[ q"{กีรติวัฒนานุศาสน์}", q"{งามกระโทก}"
		, q"{งามค้างพลู}", q"{งามจันทึก}", q"{งามนอก}"
		, q"{งามพิมาย}", q"{งามสีสุก}", q"{จันทรโชติ}"
		, q"{จันทโชติ}", q"{จินดาพล}", q"{ชาญโลหะ}"
		, q"{ชุมพล}", q"{ณ นคร}", q"{ณ บางช้าง}", q"{ณ ป้อมเพชร}"
		, q"{ดำใส}", q"{ธรรมเสน}", q"{นรินทรกุล}", q"{นรินทรางกูร}"
		, q"{นาคสวัสดิ์}", q"{บางกระโทก}", q"{บางค้างพลู}"
		, q"{บางจันทึก}", q"{บางนอก}", q"{บางพิมาย}"
		, q"{บางสีสุก}", q"{บุนนาค}", q"{บุรณศิริ}"
		, q"{ปราบพล}", q"{พลจรัส}", q"{มณีกระโทก}"
		, q"{มณีค้างพลู}", q"{มณีจันทึก}", q"{มณีนอก}"
		, q"{มณีพิมาย}", q"{มณีสีสุก}", q"{มธุรส}"
		, q"{มนตรีกุล}", q"{รอดแก้ว}", q"{วงศา}", q"{วงศ์กระโทก}"
		, q"{วงศ์ค้างพลู}", q"{วงศ์จันทึก}", q"{วงศ์นอก}"
		, q"{วงศ์พิมาย}", q"{วงศ์สีสุก}", q"{วัชโรทัย}"
		, q"{วารีศรี}", q"{ศิริกุล}", q"{สมตระกูล}"
		, q"{สมศักดิ์}", q"{สมุทบาล}", q"{สืบกระพันธ์}"
		, q"{สุจริตกุล}", q"{หนอกกระโทก}", q"{หนอกค้างพลู}"
		, q"{หนอกจันทึก}", q"{หนอกนอก}", q"{หนอกพิมาย}"
		, q"{หนอกสีสุก}", q"{หยูด้วง}", q"{หิรัญ}"
		, q"{อมาตยกุล}", q"{อริยวงสกุล}", q"{อินทโชติ}"
		, q"{อิศรางกูร}", q"{ฮะมงคล}", q"{เกตุกระโทก}"
		, q"{เกตุค้างพลู}", q"{เกตุจันทึก}", q"{เกตุนอก}"
		, q"{เกตุพิมาย}", q"{เกตุสีสุก}", q"{เกิดกระโทก}"
		, q"{เกิดค้างพลู}", q"{เกิดจันทึก}", q"{เกิดนอก}"
		, q"{เกิดพิมาย}", q"{เกิดสีสุก}", q"{เจษฎางกูร}"
		, q"{เจียวกระโทก}", q"{เจียวค้างพลู}"
		, q"{เจียวจันทึก}", q"{เจียวนอก}", q"{เจียวพิมาย}"
		, q"{เจียวสีสุก}", q"{เทพหัสดิน}", q"{เทิบกระโทก}"
		, q"{เทิบค้างพลู}", q"{เทิบจันทึก}", q"{เทิบนอก}"
		, q"{เทิบพิมาย}", q"{เทิบสีสุก}", q"{เพื่อนรักษ์}"
		, q"{แขกระโทก}", q"{แขค้างพลู}", q"{แขจันทึก}"
		, q"{แขนอก}", q"{แขพิมาย}", q"{แขสีสุก}", q"{แซ่ตั้ง}"
		, q"{แซ่ลิ้ม}", q"{แซ่หลิน}", q"{แซ่หลี่}"
		, q"{แซ่หวง}", q"{แซ่อึ๊ง}", q"{แซ่อู๋}", q"{แซ่เจิ้ง}"
		, q"{แซ่เฉิน}", q"{แซ่โง้ว}", q"{โรจนกุล}" ];

		return choice(strs, this.rnd);
	}

	override string personMaleFirstName() {
		const string[] strs =
		[ q"{ไพรี}", q"{กานต์ธนิต}", q"{ศุภกิจ}", q"{หาบ}"
		, q"{สุธีมนต์}", q"{ธนภูมิ}", q"{วิสายันต์}"
		, q"{เส็น}", q"{สมโชค}", q"{ศรสิทธิ์}", q"{อกัณห์}"
		, q"{สิปปกร}", q"{อนุวัต}", q"{สุทธิณัฐ}", q"{วรินทร}"
		, q"{วีระวุธ}", q"{สำเภา}", q"{อรรถเกียรติ}"
		, q"{อุกฤษฎ์}", q"{ธำรงชัย}", q"{นัณธพงศ์}"
		, q"{ณัฐชนน}", q"{ปาพจน์}", q"{สุไฮลัน}", q"{วรวินาย}"
		, q"{พงศ์ศักดิ์}", q"{สุระ}", q"{กิตติศักดิ์}"
		, q"{วิญญ์}", q"{ปวรรุจ}", q"{อาซิ}", q"{สรุศักดิ์}"
		, q"{วาสนา}", q"{อัฎฐพล}", q"{ทนุชูพงษ์}", q"{กนกชัย}"
		, q"{กนกวรรณ}", q"{คุ้ง}", q"{อนุภาส}", q"{วิชยานนท์}"
		, q"{ศุภมงคล}", q"{ณัฐพงศ์}", q"{บาดินธ์}"
		, q"{นฤชา}", q"{สุรีพงศ์}", q"{เดโนาย}", q"{สมภูมิ}"
		, q"{ชาลาดล}", q"{บุญทอน}", q"{กฤษฎิ์ธนัช}"
		, q"{วราวุฒ}", q"{อติกร}", q"{เอกพล}", q"{ดำรงค์}"
		, q"{ธนนนท์}", q"{สุไลมาน}", q"{พรประชา}", q"{พฤษภา}"
		, q"{ปณต}", q"{ซูฟยัน}", q"{สมจิตร}", q"{ออย}", q"{ศิรพงศ์}"
		, q"{บูขอรี}", q"{พงษ์นเรศ}", q"{สง่าชัย}"
		, q"{นิมุ}", q"{อาดิษฐ์}", q"{ไพฑูร}", q"{ตอฮา}"
		, q"{บุญนพ}", q"{ภูมิสิน}", q"{สัจจธรรม}", q"{อนุเทพ}"
		, q"{ยรรยง}", q"{ทวีศักดิ์}", q"{มงคลสิษฐ์}"
		, q"{โอชิษฐ์}", q"{ฐานทัต}", q"{อาหมาด}", q"{อาร์ต}"
		, q"{พิชญะ}", q"{อรุณพงษ์}", q"{จริยวัตร}"
		, q"{ธนภัทร}", q"{เอกวัฒน์}", q"{ยุทธพิชัย}"
		, q"{วีระวัฒน์}", q"{มเหศวร}", q"{สวงษ์}", q"{โสฬส}"
		, q"{มะเย็ง}", q"{ณัฐพงค์}", q"{ชลธานี}", q"{ศุภชัย}"
		, q"{สุทธิภาคย์}", q"{ดาวธง}", q"{ณฤภณ}", q"{ธีติ}"
		, q"{สุรเชษฐ}", q"{อภิชาติ}", q"{นันทิพัฒน์}"
		, q"{อลงกรณ์}", q"{อัทธสิทธิ์}", q"{ศตคุณ}"
		, q"{ประกาศิต}", q"{ป๋วย}", q"{เปี่ยมโกมล}"
		, q"{ธราวิทญ์}", q"{ทองจันทร์}", q"{ศุรศักดิ์}"
		, q"{พัชรพร}", q"{สาคร}", q"{จิรทีปต์}", q"{วิเชษฐ์}"
		, q"{บูรณศักดิ์}", q"{ษมาศักดิ์}", q"{ชัชชวาลย์}"
		, q"{โรซาดีย์}", q"{สายชล}", q"{มูฮำมัด}", q"{หัสรณ}"
		, q"{ปิติพงษ์}", q"{สันชัย}", q"{สังวาล}", q"{ปิยวิชญ์}"
		, q"{วรินทธิ์ธร}", q"{พงศ์กฤษณ์}", q"{เรืองวิสิฐ}"
		, q"{ชยุต}", q"{จันทรา}", q"{ปศานนท์}", q"{กล่ำคาน}"
		, q"{ธีระพงษ์}", q"{พชร}", q"{ทองพันแสน}", q"{สารสินธ์}"
		, q"{ราษฎร์พิชิต}", q"{สุภพงษ์}", q"{อาทิติ}"
		, q"{ไชยพิพัฒน์}", q"{อรรถชัย}", q"{ธราพงศ์}"
		, q"{ซูลฟีย์}", q"{อรุณ}", q"{ธีทัชฐ์}", q"{รัตนพล}"
		, q"{สุระพง}", q"{ดอกไม้}", q"{อรุณชัย}", q"{หลักทรัพย์}"
		, q"{ทนาวุฒิ}", q"{พิชญ์}", q"{วรจันทร์}", q"{กรินท์}"
		, q"{วัฒนไชย}", q"{กฤษณ์ขจร}", q"{ภาณุวัชร}"
		, q"{เหน่ง}", q"{ถาวร}", q"{ปติพัท}", q"{สุรศักดิ์}"
		, q"{วิวรรธน์}", q"{วีรภัทร}", q"{พิชิตชัย}"
		, q"{ธนาเสฎฐ์}", q"{ปาน}", q"{ธรรณธร}", q"{ณฐพงศ์}"
		, q"{ภัทรดนัย}", q"{โฅไมนี}", q"{วรากร}", q"{เอกชน}"
		, q"{มุรซาลีน}", q"{แสงสุรีย์}", q"{วีรพจน์}"
		, q"{วีราวุทธ์}", q"{รัศมี}", q"{อรรถวิโรจน์}"
		, q"{วินิจ}", q"{ศักดิ์สิทธ}", q"{ศรัณยู}"
		, q"{วรศิษฎ์}", q"{ชินกร}", q"{เทเวศวร์}", q"{ศิธร}"
		, q"{วัชระ}", q"{สรนัท}", q"{วีระกร}", q"{สรยุทธ}"
		, q"{สราวุฒิ}", q"{ราเมศ}", q"{นิวัฒน์}", q"{ปราปต์}"
		, q"{ฮาลีม๊ะห์}", q"{อภิลักษณ์}", q"{นิติธร}"
		, q"{พูลสวัสดิ์}", q"{อัมซะห์}", q"{อนุพล}"
		, q"{นพวินาย}", q"{ปานจิตร}", q"{บุญรอด}", q"{ปกาสิต}"
		, q"{กิตติวัฒน์}", q"{สนธยา}", q"{ฮานาฟี}"
		, q"{รังสฤษฎ์}", q"{สอ}", q"{ณัทกร}", q"{ภรัณยู}"
		, q"{ปพนสรรค์}", q"{สุริยวัฒน์}", q"{ประเสริฐพงศ์}"
		, q"{ศันสนะ}", q"{ปริยวิศว์}", q"{สุรษิต}"
		, q"{วรเดช}", q"{สิริพงษ์}", q"{ชาติชัย}", q"{ณัฐพงษ์}"
		, q"{มณี}", q"{เรืองโรจน์}", q"{ธีรศักดิ์}"
		, q"{อนุบาล}", q"{ชวัลวิชญ์}", q"{ณัฐธนชัย}"
		, q"{ณภัทร}", q"{อภิรัตน}", q"{ทะนุ}", q"{เลื่อน}"
		, q"{นพกร}", q"{ภูวนัย}", q"{โกมินทร์}", q"{ทรงพันธ์}"
		, q"{ศรายุทธ์}", q"{ภาสวร}", q"{พณทรรศ}", q"{ธนวิชญ์}"
		, q"{พงศ์สัคค์}", q"{วีระศักดิ์}", q"{รังสรรทญ์}"
		, q"{อเนก}", q"{จรัสฤทธิ์}", q"{ฐณพล}", q"{ภูริดล}"
		, q"{ปิยวัฒน์}", q"{ธนกฤต}", q"{พัฒนา}", q"{อัศวรักษ์}"
		, q"{พุทธินันท์}", q"{ฉัตร}", q"{กิตติพัทธ์}"
		, q"{ธนโชติ}", q"{อิบนิลอายาด}", q"{ธนพล}"
		, q"{พงษ์ศักดิ์}", q"{คงกระพัน}", q"{อิสระชัย}"
		, q"{ธนาคช}", q"{ศุภวิชญ์}", q"{พีระพล}", q"{พุทธสวาท}"
		, q"{อำคา}", q"{กิตติชัย}", q"{รอมือลี}", q"{ฤทธิไกร}"
		, q"{พิชญ}", q"{กรณินทร์}", q"{ฌาณปรีชา}", q"{ธิติ}"
		, q"{กรณ์}", q"{เดชภูมิ}", q"{วิศรุต}", q"{วิทย์พงศ์}"
		, q"{พงษ์ทรัพย์}", q"{ณัฐพนธ์}", q"{ธนากร}"
		, q"{สหัสวรรษ}", q"{นิยม}", q"{นันท์พิพัชร์}"
		, q"{ธิปไตย}", q"{ยุพราช}", q"{ธนกร}", q"{พวง}"
		, q"{พงศธร}", q"{เจตพล}", q"{เตชิต}", q"{ชัยณัฎฐ์}"
		, q"{สุรเดช}", q"{กฤติศักดิ์}", q"{วนัย}", q"{สุรวิชญ์}"
		, q"{โชคอำนวย}", q"{พิทักษ์}", q"{ธัชพงศ์}"
		, q"{ศรชัย}", q"{กิิตติกร}", q"{เกษมสุข}", q"{เจษฎาภรณ์}"
		, q"{ธีรพล}", q"{เจตรินทร์}", q"{รอซาลี}", q"{เรืองเดช}"
		, q"{พีรพงษ์}", q"{ธนกฤษ}", q"{ทศเทพ}", q"{สุทธิชัย}"
		, q"{ชาญชล}", q"{วรเมธ}", q"{จาตุรภัทร}", q"{ธีรพงษ์}"
		, q"{พิชญ์สิชฌ์}", q"{ณัฐวุฒิ}", q"{พีรยุทธ}"
		, q"{ธาดา}", q"{ยุทธพันธ์}", q"{พรชาย}", q"{ชานน}"
		, q"{พีระชัย}", q"{ปวันรัตน์}", q"{นนทวัฒน์}"
		, q"{เดโช}", q"{ธนิสร์}", q"{ปรัญชญา}", q"{ณิชภูมิ}"
		, q"{พรหมชัย}", q"{ภาคภูมิ}", q"{ธนัตถ์}", q"{ณัฎฐกร}"
		, q"{ผลินนาลักษมณ์}", q"{ปิยะชัย}", q"{พิเชียร}"
		, q"{ภัทรวิทย์}", q"{ธราพงษ์}", q"{ชัยชนะ}"
		, q"{สมบูรณ์}", q"{เนกษ์วิชนาถ}", q"{กวีรภัทร}"
		, q"{พงษ์สถิต}", q"{โพสิฐ์}", q"{ปิยะ}", q"{นภัสกร}"
		, q"{ระวีวัชร์}", q"{สุทธิศักดิ์}", q"{ธนวันต์}"
		, q"{ทองอินทร์}", q"{ภานุวัฒน์}", q"{วุฒิชัย}"
		, q"{ชาญชัย}", q"{กฤตานน}", q"{ภากร}", q"{มนัสชัย}"
		, q"{กอบเกียรติ์}", q"{วิชาญ}", q"{สรวิชญ์}"
		, q"{ธนาธร}", q"{ธีระพันธ์}", q"{อรรคพล}", q"{บุญญฤทธิ์}"
		, q"{ธนภัทร์}", q"{กัณวีย์}", q"{กันต์ศุภณัช}"
		, q"{ชัชวาล}", q"{ดนุภัทร}", q"{เปลี่ยน}", q"{ณชธฤต}"
		, q"{นราวิชญ์}", q"{ธีรธรรม}", q"{ณัฏฐ์ภณ}"
		, q"{กูดิง}", q"{เรืองเกียรติ}", q"{กุลชาติ}"
		, q"{นวพล}", q"{เชิด}", q"{ทวียศ}", q"{ณสรวง}", q"{วงศ์ตะวัน}"
		, q"{พีรวิชญ์}", q"{จำนาญ}", q"{ชวนากร}", q"{สมคิด}"
		, q"{เตชพัฒน์}", q"{ณรงค์ฤทธิ์}", q"{ธัชชัย}"
		, q"{ธวัชชวิน}", q"{พันธวงศ์}", q"{ภัทรกร}"
		, q"{ทองคูณ}", q"{เทพทัต}", q"{กิตติพงศ์}"
		, q"{สุทธิพงศ์}", q"{บุรพล}", q"{ธนวัฒน์}"
		, q"{ฐาปกรณ์}", q"{ฐานันดร}", q"{เถลิงเกียรติ}"
		, q"{ณรงค์พร}", q"{เฉลิมเกียรติ}", q"{ภูวเรศ}"
		, q"{กษิดิส}", q"{โยธกานต์}", q"{กิตติธัช}"
		, q"{ริณพัตน์}", q"{ลัคนพงษ์}", q"{จิรศักดิ์}"
		, q"{ร้อหมาด}", q"{กิตตินันท์}", q"{ธนาภัทร}"
		, q"{ประวุฒิ}", q"{บรรจง}", q"{ศัญพิชญ์}", q"{วรวิช}"
		, q"{ภคพงศ์}", q"{ภูวเดช}", q"{ภัทรพงษ์}", q"{กวียุทธ}"
		, q"{ญาณภัทร}", q"{รณกฤต}", q"{จตุรพร}", q"{อนุพงค์}"
		, q"{สิทธิพล}", q"{เปี่ยมเดช}", q"{วรพรรธน์}"
		, q"{แปลก}", q"{วรเมษ}", q"{โพธิ}", q"{สิริชัย}"
		, q"{ก่อเกียรติ์}", q"{เฉลิมวัฒน์}", q"{ปิยะเกียรติ์}"
		, q"{โกมุท}", q"{ณัฐพล}", q"{กิตติเดช}", q"{ภัทรชัย}"
		, q"{นันฐวัฒน์}", q"{ธนากฤษ}", q"{พงศกร}", q"{ชัยพล}"
		, q"{อรรถพล}", q"{กิจดี}", q"{กฤษกร}", q"{ธนันท์ชัย}"
		, q"{ชวโรจน์}", q"{ชนาธิป}", q"{ธีระยุทธ์}"
		, q"{ปิยพันธุ์}", q"{พีรภาส}", q"{ภัทราวุฒิ}"
		, q"{ธนวัต}", q"{ตะวัน}", q"{นิชนันท์}", q"{ระพีพงศ์}"
		, q"{ซุกรี}", q"{ปาริเยศ}", q"{พิพัฒน์}", q"{ภัทรายุทธ}"
		, q"{ปภณวัชร}", q"{ศุภกร}", q"{พุทธชาติ}", q"{ศรายุทธ}"
		, q"{เดชาวัฒน์}", q"{สมบัติ}", q"{สุกฤษฎิ์}"
		, q"{สมรัก}", q"{จิระพงศ์}", q"{เกียรติดำรงค์}"
		, q"{มานัส}", q"{จุฑา}", q"{นฤทธิ์สุนทร}", q"{จิรเสกข์}"
		, q"{สกล}", q"{กิตติพงค์}", q"{คำภา}", q"{ชลสิทธิ์}"
		, q"{ชวดล}", q"{จอมพล}", q"{จีฮาน}" ];

		return choice(strs, this.rnd);
	}

	override string personMalePrefix() {
		const string[] strs =
		[ q"{นพ.}", q"{ดร.}", q"{ผศ.ดร.}" ];

		return choice(strs, this.rnd);
	}

	override string personName() {
		const int rndInt = uniform(0, 100, this.rnd);

		if(rndInt >= 0 && rndInt < 99) {
			return personFirstName() ~ " " ~ personLastName();
		}
		if(rndInt >= 99 && rndInt < 100) {
			return personPrefix() ~ " " ~ personFirstName() ~ " " ~ personLastName();
		}

		return "";
	}

	override string personPrefix() {
		const string[] strs =
		[ q"{ดร.}", q"{นพ.}", q"{ผศ.ดร.}", q"{พญ.}" ];

		return choice(strs, this.rnd);
	}

	override string personSex() {
		const string[] strs =
		[ q"{ชาย}", q"{หญิง}" ];

		return choice(strs, this.rnd);
	}

	override string phoneNumberFormats() {
		const string[] strs =
		[ q"{06 #### ####}", q"{08 #### ####}", q"{09 #### ####}", q"{0 2### ####}", q"{0 5!## ####}" ];

		return numberBuild(choice(strs, this.rnd));
	}

}
