module faked.faker_ka_ge;

import std.algorithm : map, joiner;
import std.array;
import std.conv : to;
import std.exception : enforce;
import std.format;
import std.random;
import std.range : iota, take, repeat;
import std.string : toUpper;
import std.typecons : Nullable, nullable;

import faked.customtypes;
import faked.fakerenums;

import faked.faker_en;

class Faker_ka_ge : Faker_en {
@safe:
	this(int seed) {
		super(seed);
	}

	override string cellPhoneFormats() {
		const string[] strs =
		[ q"{(+995 32) 2-##-##-##}", q"{032-2-##-##-##}", q"{032-2-######}", q"{032-2-###-###}"
		, q"{032 2 ## ## ##}", q"{032 2 ######}", q"{2 ## ## ##}", q"{2######}", q"{2 ### ###}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string companyNamePattern() {
		final switch(uniform(0, 5, this.rnd)) {
			case 0: return companyPrefix() ~ " " ~ personFirstName();
			case 1: return companyPrefix() ~ " " ~ personLastName();
			case 2: return companyPrefix() ~ " " ~ personLastName() ~ " " ~ companySuffix();
			case 3: return companyPrefix() ~ " " ~ personFirstName() ~ " " ~ companySuffix();
			case 4: return companyPrefix() ~ " " ~ personLastName() ~ "-" ~ personLastName();
		}
		return "";
	}

	override string companySuffix() {
		const string[] strs =
		[ q"{ჯგუფი}", q"{და კომპანია}", q"{სტუდია}"
		, q"{გრუპი}" ];

		return choice(strs, this.rnd);
	}

	string companyPrefix() {
		const string[] strs =
		[ q"{შპს}", q"{სს}", q"{ააიპ}", q"{სსიპ}" ];

		return choice(strs, this.rnd);
	}

	override string internetDomainSuffix() {
		const string[] strs =
		[ q"{ge}", q"{com}", q"{net}", q"{org}", q"{com.ge}", q"{org.ge}" ];

		return choice(strs, this.rnd);
	}

	override string internetFreeEmail() {
		const string[] strs =
		[ q"{gmail.com}", q"{yahoo.com}", q"{posta.ge}" ];

		return choice(strs, this.rnd);
	}

	override string locationBuildingNumber() {
		const string[] strs =
		[ q"{###}", q"{##}", q"{#}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationCityName() {
		const string[] strs =
		[ q"{აბასთუმანი}", q"{აბაშა}", q"{ადიგენი}"
		, q"{ამბროლაური}", q"{ანაკლია}", q"{ასპინძა}"
		, q"{ახალგორი}", q"{ახალქალაქი}", q"{ახალციხე}"
		, q"{ახმეტა}", q"{ბათუმი}", q"{ბაკურიანი}"
		, q"{ბაღდათი}", q"{ბახმარო}", q"{ბოლნისი}"
		, q"{ბორჯომი}", q"{გარდაბანი}", q"{გონიო}"
		, q"{გორი}", q"{გრიგოლეთი}", q"{გუდაური}", q"{გურჯაანი}"
		, q"{დედოფლისწყარო}", q"{დმანისი}", q"{დუშეთი}"
		, q"{ვანი}", q"{ზესტაფონი}", q"{ზუგდიდი}", q"{თბილისი}"
		, q"{თეთრიწყარო}", q"{თელავი}", q"{თერჯოლა}"
		, q"{თიანეთი}", q"{კასპი}", q"{კვარიათი}", q"{კიკეთი}"
		, q"{კოჯორი}", q"{ლაგოდეხი}", q"{ლანჩხუთი}"
		, q"{ლენტეხი}", q"{მარნეული}", q"{მარტვილი}"
		, q"{მესტია}", q"{მცხეთა}", q"{მწვანე კონცხი}"
		, q"{ნინოწმინდა}", q"{ოზურგეთი}", q"{ონი}"
		, q"{რუსთავი}", q"{საგარეჯო}", q"{საგურამო}"
		, q"{საირმე}", q"{სამტრედია}", q"{სარფი}", q"{საჩხერე}"
		, q"{სენაკი}", q"{სიღნაღი}", q"{სტეფანწმინდა}"
		, q"{სურამი}", q"{ტაბახმელა}", q"{ტყიბული}"
		, q"{ურეკი}", q"{ფოთი}", q"{ქარელი}", q"{ქედა}"
		, q"{ქობულეთი}", q"{ქუთაისი}", q"{ყვარელი}"
		, q"{შუახევი}", q"{ჩაქვი}", q"{ჩოხატაური}"
		, q"{ცაგერი}", q"{ცხოროჭყუ}", q"{წავკისი}"
		, q"{წალენჯიხა}", q"{წალკა}", q"{წაღვერი}"
		, q"{წეროვანი}", q"{წნორი}", q"{წყალტუბო}"
		, q"{წყნეთი}", q"{ჭიათურა}", q"{ხარაგაული}"
		, q"{ხაშური}", q"{ხელვაჩაური}", q"{ხობი}", q"{ხონი}"
		, q"{ხულო}" ];

		return choice(strs, this.rnd);
	}

	override string locationCityPattern() {
		final switch(uniform(0, 5, this.rnd)) {
			case 0: return locationCityPrefix() ~ " " ~ personFirstName() ~ locationCitySuffix();
			case 1: return locationCityPrefix() ~ " " ~ personFirstName();
			case 2: return personFirstName() ~ locationCitySuffix();
			case 3: return personLastName() ~ locationCitySuffix();
			case 4: return locationCityName();
		}
		return "";
	}

	override string locationCityPrefix() {
		const string[] strs =
		[ q"{ახალი}", q"{ძველი}", q"{ზემო}", q"{ქვემო}" ];

		return choice(strs, this.rnd);
	}

	override string locationCitySuffix() {
		const string[] strs =
		[ q"{სოფელი}", q"{ძირი}", q"{სკარი}", q"{დაბა}" ];

		return choice(strs, this.rnd);
	}

	override string locationCountry() {
		const string[] strs =
		[ q"{ავსტრალია}", q"{ავსტრია}", q"{ავღანეთი}"
		, q"{აზავადი}", q"{აზერბაიჯანი}", q"{აზიაში}"
		, q"{აზიის}", q"{ალბანეთი}", q"{ალჟირი}", q"{ამაღლება და ტრისტანი-და-კუნია}"
		, q"{ამერიკის ვირჯინიის კუნძულები}", q"{ამერიკის სამოა}"
		, q"{ამერიკის შეერთებული შტატები}", q"{ამერიკის}"
		, q"{ანგილია}", q"{ანგოლა}", q"{ანდორა}", q"{ანტიგუა და ბარბუდა}"
		, q"{არაბეთის საემიროები}", q"{არაბთა გაერთიანებული საამიროები}"
		, q"{არაბული ქვეყნების ლიგის}", q"{არგენტინა}"
		, q"{არუბა}", q"{არცნობილი ქვეყნების სია}"
		, q"{აფრიკაში}", q"{აფრიკაშია}", q"{აღდგომის კუნძული}"
		, q"{აღმ. ტიმორი}", q"{აღმოსავლეთი აფრიკა}"
		, q"{აღმოსავლეთი ტიმორი}", q"{აშშ}", q"{აშშ-ის ვირჯინის კუნძულები}"
		, q"{ახალი ზელანდია}", q"{ახალი კალედონია}"
		, q"{ბანგლადეში}", q"{ბარბადოსი}", q"{ბაჰამის კუნძულები}"
		, q"{ბაჰრეინი}", q"{ბელარუსი}", q"{ბელგია}"
		, q"{ბელიზი}", q"{ბენინი}", q"{ბერმუდა}", q"{ბერმუდის კუნძულები}"
		, q"{ბოლივია}", q"{ბოსნია და ჰერცეგოვინა}"
		, q"{ბოტსვანა}", q"{ბრაზილია}", q"{ბრიტანეთის ვირჯინიის კუნძულები}"
		, q"{ბრიტანეთის ვირჯინის კუნძულები}", q"{ბრიტანეთის ინდოეთის ოკეანის ტერიტორია}"
		, q"{ბრუნეი}", q"{ბულგარეთი}", q"{ბურკინა ფასო}"
		, q"{ბურკინა-ფასო}", q"{ბურუნდი}", q"{ბჰუტანი}"
		, q"{გაბონი}", q"{გაერთიანებული სამეფო}"
		, q"{გაეროს}", q"{გაიანა}", q"{გამბია}", q"{განა}"
		, q"{გერმანია}", q"{გვადელუპა}", q"{გვატემალა}"
		, q"{გვინეა}", q"{გვინეა-ბისაუ}", q"{გიბრალტარი}"
		, q"{გრენადა}", q"{გრენლანდია}", q"{გუამი}"
		, q"{დამოკიდებული ტერ.}", q"{დამოკიდებული ტერიტორია}"
		, q"{დამოკიდებული}", q"{დანია}", q"{დასავლეთი აფრიკა}"
		, q"{დასავლეთი საჰარა}", q"{დიდი ბრიტანეთი}"
		, q"{დომინიკა}", q"{დომინიკელთა რესპუბლიკა}"
		, q"{ეგვიპტე}", q"{ევროკავშირის}", q"{ევროპასთან}"
		, q"{ევროპაშია}", q"{ევროპის ქვეყნები}"
		, q"{ეთიოპია}", q"{ეკვადორი}", q"{ეკვატორული გვინეა}"
		, q"{ეპარსეს კუნძული}", q"{ერაყი}", q"{ერიტრეა}"
		, q"{ესპანეთი}", q"{ესპანეთის სუვერენული ტერიტორიები}"
		, q"{ესტონეთი}", q"{ეშმორის და კარტიეს კუნძულები}"
		, q"{ვანუატუ}", q"{ვატიკანი}", q"{ვენესუელა}"
		, q"{ვიეტნამი}", q"{ზამბია}", q"{ზიმბაბვე}"
		, q"{თურქეთი}", q"{თურქმენეთი}", q"{იამაიკა}"
		, q"{იან მაიენი}", q"{იაპონია}", q"{იემენი}"
		, q"{ინდოეთი}", q"{ინდონეზია}", q"{იორდანია}"
		, q"{ირანი}", q"{ირლანდია}", q"{ისლანდია}"
		, q"{ისრაელი}", q"{იტალია}", q"{კაბო-ვერდე}"
		, q"{კაიმანის კუნძულები}", q"{კამბოჯა}"
		, q"{კამერუნი}", q"{კანადა}", q"{კანარის კუნძულები}"
		, q"{კარიბის ზღვის}", q"{კატარი}", q"{კენია}"
		, q"{კვიპროსი}", q"{კინგმენის რიფი}", q"{კირიბატი}"
		, q"{კლიპერტონი}", q"{კოლუმბია}", q"{კომორი}"
		, q"{კომორის კუნძულები}", q"{კონგოს დემოკრატიული რესპუბლიკა}"
		, q"{კონგოს რესპუბლიკა}", q"{კორეის რესპუბლიკა}"
		, q"{კოსტა-რიკა}", q"{კოტ-დ’ივუარი}", q"{კუბა}"
		, q"{კუკის კუნძულები}", q"{ლაოსი}", q"{ლატვია}"
		, q"{ლესოთო}", q"{ლიბანი}", q"{ლიბერია}", q"{ლიბია}"
		, q"{ლიტვა}", q"{ლიხტენშტაინი}", q"{ლუქსემბურგი}"
		, q"{მადაგასკარი}", q"{მადეირა}", q"{მავრიკი}"
		, q"{მავრიტანია}", q"{მაიოტა}", q"{მაკაო}"
		, q"{მაკედონია}", q"{მალავი}", q"{მალაიზია}"
		, q"{მალდივი}", q"{მალდივის კუნძულები}"
		, q"{მალი}", q"{მალტა}", q"{მაროკო}", q"{მარტინიკა}"
		, q"{მარშალის კუნძულები}", q"{მარჯნის ზღვის კუნძულები}"
		, q"{მელილია}", q"{მექსიკა}", q"{მიანმარი}"
		, q"{მიკრონეზია}", q"{მიკრონეზიის ფედერაციული შტატები}"
		, q"{მიმდებარე კუნძულები}", q"{მოზამბიკი}"
		, q"{მოლდოვა}", q"{მონაკო}", q"{მონსერატი}"
		, q"{მონღოლეთი}", q"{ნამიბია}", q"{ნაურუ}"
		, q"{ნაწილობრივ აფრიკაში}", q"{ნეპალი}"
		, q"{ნიგერი}", q"{ნიგერია}", q"{ნიდერლანდი}"
		, q"{ნიდერლანდის ანტილები}", q"{ნიკარაგუა}"
		, q"{ნიუე}", q"{ნორვეგია}", q"{ნორფოლკის კუნძული}"
		, q"{ოკეანეთის}", q"{ოკეანიას}", q"{ომანი}"
		, q"{პაკისტანი}", q"{პალაუ}", q"{პალესტინა}"
		, q"{პალმირა (ატოლი)}", q"{პანამა}", q"{პანტელერია}"
		, q"{პაპუა-ახალი გვინეა}", q"{პარაგვაი}"
		, q"{პერუ}", q"{პიტკერნის კუნძულები}"
		, q"{პოლონეთი}", q"{პორტუგალია}", q"{პრინც-ედუარდის კუნძული}"
		, q"{პუერტო-რიკო}", q"{რეუნიონი}", q"{როტუმა}"
		, q"{რუანდა}", q"{რუმინეთი}", q"{რუსეთი}", q"{საბერძნეთი}"
		, q"{სადავო ტერიტორიები}", q"{სალვადორი}"
		, q"{სამოა}", q"{სამხ. კორეა}", q"{სამხრეთ ამერიკაშია}"
		, q"{სამხრეთ ამერიკის}", q"{სამხრეთ აფრიკის რესპუბლიკა}"
		, q"{სამხრეთი აფრიკა}", q"{სამხრეთი გეორგია და სამხრეთ სენდვიჩის კუნძულები}"
		, q"{სამხრეთი სუდანი}", q"{სან-მარინო}"
		, q"{სან-ტომე და პრინსიპი}", q"{საუდის არაბეთი}"
		, q"{საფრანგეთი}", q"{საფრანგეთის გვიანა}"
		, q"{საფრანგეთის პოლინეზია}", q"{საქართველო}"
		, q"{საჰარის არაბთა დემოკრატიული რესპუბლიკა}", q"{სეიშელის კუნძულები}"
		, q"{სენ-ბართელმი}", q"{სენ-მარტენი}"
		, q"{სენ-პიერი და მიკელონი}", q"{სენეგალი}"
		, q"{სენტ-ვინსენტი და გრენადინები}", q"{სენტ-კიტსი და ნევისი}"
		, q"{სენტ-ლუსია}", q"{სერბეთი}", q"{სეუტა}"
		, q"{სვაზილენდი}", q"{სვალბარდი}", q"{სიერა-ლეონე}"
		, q"{სინგაპური}", q"{სირია}", q"{სლოვაკეთი}"
		, q"{სლოვენია}", q"{სოკოტრა}", q"{სოლომონის კუნძულები}"
		, q"{სომალი}", q"{სომალილენდი}", q"{სომხეთი}"
		, q"{სუდანი}", q"{სუვერენული სახელმწიფოები}"
		, q"{სურინამი}", q"{ტაივანი}", q"{ტაილანდი}"
		, q"{ტანზანია}", q"{ტაჯიკეთი}", q"{ტერიტორიები}"
		, q"{ტერქსისა და კაიკოსის კუნძულები}", q"{ტოგო}"
		, q"{ტოკელაუ}", q"{ტონგა}", q"{ტრანსკონტინენტური ქვეყანა}"
		, q"{ტრინიდადი და ტობაგო}", q"{ტუვალუ}"
		, q"{ტუნისი}", q"{უგანდა}", q"{უზბეკეთი}", q"{უკრაინა}"
		, q"{უნგრეთი}", q"{უოლისი და ფუტუნა}"
		, q"{ურუგვაი}", q"{ფარერის კუნძულები}"
		, q"{ფილიპინები}", q"{ფინეთი}", q"{ფიჯი}", q"{ფოლკლენდის კუნძულები}"
		, q"{ქვეყნები}", q"{ქოქოსის კუნძულები}"
		, q"{ქუვეითი}", q"{ღაზის სექტორი}", q"{ყაზახეთი}"
		, q"{ყირგიზეთი}", q"{შვედეთი}", q"{შვეიცარია}"
		, q"{შობის კუნძული}", q"{შრი-ლანკა}", q"{ჩადი}"
		, q"{ჩერნოგორია}", q"{ჩეჩნეთის რესპუბლიკა იჩქერია}"
		, q"{ჩეხეთი}", q"{ჩილე}", q"{ჩინეთი}", q"{ჩრდ. კორეა}"
		, q"{ჩრდილოეთ ამერიკის}", q"{ჩრდილოეთ მარიანას კუნძულები}"
		, q"{ჩრდილოეთი აფრიკა}", q"{ჩრდილოეთი კორეა}"
		, q"{ჩრდილოეთი მარიანას კუნძულები}", q"{ცენტრალური აფრიკა}"
		, q"{ცენტრალური აფრიკის რესპუბლიკა}", q"{წევრები}"
		, q"{წმინდა ელენე}", q"{წმინდა ელენეს კუნძული}"
		, q"{ხორვატია}", q"{ჯერსი}", q"{ჯიბუტი}", q"{ჰავაი}"
		, q"{ჰაიტი}", q"{ჰერდი და მაკდონალდის კუნძულები}"
		, q"{ჰონდურასი}", q"{ჰონკონგი}" ];

		return choice(strs, this.rnd);
	}

	override string locationDefaultCountry() {
		const string[] strs =
		[ q"{საქართველო}" ];

		return choice(strs, this.rnd);
	}

	override string locationPostcode() {
		const string[] strs =
		[ q"{01##}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationSecondaryAddress() {
		const string[] strs =
		[ q"{კორპ. ##}", q"{შენობა ###}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationStreetAddress() {
		const LocationStreetAddressEnum[] enums = [ LocationStreetAddressEnum.normal, LocationStreetAddressEnum.full ];
		return locationStreetAddress(choice(enums, this.rnd));
	}

	override string locationStreetAddress(LocationStreetAddressEnum which) {
		final switch(which) {
			case LocationStreetAddressEnum.normal: return locationStreet() ~ " " ~ locationBuildingNumber();
			case LocationStreetAddressEnum.full: return locationStreet() ~ " " ~ locationBuildingNumber() ~ " " ~ locationSecondaryAddress();
		}
		return "";
	}

	override string locationStreetName() {
		const string[] strs =
		[ q"{აბაშიძის}", q"{აბესაძის}", q"{აბულაძის}"
		, q"{აგლაძის}", q"{ადლერის}", q"{ავიაქიმიის}"
		, q"{ავლაბრის}", q"{ათარბეგოვის}", q"{ათონელის}"
		, q"{ალავერდოვის}", q"{ალექსიძის}", q"{ალილუევის}"
		, q"{ალმასიანის}", q"{ამაღლების}", q"{ამირეჯიბის}"
		, q"{ანაგის}", q"{ანდრონიკაშვილის}", q"{ანთელავას}"
		, q"{ანჯაფარიძის}", q"{არაგვის}", q"{არდონის}"
		, q"{არეშიძის}", q"{ასათიანის}", q"{ასკურავას}"
		, q"{ასლანიდის}", q"{ატენის}", q"{აფხაზი}"
		, q"{აღმაშენებლის}", q"{ახალშენის}", q"{ახვლედიანის}"
		, q"{ბააზოვის}", q"{ბაბისხევის}", q"{ბაბუშკინის}"
		, q"{ბაგრატიონის}", q"{ბალანჩივაძეების}"
		, q"{ბალანჩივაძის}", q"{ბალანჩინის}"
		, q"{ბალმაშევის}", q"{ბარამიძის}", q"{ბარნოვის}"
		, q"{ბაშალეიშვილის}", q"{ბევრეთის}", q"{ბელინსკის}"
		, q"{ბელოსტოკის}", q"{ბენაშვილის}", q"{ბეჟანიშვილის}"
		, q"{ბერიძის}", q"{ბოლქვაძის}", q"{ბოცვაძის}"
		, q"{ბოჭორიშვილის}", q"{ბოჭორიძის}", q"{ბუაჩიძის}"
		, q"{ბუდაპეშტის}", q"{ბურკიაშვილის}"
		, q"{ბურძგლას}", q"{გაბესკირიას}", q"{გაგარინის}"
		, q"{გაზაფხულის}", q"{გამრეკელის}", q"{გამსახურდიას}"
		, q"{გარეჯელის}", q"{გეგეჭკორის}", q"{გედაურის}"
		, q"{გელოვანი}", q"{გელოვანის}", q"{გერცენის}"
		, q"{გლდანის}", q"{გოგებაშვილის}", q"{გოგიბერიძის}"
		, q"{გოგოლის}", q"{გონაშვილის}", q"{გორგასლის}"
		, q"{გრანელის}", q"{გრიზოდუბოვას}", q"{გრინევიცკის}"
		, q"{გრომოვას}", q"{გრუზინსკის}", q"{გუდიაშვილის}"
		, q"{გულრიფშის}", q"{გულუას}", q"{გურამიშვილის}"
		, q"{გურგენიძის}", q"{დადიანის}", q"{დავითაშვილის}"
		, q"{დამაკავშირებელი}", q"{დარიალის}"
		, q"{დედოფლისწყაროს}", q"{დეპუტატის}"
		, q"{დიდგორის}", q"{დიდი}", q"{დიდუბის}", q"{დიუმას}"
		, q"{დიღმის}", q"{დიღომში}", q"{დოლიძის}", q"{დუნდუას}"
		, q"{დურმიშიძის}", q"{ელიავას}", q"{ენგელსის}"
		, q"{ენგურის}", q"{ეპისკოპოსის}", q"{ერისთავი}"
		, q"{ერისთავის}", q"{ვაზისუბნის}", q"{ვაკელის}"
		, q"{ვართაგავას}", q"{ვატუტინის}", q"{ვაჩნაძის}"
		, q"{ვაცეკის}", q"{ვეკუას}", q"{ვეშაპურის}"
		, q"{ვირსალაძის}", q"{ვოლოდარსკის}", q"{ვორონინის}"
		, q"{ზაარბრიუკენის}", q"{ზაზიაშვილის}"
		, q"{ზაზიშვილის}", q"{ზაკომოლდინის}"
		, q"{ზანდუკელის}", q"{ზაქარაიას}", q"{ზაქარიაძის}"
		, q"{ზახაროვის}", q"{ზაჰესის}", q"{ზნაურის}"
		, q"{ზურაბაშვილის}", q"{ზღვის}", q"{თაბუკაშვილის}"
		, q"{თავაძის}", q"{თავისუფლების}", q"{თამარაშვილის}"
		, q"{თაქთაქიშვილის}", q"{თბილელის}", q"{თელიას}"
		, q"{თორაძის}", q"{თოფურიძის}", q"{იალბუზის}"
		, q"{იამანიძის}", q"{იაშვილის}", q"{იბერიის}"
		, q"{იერუსალიმის}", q"{ივანიძის}", q"{ივერიელის}"
		, q"{იზაშვილის}", q"{ილურიძის}", q"{იმედაშვილის}"
		, q"{იმედაძის}", q"{იმედის}", q"{ინანიშვილის}"
		, q"{ინგოროყვას}", q"{ინდუსტრიალიზაციის}"
		, q"{ინჟინრის}", q"{ინწკირველის}", q"{ირბახის}"
		, q"{ირემაშვილის}", q"{ისაკაძის}", q"{ისპასჰანლის}"
		, q"{იტალიის}", q"{იუნკერთა}", q"{კათალიკოსის}"
		, q"{კაიროს}", q"{კაკაბაძის}", q"{კაკაბეთის}"
		, q"{კაკლიანის}", q"{კალანდაძის}", q"{კალიაევის}"
		, q"{კალინინის}", q"{კამალოვის}", q"{კამოს}"
		, q"{კაშენის}", q"{კახოვკის}", q"{კედიას}"
		, q"{კელაპტრიშვილის}", q"{კერესელიძის}"
		, q"{კეცხოველის}", q"{კიბალჩიჩის}", q"{კიკნაძის}"
		, q"{კიროვის}", q"{კობარეთის}", q"{კოლექტივიზაციის}"
		, q"{კოლმეურნეობის}", q"{კოლხეთის}", q"{კომკავშირის}"
		, q"{კომუნისტური}", q"{კონსტიტუციის}"
		, q"{კოოპერაციის}", q"{კოსტავას}", q"{კოტეტიშვილის}"
		, q"{კოჩეტკოვის}", q"{კოჯრის}", q"{კრონშტადტის}"
		, q"{კროპოტკინის}", q"{კრუპსკაიას}", q"{კუიბიშევის}"
		, q"{კურნატოვსკის}", q"{კურტანოვსკის}"
		, q"{კუტუზოვის}", q"{ლაღიძის}", q"{ლელაშვილის}"
		, q"{ლენინაშენის}", q"{ლენინგრადის}"
		, q"{ლენინის}", q"{ლენის}", q"{ლეონიძის}", q"{ლვოვის}"
		, q"{ლორთქიფანიძის}", q"{ლოტკინის}", q"{ლუბლიანის}"
		, q"{ლუბოვსკის}", q"{ლუნაჩარსკის}", q"{ლუქსემბურგის}"
		, q"{მაგნიტოგორსკის}", q"{მაზნიაშვილის}"
		, q"{მაისურაძის}", q"{მამარდაშვილის}"
		, q"{მამაცაშვილის}", q"{მანაგაძის}", q"{მანჯგალაძის}"
		, q"{მარის}", q"{მარუაშვილის}", q"{მარქსის}"
		, q"{მარჯანის}", q"{მატროსოვის}", q"{მაჭავარიანი}"
		, q"{მახალდიანის}", q"{მახარაძის}", q"{მებაღიშვილის}"
		, q"{მეგობრობის}", q"{მელაანის}", q"{მერკვილაძის}"
		, q"{მესხიას}", q"{მესხის}", q"{მეტეხის}", q"{მეტრეველი}"
		, q"{მეჩნიკოვის}", q"{მთავარანგელოზის}"
		, q"{მიასნიკოვის}", q"{მილორავას}", q"{მიმინოშვილის}"
		, q"{მიროტაძის}", q"{მიქატაძის}", q"{მიქელაძის}"
		, q"{მონტინის}", q"{მორეტის}", q"{მოსკოვის}"
		, q"{მრევლიშვილის}", q"{მუშკორის}", q"{მუჯირიშვილის}"
		, q"{მშვიდობის}", q"{მცხეთის}", q"{ნადირაძის}"
		, q"{ნაკაშიძის}", q"{ნარიმანოვის}", q"{ნასიძის}"
		, q"{ნაფარეულის}", q"{ნეკრასოვის}", q"{ნიაღვრის}"
		, q"{ნინიძის}", q"{ნიშნიანიძის}", q"{ობოლაძის}"
		, q"{ონიანის}", q"{ოჟიოს}", q"{ორახელაშვილის}"
		, q"{ორბელიანის}", q"{ორჯონიკიძის}", q"{ოქტომბრის}"
		, q"{ოცდაექვსი}", q"{პავლოვის}", q"{პარალელურის}"
		, q"{პარიზის}", q"{პეკინის}", q"{პეროვსკაიას}"
		, q"{პეტეფის}", q"{პიონერის}", q"{პირველი}"
		, q"{პისარევის}", q"{პლეხანოვის}", q"{პრავდის}"
		, q"{პროლეტარიატის}", q"{ჟელიაბოვის}"
		, q"{ჟვანიას}", q"{ჟორდანიას}", q"{ჟღენტი}"
		, q"{ჟღენტის}", q"{რადიანის}", q"{რამიშვილი}"
		, q"{რასკოვას}", q"{რენინგერის}", q"{რინგის}"
		, q"{რიჟინაშვილის}", q"{რობაქიძის}", q"{რობესპიერის}"
		, q"{რუსის}", q"{რუხაძის}", q"{რჩეულიშვილის}"
		, q"{სააკაძის}", q"{საბადურის}", q"{საბაშვილის}"
		, q"{საბურთალოს}", q"{საბჭოს}", q"{საგურამოს}"
		, q"{სამრეკლოს}", q"{სამღერეთის}", q"{სანაკოევის}"
		, q"{სარაჯიშვილის}", q"{საჯაიას}", q"{სევასტოპოლის}"
		, q"{სერგი}", q"{სვანიძის}", q"{სვერდლოვის}"
		, q"{სტახანოვის}", q"{სულთნიშნის}", q"{სურგულაძის}"
		, q"{სხირტლაძის}", q"{ტაბიძის}", q"{ტატიშვილის}"
		, q"{ტელმანის}", q"{ტერევერკოს}", q"{ტეტელაშვილის}"
		, q"{ტოვსტონოგოვის}", q"{ტოროშელიძის}"
		, q"{ტრაქტორის}", q"{ტრიკოტაჟის}", q"{ტურბინის}"
		, q"{უბილავას}", q"{უბინაშვილის}", q"{უზნაძის}"
		, q"{უკლებას}", q"{ულიანოვის}", q"{ურიდიას}"
		, q"{ფაბრიციუსის}", q"{ფაღავას}", q"{ფერისცვალების}"
		, q"{ფიგნერის}", q"{ფიზკულტურის}", q"{ფიოლეტოვის}"
		, q"{ფიფიების}", q"{ფოცხიშვილის}", q"{ქართველიშვილის}"
		, q"{ქართლელიშვილის}", q"{ქინქლაძის}"
		, q"{ქიქოძის}", q"{ქსოვრელის}", q"{ქუთათელაძის}"
		, q"{ქუთათელის}", q"{ქურდიანის}", q"{ღოღობერიძის}"
		, q"{ღუდუშაურის}", q"{ყავლაშვილის}", q"{ყაზბეგის}"
		, q"{ყარყარაშვილის}", q"{ყიფიანის}", q"{ყუშიტაშვილის}"
		, q"{შანიძის}", q"{შარტავას}", q"{შატილოვის}"
		, q"{შაუმიანის}", q"{შენგელაიას}", q"{შერვაშიძის}"
		, q"{შეროზიას}", q"{შირშოვის}", q"{შმიდტის}"
		, q"{შრომის}", q"{შუშინის}", q"{შჩორსის}", q"{ჩალაუბნის}"
		, q"{ჩანტლაძის}", q"{ჩაპაევის}", q"{ჩაჩავას}"
		, q"{ჩელუსკინელების}", q"{ჩერნიახოვსკის}"
		, q"{ჩერქეზიშვილი}", q"{ჩერქეზიშვილის}"
		, q"{ჩვიდმეტი}", q"{ჩიტაიას}", q"{ჩიტაძის}"
		, q"{ჩიქვანაიას}", q"{ჩიქობავას}", q"{ჩიხლაძის}"
		, q"{ჩოდრიშვილის}", q"{ჩოლოყაშვილის}"
		, q"{ჩუღურეთის}", q"{ცაბაძის}", q"{ცაგარელის}"
		, q"{ცეტკინის}", q"{ცინცაძის}", q"{ცისკარიშვილის}"
		, q"{ცურტაველის}", q"{ცქიტიშვილის}", q"{ცხაკაიას}"
		, q"{ძმობის}", q"{ძნელაძის}", q"{წერეთლის}"
		, q"{წითელი}", q"{წითელწყაროს}", q"{წინამძღვრიშვილის}"
		, q"{წულაძის}", q"{წულუკიძის}", q"{ჭაბუკიანის}"
		, q"{ჭავჭავაძის}", q"{ჭანტურიას}", q"{ჭოველიძის}"
		, q"{ჭონქაძის}", q"{ჭყონდიდელის}", q"{ხანძთელის}"
		, q"{ხვამლის}", q"{ხვინგიას}", q"{ხვიჩიას}"
		, q"{ხიმშიაშვილის}", q"{ხმელნიცკის}"
		, q"{ხორნაბუჯის}", q"{ხრამჰესის}", q"{ხუციშვილის}"
		, q"{ჯავახიშვილის}", q"{ჯაფარიძის}", q"{ჯიბლაძის}"
		, q"{ჯორჯიაშვილის}" ];

		return choice(strs, this.rnd);
	}

	override string locationStreetPattern() {
		final switch(uniform(0, 1, this.rnd)) {
			case 0: return locationStreetName() ~ " " ~ locationStreetSuffix();
		}
		return "";
	}

	override string locationStreetSuffix() {
		const string[] strs =
		[ q"{გამზ.}", q"{გამზირი}", q"{ქ.}", q"{ქუჩა}", q"{ჩიხი}"
		, q"{ხეივანი}" ];

		return choice(strs, this.rnd);
	}

	override string personFemalePrefix() {
		const string[] strs =
		[ q"{ქ-ნი}", q"{ქალბატონი}" ];

		return choice(strs, this.rnd);
	}

	override string personFirstName() {
		const string[] strs =
		[ q"{აგული}", q"{აგუნა}", q"{ადოლა}", q"{ავთანდილ}"
		, q"{ავთო}", q"{აკაკი}", q"{აკო}", q"{ალეკო}", q"{ალექსანდრე}"
		, q"{ალექსი}", q"{ალიო}", q"{ამირან}", q"{ანა}"
		, q"{ანანო}", q"{ანზორ}", q"{ანნა}", q"{ანუკა}"
		, q"{ანუკი}", q"{არჩილ}", q"{ასკილა}", q"{ასლანაზ}"
		, q"{აჩიკო}", q"{ბადრი}", q"{ბაია}", q"{ბარბარე}"
		, q"{ბაქარ}", q"{ბაჩა}", q"{ბაჩანა}", q"{ბაჭუა}"
		, q"{ბაჭუკი}", q"{ბახვა}", q"{ბელა}", q"{ბერა}"
		, q"{ბერდია}", q"{ბესიკ}", q"{ბესო}", q"{ბექა}"
		, q"{ბიძინა}", q"{ბიჭიკო}", q"{ბოჩია}", q"{ბოცო}"
		, q"{ბროლა}", q"{ბუბუ}", q"{ბუდუ}", q"{ბუხუტი}"
		, q"{გაგა}", q"{გაგი}", q"{გახა}", q"{გეგა}", q"{გეგი}"
		, q"{გედია}", q"{გელა}", q"{გენადი}", q"{გვადი}"
		, q"{გვანცა}", q"{გვანჯი}", q"{გვიტია}", q"{გვრიტა}"
		, q"{გია}", q"{გიგა}", q"{გიგი}", q"{გიგილო}", q"{გიგლა}"
		, q"{გიგოლი}", q"{გივი}", q"{გივიკო}", q"{გიორგი}"
		, q"{გოგი}", q"{გოგიტა}", q"{გოგიჩა}", q"{გოგოთურ}"
		, q"{გოგოლა}", q"{გოდერძი}", q"{გოლა}", q"{გოჩა}"
		, q"{გრიგოლ}", q"{გუგა}", q"{გუგუ}", q"{გუგულა}"
		, q"{გუგული}", q"{გუგუნა}", q"{გუკა}", q"{გულარისა}"
		, q"{გულვარდი}", q"{გულვარდისა}", q"{გულთამზე}"
		, q"{გულია}", q"{გულიკო}", q"{გულისა}", q"{გულნარა}"
		, q"{გურამ}", q"{დავით}", q"{დალი}", q"{დარეჯან}"
		, q"{დიანა}", q"{დიმიტრი}", q"{დოდო}", q"{დუტუ}"
		, q"{ეთერ}", q"{ეთო}", q"{ეკა}", q"{ეკატერინე}"
		, q"{ელგუჯა}", q"{ელენა}", q"{ელენე}", q"{ელზა}"
		, q"{ელიკო}", q"{ელისო}", q"{ემზარ}", q"{ეშხა}"
		, q"{ვალენტინა}", q"{ვალერი}", q"{ვანო}", q"{ვაჟა}"
		, q"{ვარდო}", q"{ვარსკვლავისა}", q"{ვასიკო}"
		, q"{ვასილ}", q"{ვატო}", q"{ვახო}", q"{ვახტანგ}"
		, q"{ვენერა}", q"{ვერა}", q"{ვერიკო}", q"{ზაზა}"
		, q"{ზაირა}", q"{ზაურ}", q"{ზეზვა}", q"{ზვიად}"
		, q"{ზინა}", q"{ზოია}", q"{ზუკა}", q"{ზურა}", q"{ზურაბ}"
		, q"{ზურია}", q"{ზურიკო}", q"{თაზო}", q"{თათა}"
		, q"{თათია}", q"{თათული}", q"{თაია}", q"{თაკო}"
		, q"{თალიკო}", q"{თამაზ}", q"{თამარ}", q"{თამარა}"
		, q"{თამთა}", q"{თამთიკე}", q"{თამი}", q"{თამილა}"
		, q"{თამრიკო}", q"{თამრო}", q"{თამუნა}", q"{თამჩო}"
		, q"{თანანა}", q"{თანდილა}", q"{თაყა}", q"{თეა}"
		, q"{თებრონე}", q"{თეიმურაზ}", q"{თემურ}", q"{თენგიზ}"
		, q"{თენგო}", q"{თეონა}", q"{თიკა}", q"{თიკო}", q"{თიკუნა}"
		, q"{თინა}", q"{თინათინ}", q"{თინიკო}", q"{თმაგიშერა}"
		, q"{თორნიკე}", q"{თუთა}", q"{თუთია}", q"{ია}", q"{იათამზე}"
		, q"{იამზე}", q"{ივანე}", q"{ივერი}", q"{ივქირიონ}"
		, q"{იზოლდა}", q"{ილია}", q"{ილიკო}", q"{იმედა}"
		, q"{ინგა}", q"{იოსებ}", q"{ირაკლი}", q"{ირინა}"
		, q"{ირინე}", q"{ირინკა}", q"{ირმა}", q"{იური}"
		, q"{კაკო}", q"{კალე}", q"{კატო}", q"{კახა}", q"{კახაბერ}"
		, q"{კეკელა}", q"{კესანე}", q"{კესო}", q"{კვირია}"
		, q"{კიტა}", q"{კობა}", q"{კოკა}", q"{კონსტანტინე}"
		, q"{კოსტა}", q"{კოტე}", q"{კუკური}", q"{ლადო}"
		, q"{ლალი}", q"{ლამაზა}", q"{ლამარა}", q"{ლამზირა}"
		, q"{ლაშა}", q"{ლევან}", q"{ლეილა}", q"{ლელა}", q"{ლენა}"
		, q"{ლერწამისა}", q"{ლექსო}", q"{ლია}", q"{ლიანა}"
		, q"{ლიზა}", q"{ლიზიკო}", q"{ლილე}", q"{ლილი}", q"{ლილიკო}"
		, q"{ლომია}", q"{ლუიზა}", q"{მაგული}", q"{მადონა}"
		, q"{მათიკო}", q"{მაია}", q"{მაიკო}", q"{მაისა}"
		, q"{მაკა}", q"{მაკო}", q"{მაკუნა}", q"{მალხაზ}"
		, q"{მამამზე}", q"{მამია}", q"{მამისა}", q"{მამისთვალი}"
		, q"{მამისიმედი}", q"{მამუკა}", q"{მამულა}"
		, q"{მანანა}", q"{მანჩო}", q"{მარადი}", q"{მარი}"
		, q"{მარია}", q"{მარიამი}", q"{მარიკა}", q"{მარინა}"
		, q"{მარინე}", q"{მარიტა}", q"{მაყვალა}", q"{მაშიკო}"
		, q"{მაშო}", q"{მაცაცო}", q"{მგელია}", q"{მგელიკა}"
		, q"{მედეა}", q"{მეკაშო}", q"{მელანო}", q"{მერაბ}"
		, q"{მერი}", q"{მეტია}", q"{მზაღო}", q"{მზევინარ}"
		, q"{მზეთამზე}", q"{მზეთვალა}", q"{მზეონა}"
		, q"{მზექალა}", q"{მზეხა}", q"{მზეხათუნი}"
		, q"{მზია}", q"{მზირა}", q"{მზისადარ}", q"{მზისთანადარი}"
		, q"{მზიულა}", q"{მთვარისა}", q"{მინდია}", q"{მიშა}"
		, q"{მიშიკო}", q"{მიხეილ}", q"{მნათობი}", q"{მნათობისა}"
		, q"{მოგელი}", q"{მონავარდისა}", q"{მურმან}"
		, q"{მუხრან}", q"{ნაზი}", q"{ნაზიკო}", q"{ნათელა}"
		, q"{ნათია}", q"{ნაირა}", q"{ნანა}", q"{ნანი}", q"{ნანიკო}"
		, q"{ნანუკა}", q"{ნანული}", q"{ნარგიზი}", q"{ნასყიდა}"
		, q"{ნატალია}", q"{ნატო}", q"{ნელი}", q"{ნენე}"
		, q"{ნესტან}", q"{ნია}", q"{ნიაკო}", q"{ნიკა}", q"{ნიკოლოზ}"
		, q"{ნინა}", q"{ნინაკა}", q"{ნინი}", q"{ნინიკო}"
		, q"{ნინო}", q"{ნინუკა}", q"{ნინუცა}", q"{ნოდარ}"
		, q"{ნოდო}", q"{ნონა}", q"{ნორა}", q"{ნუგზარ}", q"{ნუგო}"
		, q"{ნუკა}", q"{ნუკი}", q"{ნუკრი}", q"{ნუნუ}", q"{ნუნუკა}"
		, q"{ნუცა}", q"{ნუცი}", q"{ოთარ}", q"{ოთია}", q"{ოთო}"
		, q"{ომარ}", q"{ორბელ}", q"{ოტია}", q"{ოქროპირ}"
		, q"{პაატა}", q"{პაპუნა}", q"{პატარკაცი}", q"{პატარქალი}"
		, q"{პეპელა}", q"{პირვარდისა}", q"{პირიმზე}"
		, q"{ჟამიერა}", q"{ჟამიტა}", q"{ჟამუტა}", q"{ჟუჟუნა}"
		, q"{რამაზ}", q"{რევაზ}", q"{რეზი}", q"{რეზო}", q"{როზა}"
		, q"{რომან}", q"{რუსკა}", q"{რუსუდან}", q"{საბა}"
		, q"{სალი}", q"{სალომე}", q"{სანათა}", q"{სანდრო}"
		, q"{სერგო}", q"{სესია}", q"{სეხნია}", q"{სვეტლანა}"
		, q"{სიხარულა}", q"{სოსო}", q"{სოფიკო}", q"{სოფიო}"
		, q"{სოფო}", q"{სულა}", q"{სულიკო}", q"{ტარიელ}"
		, q"{ტასიკო}", q"{ტასო}", q"{ტატიანა}", q"{ტატო}"
		, q"{ტეტია}", q"{ტურია}", q"{უმანკო}", q"{უტა}"
		, q"{უჩა}", q"{ფაქიზო}", q"{ფაცია}", q"{ფეფელა}"
		, q"{ფეფენა}", q"{ფეფიკო}", q"{ფეფო}", q"{ფოსო}"
		, q"{ფოფო}", q"{ქაბატო}", q"{ქავთარი}", q"{ქალია}"
		, q"{ქართლოს}", q"{ქეთათო}", q"{ქეთევან}", q"{ქეთი}"
		, q"{ქეთინო}", q"{ქეთო}", q"{ქველი}", q"{ქიტესა}"
		, q"{ქიშვარდი}", q"{ქობული}", q"{ქრისტესია}"
		, q"{ქტისტეფორე}", q"{ქურციკა}", q"{ღარიბა}"
		, q"{ღვთისავარი}", q"{ღვთისია}", q"{ღვთისო}"
		, q"{ღვინია}", q"{ღუღუნა}", q"{ყაითამზა}", q"{ყაყიტა}"
		, q"{ყვარყვარე}", q"{ყიასა}", q"{შაბური}", q"{შაკო}"
		, q"{შალვა}", q"{შალიკო}", q"{შანშე}", q"{შარია}"
		, q"{შაქარა}", q"{შაქრო}", q"{შოთა}", q"{შორენა}"
		, q"{შოშია}", q"{შუქია}", q"{ჩიორა}", q"{ჩიტო}"
		, q"{ჩოყოლა}", q"{ცაგო}", q"{ცაგული}", q"{ცანგალა}"
		, q"{ცარო}", q"{ცაცა}", q"{ცაცო}", q"{ციალა}", q"{ციკო}"
		, q"{ცინარა}", q"{ცირა}", q"{ცისანა}", q"{ცისია}"
		, q"{ცისკარა}", q"{ცისკარი}", q"{ცისმარა}"
		, q"{ცისმარი}", q"{ციური}", q"{ციცი}", q"{ციცია}"
		, q"{ციცინო}", q"{ცოტნე}", q"{ცოქალა}", q"{ცუცა}"
		, q"{ცხვარი}", q"{ძაბული}", q"{ძამისა}", q"{ძაღინა}"
		, q"{ძიძია}", q"{წათე}", q"{წყალობა}", q"{ჭაბუკა}"
		, q"{ჭიაბერ}", q"{ჭიკჭიკა}", q"{ჭიჭია}", q"{ჭიჭიკო}"
		, q"{ჭოლა}", q"{ხათუნა}", q"{ხარება}", q"{ხატია}"
		, q"{ხახულა}", q"{ხახუტა}", q"{ხეჩუა}", q"{ხვიჩა}"
		, q"{ხიზანა}", q"{ხირხელა}", q"{ხობელასი}"
		, q"{ხოხია}", q"{ხოხიტა}", q"{ხუტა}", q"{ხუცია}"
		, q"{ჯაბა}", q"{ჯავახი}", q"{ჯარჯი}", q"{ჯემალ}"
		, q"{ჯონდო}", q"{ჯოტო}", q"{ჯუბი}", q"{ჯულიეტა}"
		, q"{ჯუმბერ}", q"{ჰამლეტ}" ];

		return choice(strs, this.rnd);
	}

	override string personLastName() {
		const string[] strs =
		[ q"{აბაზაძე}", q"{აბაშიძე}", q"{აბრამაშვილი}"
		, q"{აბუსერიძე}", q"{აბშილავა}", q"{ავაზნელი}"
		, q"{ავალიშვილი}", q"{ამილახვარი}", q"{ანთაძე}"
		, q"{ასლამაზიშვილი}", q"{ასპანიძე}", q"{აშკარელი}"
		, q"{ახალბედაშვილი}", q"{ახალკაცი}", q"{ახვლედიანი}"
		, q"{ბარათაშვილი}", q"{ბარდაველიძე}"
		, q"{ბახტაძე}", q"{ბედიანიძე}", q"{ბერიძე}"
		, q"{ბერუაშვილი}", q"{ბეჟანიშვილი}", q"{ბოგველიშვილი}"
		, q"{ბოტკოველი}", q"{გაბრიჩიძე}", q"{გაგნიძე}"
		, q"{გამრეკელი}", q"{გელაშვილი}", q"{გზირიშვილი}"
		, q"{გიგაური}", q"{გურამიშვილი}", q"{გურგენიძე}"
		, q"{დადიანი}", q"{დავითიშვილი}", q"{დათუაშვილი}"
		, q"{დარბაისელი}", q"{დეკანოიძე}", q"{დვალი}"
		, q"{დოლაბერიძე}", q"{ედიშერაშვილი}"
		, q"{ელიზბარაშვილი}", q"{ელიოზაშვილი}"
		, q"{ერისთავი}", q"{ვარამაშვილი}", q"{ვარდიაშვილი}"
		, q"{ვაჩნაძე}", q"{ვარდანიძე}", q"{ველიაშვილი}"
		, q"{ველიჯანაშვილი}", q"{ზარანდია}", q"{ზარიძე}"
		, q"{ზედგინიძე}", q"{ზუბიაშვილი}", q"{თაბაგარი}"
		, q"{თავდგირიძე}", q"{თათარაშვილი}", q"{თამაზაშვილი}"
		, q"{თამარაშვილი}", q"{თაქთაქიშვილი}"
		, q"{თაყაიშვილი}", q"{თბილელი}", q"{თუხარელი}"
		, q"{იაშვილი}", q"{იგითხანიშვილი}", q"{ინასარიძე}"
		, q"{იშხნელი}", q"{კანდელაკი}", q"{კაცია}"
		, q"{კერესელიძე}", q"{კვირიკაშვილი}"
		, q"{კიკნაძე}", q"{კლდიაშვილი}", q"{კოვზაძე}"
		, q"{კოპაძე}", q"{კოპტონაშვილი}", q"{კოშკელაშვილი}"
		, q"{ლაბაძე}", q"{ლეკიშვილი}", q"{ლიქოკელი}"
		, q"{ლოლაძე}", q"{ლურსმანაშვილი}", q"{მაისურაძე}"
		, q"{მარტოლეკი}", q"{მაღალაძე}", q"{მახარაშვილი}"
		, q"{მგალობლიშვილი}", q"{მეგრელიშვილი}"
		, q"{მელაშვილი}", q"{მელიქიძე}", q"{მერაბიშვილი}"
		, q"{მეფარიშვილი}", q"{მუჯირი}", q"{მჭედლიძე}"
		, q"{მხეიძე}", q"{ნათაძე}", q"{ნაჭყებია}", q"{ნოზაძე}"
		, q"{ოდიშვილი}", q"{ონოფრიშვილი}", q"{პარეხელაშვილი}"
		, q"{პეტრიაშვილი}", q"{სააკაძე}", q"{სააკაშვილი}"
		, q"{საგინაშვილი}", q"{სადუნიშვილი}"
		, q"{საძაგლიშვილი}", q"{სებისკვერიძე}"
		, q"{სეთური}", q"{სუთიაშვილი}", q"{სულაშვილი}"
		, q"{ტაბაღუა}", q"{ტყეშელაშვილი}", q"{ულუმბელაშვილი}"
		, q"{უნდილაძე}", q"{ქავთარაძე}", q"{ქართველიშვილი}"
		, q"{ყაზბეგი}", q"{ყაუხჩიშვილი}", q"{შავლაშვილი}"
		, q"{შალიკაშვილი}", q"{შონია}", q"{ჩიბუხაშვილი}"
		, q"{ჩიხრაძე}", q"{ჩიქოვანი}", q"{ჩუბინიძე}"
		, q"{ჩოლოყაშვილი}", q"{ჩოხელი}", q"{ჩხვიმიანი}"
		, q"{ცალუღელაშვილი}", q"{ცაძიკიძე}", q"{ციციშვილი}"
		, q"{ციხელაშვილი}", q"{ციხისთავი}", q"{ცხოვრებაძე}"
		, q"{ცხომარია}", q"{წამალაიძე}", q"{წერეთელი}"
		, q"{წიკლაური}", q"{წიფურია}", q"{ჭაბუკაშვილი}"
		, q"{ჭავჭავაძე}", q"{ჭანტურია}", q"{ჭარელიძე}"
		, q"{ჭიორელი}", q"{ჭუმბურიძე}", q"{ხაბაზი}"
		, q"{ხარაძე}", q"{ხარატიშვილი}", q"{ხარატასშვილი}"
		, q"{ხარისჭირაშვილი}", q"{ხარხელაური}"
		, q"{ხაშმელაშვილი}", q"{ხეთაგური}", q"{ხიზამბარელი}"
		, q"{ხიზანიშვილი}", q"{ხიმშიაშვილი}"
		, q"{ხოსრუაშვილი}", q"{ხოჯივანიშვილი}"
		, q"{ხუციშვილი}", q"{ჯაბადარი}", q"{ჯავახი}"
		, q"{ჯავახიშვილი}", q"{ჯანელიძე}", q"{ჯაფარიძე}"
		, q"{ჯაყელი}", q"{ჯაჯანიძე}", q"{ჯვარელია}"
		, q"{ჯინიუზაშვილი}", q"{ჯუღაშვილი}" ];

		return choice(strs, this.rnd);
	}

	override string personLastNamePattern() {
		const int rndInt = uniform(0, 1, this.rnd);

		if(rndInt >= 0 && rndInt < 1) {
			return personLastName();
		}

		return "";
	}

	override string personMalePrefix() {
		const string[] strs =
		[ q"{ბ-ნი}", q"{ბატონი}" ];

		return choice(strs, this.rnd);
	}

	override string personName() {
		const int rndInt = uniform(0, 10, this.rnd);

		if(rndInt >= 0 && rndInt < 1) {
			return personPrefix() ~ " " ~ personFirstName() ~ " " ~ personLastName();
		}
		if(rndInt >= 1 && rndInt < 10) {
			return personFirstName() ~ " " ~ personLastName();
		}

		return "";
	}

	override string personPrefix() {
		const string[] strs =
		[ q"{ბ-ნი}", q"{ბატონი}", q"{ქ-ნი}", q"{ქალბატონი}" ];

		return choice(strs, this.rnd);
	}

	override string personTitleDescriptor() {
		const string[] strs =
		[ q"{გენერალური}", q"{მთავარი}", q"{სტაჟიორ}"
		, q"{უმცროსი}", q"{ყოფილი}", q"{წამყვანი}" ];

		return choice(strs, this.rnd);
	}

	override string personTitleLevel() {
		const string[] strs =
		[ q"{აღრიცხვების}", q"{ბრენდინგის}", q"{ბრენიდს}"
		, q"{ბუღალტერიის}", q"{განყოფილების}"
		, q"{გაყიდვების}", q"{გუნდის}", q"{დახმარების}"
		, q"{დიზაინის}", q"{თავდაცვის}", q"{ინფორმაციის}"
		, q"{კვლევების}", q"{კომუნიკაციების}"
		, q"{მარკეტინგის}", q"{ოპერაციათა}", q"{ოპტიმიზაციების}"
		, q"{პიარ}", q"{პროგრამის}", q"{საქმეთა}", q"{ტაქტიკური}"
		, q"{უსაფრთხოების}", q"{ფინანსთა}", q"{ქსელის}"
		, q"{ხარისხის}", q"{ჯგუფის}" ];

		return choice(strs, this.rnd);
	}

	override string personTitleJob() {
		const string[] strs =
		[ q"{აგენტი}", q"{ადვოკატი}", q"{ადმინისტრატორი}"
		, q"{არქიტექტორი}", q"{ასისტენტი}", q"{აღმასრულებელი დირექტორი}"
		, q"{დეველოპერი}", q"{დეკანი}", q"{დიზაინერი}"
		, q"{დირექტორი}", q"{ელექტრიკოსი}", q"{ექსპერტი}"
		, q"{ინჟინერი}", q"{იურისტი}", q"{კონსტრუქტორი}"
		, q"{კონსულტანტი}", q"{კოორდინატორი}"
		, q"{ლექტორი}", q"{მასაჟისტი}", q"{მემანქანე}"
		, q"{მენეჯერი}", q"{მძღოლი}", q"{მწვრთნელი}"
		, q"{ოპერატორი}", q"{ოფიცერი}", q"{პედაგოგი}"
		, q"{პოლიციელი}", q"{პროგრამისტი}", q"{პროდიუსერი}"
		, q"{პრორექტორი}", q"{ჟურნალისტი}", q"{რექტორი}"
		, q"{სპეციალისტი}", q"{სტრატეგისტი}"
		, q"{ტექნიკოსი}", q"{ფოტოგრაფი}", q"{წარმომადგენელი}" ];

		return choice(strs, this.rnd);
	}

	override string phoneNumberFormats() {
		const string[] strs =
		[ q"{5##-###-###}", q"{5########}", q"{5## ## ## ##}", q"{5## ######}", q"{5## ### ###}", q"{995 5##-###-###}"
		, q"{995 5########}", q"{995 5## ## ## ##}", q"{995 5## ######}", q"{995 5## ### ###}"
		, q"{+995 5##-###-###}", q"{+995 5########}", q"{+995 5## ## ## ##}", q"{+995 5## ######}"
		, q"{+995 5## ### ###}", q"{(+995) 5##-###-###}", q"{(+995) 5########}", q"{(+995) 5## ## ## ##}"
		, q"{(+995) 5## ######}", q"{(+995) 5## ### ###}" ];

		return numberBuild(choice(strs, this.rnd));
	}

}
