module faked.faker_dv;

import std.algorithm : map, joiner;
import std.array;
import std.conv : to;
import std.exception : enforce;
import std.format;
import std.random;
import std.range : iota, take, repeat;
import std.string : toUpper;
import std.typecons : Nullable, nullable;

import faked.customtypes;
import faked.fakerenums;

import faked.faker_en;

class Faker_dv : Faker_en {
@safe:
	this(int seed) {
		super(seed);
	}

	override string cellPhoneFormats() {
		const string[] strs =
		[ q"{7######}", q"{9######}", q"{+9607######}", q"{+9609######}", q"{+960 7######}", q"{+960 9######}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string companyAdjective() {
		const string[] strs =
		[ q"{ބޮޑު}", q"{ކުޑަ}", q"{ހަޑި}", q"{ރީތި}", q"{ހޫނު}", q"{ފިނި}", q"{މަޖާ}"
		, q"{ފޫހި}", q"{ހުތުރު}", q"{އަލި}", q"{އަނދިރި}", q"{ހިރަފުސް}"
		, q"{ސާފު}", q"{މޮޅު}", q"{ދަށް}", q"{ހުށިޔާރު}", q"{ނުރައްކާ}"
		, q"{ސަމާލު}", q"{ގޮތްކުޑަ}", q"{ފުރިހަމަ}", q"{އެއްވަނަ}"
		, q"{ދެވަނަ}", q"{ތިންވަނަ}", q"{ނުފެންނަ}" ];

		return choice(strs, this.rnd);
	}

	override string companyNamePattern() {
		final switch(uniform(0, 5, this.rnd)) {
			case 0: return personFirstName() ~ " " ~ companySuffix();
			case 1: return personLastName() ~ " " ~ companySuffix();
			case 2: return personLastName() ~ " & " ~ personLastName() ~ " " ~ companyNoun() ~ " " ~ companySuffix();
			case 3: return companyAdjective() ~ " " ~ companyNoun() ~ " " ~ companySuffix();
			case 4: return companyAdjective() ~ " " ~ personLastName() ~ " " ~ personLastName() ~ " " ~ companySuffix();
		}
		return "";
	}

	override string companyNoun() {
		const string[] strs =
		[ q"{ވަޑައިންގެ}", q"{ހަރުގެ}", q"{ގުދަން}", q"{ގަރާޖު}", q"{ކޮންޓެއިނަރު}"
		, q"{ބޮއްކުރާ}", q"{ދޯނި}", q"{ބައްރެލި}", q"{މަނަވަރު}", q"{މަތިންދާބޯޓު}"
		, q"{ހެލިކޮޕްޓަރު}", q"{ރޮކެޓު}", q"{ކަރުދާސް}", q"{ފުޅި}"
		, q"{ބިއްލޫރި}", q"{ހޮޅުއަށި}", q"{ޕުލާސްޓިކު}", q"{ފޮތި}"
		, q"{ދަގަނޑު}", q"{ލަކުޑި}", q"{ގޮނޑު}", q"{ގޮނޑުދޮށް}", q"{ރުއް}"
		, q"{ގަސް}", q"{މޫ}", q"{ބުޅާ}", q"{ކަނބިލި}", q"{މާކަނާ}", q"{އިރުވާހުދު}"
		, q"{ރަތަފަ}", q"{މާރަނގަ}", q"{ހަރުފަ}", q"{މަކުނު}", q"{ކާޅު}"
		, q"{ކުކުޅު}", q"{މަސް}", q"{ގެރި}", q"{ބަކަރި}", q"{ފަރުމަސް}"
		, q"{ކަނޑުމަސް}", q"{ބޮޑުމަސް}", q"{ކުޑަމަސް}", q"{ގޯތި}"
		, q"{މޫދު}", q"{ކަނޑު}", q"{ވިލު}", q"{ފަޅު}", q"{ގިރި}", q"{ފެން}"
		, q"{ގަނޑުފެން}", q"{މުރަނގަ}", q"{ހިރުނދު}", q"{ދިއްގާ}"
		, q"{ނިކަ}", q"{މަގޫ}", q"{އަތަ}", q"{މޭވާ}", q"{ތަރުކާރި}" ];

		return choice(strs, this.rnd);
	}

	override string companySuffix() {
		const string[] strs =
		[ q"{ޕުރައިވެޓް ލިމިޓެޑް}", q"{.ޕވޓ. ލޓޑ}", q"{ޕަބްލިކް ލިމިޓެޑް}"
		, q"{.ޕބލކ. ލޓޑ}", q"{ގުރޫޕް}", q"{އޮފީސް}" ];

		return choice(strs, this.rnd);
	}

	override string dateMonthWide() {
		const string[] strs =
		[ q"{ޖަނަވަރީ}", q"{ފެބުރުވަރީ}", q"{މާރިޗު}", q"{އެޕްރީލް}"
		, q"{މޭ}", q"{ޖޫން}", q"{ޖުލައި}", q"{އޮގަސްޓު}", q"{ސެޕްޓެންބަރު}"
		, q"{އޮކްޓޫބަރު}", q"{ނޮވެންބަރެ}", q"{ޑިސެންބަރު}", q"{މުޙައްރަމް}"
		, q"{ޞަފަރު}", q"{ރަބީޢުލްއައްވަލް}", q"{ރަބީޢުލްއާޚިރު}"
		, q"{ޖުމާދަލްއޫލާ}", q"{ޖުމާދަލްއާޚިރު}", q"{ރަޖަބު}"
		, q"{ޝަޢުބާން}", q"{ރަމަޞާން}", q"{ޝައްވާލް}", q"{ޛުލްޤައިދާ}"
		, q"{ޛުލްޙިއްޖާ}" ];

		return choice(strs, this.rnd);
	}

	override string dateMonthAbbr() {
		const string[] strs =
		[ q"{ޖަނަވަރީ}", q"{ފެބުރުވަރީ}", q"{މާރިޗު}", q"{އެޕްރީލް}"
		, q"{މޭ}", q"{ޖޫން}", q"{ޖުލައި}", q"{އޮގަސްޓު}", q"{ސެޕްޓެންބަރު}"
		, q"{އޮކްޓޫބަރު}", q"{ނޮވެންބަރެ}", q"{ޑިސެންބަރު}", q"{މުޙައްރަމް}"
		, q"{ޞަފަރު}", q"{ރަބީޢުލްއައްވަލް}", q"{ރަބީޢުލްއާޚިރު}"
		, q"{ޖުމާދަލްއޫލާ}", q"{ޖުމާދަލްއާޚިރު}", q"{ރަޖަބު}"
		, q"{ޝަޢުބާން}", q"{ރަމަޞާން}", q"{ޝައްވާލް}", q"{ޛުލްޤައިދާ}"
		, q"{ޛުލްޙިއްޖާ}" ];

		return choice(strs, this.rnd);
	}

	override string dateWeekdayWide() {
		const string[] strs =
		[ q"{އާދީއްތަ}", q"{ހޯމަ}", q"{އަންގާރަ}", q"{ބުދަ}", q"{ބުރާސްފަތި}"
		, q"{ހުކުރު}", q"{ހޮނިހިރު}" ];

		return choice(strs, this.rnd);
	}

	override string dateWeekdayAbbr() {
		const string[] strs =
		[ q"{އާދީއްތަ}", q"{ހޯމަ}", q"{އަންގާރަ}", q"{ބުދަ}", q"{ބުރާސްފަތި}"
		, q"{ހުކުރު}", q"{ހޮނިހިރު}" ];

		return choice(strs, this.rnd);
	}

	override string locationCityName() {
		const string[] strs =
		[ q"{ރަސްގެ}", q"{ބުޅާ}", q"{ކާށި}", q"{ކުރުނބާ}", q"{މަޑި}", q"{ކޯވަިމަސް}"
		, q"{ބޮޑުމަސް}", q"{ކަނު}", q"{ބޮޑު}", q"{ވައި}", q"{އަލަނާސި}"
		, q"{އަނބު}", q"{ކަރާ}", q"{ބަށި}", q"{ޗިޗަންޑާ}", q"{ބޯށި}", q"{ތޮޅި}"
		, q"{ދޫނި}", q"{ކެކުރި}" ];

		return choice(strs, this.rnd);
	}

	override string locationCityPattern() {
		final switch(uniform(0, 6, this.rnd)) {
			case 0: return locationCityPrefix() ~ " " ~ companyNoun() ~ locationCitySuffix();
			case 1: return companyAdjective() ~ companyNoun() ~ locationCitySuffix();
			case 2: return locationCityPrefix() ~ " " ~ personFirstName();
			case 3: return personFirstName() ~ locationCitySuffix();
			case 4: return personLastName() ~ locationCitySuffix();
			case 5: return locationCityName();
		}
		return "";
	}

	override string locationCityPrefix() {
		const string[] strs =
		[ q"{އިރުމަތި}", q"{ހުޅަނގު}", q"{ދެކުނު}", q"{އުތުރު}", q"{ދެ}" ];

		return choice(strs, this.rnd);
	}

	override string locationCitySuffix() {
		const string[] strs =
		[ q"{ފުށި}", q"{ދޫ}", q"{ފަރު}", q"{ރަށް}", q"{ކޮޑި}" ];

		return choice(strs, this.rnd);
	}

	override string locationDefaultCountry() {
		const string[] strs =
		[ q"{ދިވެހިރާއްޖެ}" ];

		return choice(strs, this.rnd);
	}

	override string locationPostcode() {
		const string[] strs =
		[ q"{#####}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationStreetPattern() {
		final switch(uniform(0, 3, this.rnd)) {
			case 0: return personFirstName() ~ " " ~ locationStreetSuffix();
			case 1: return personLastName() ~ " " ~ locationStreetSuffix();
			case 2: return companyAdjective() ~ " " ~ companyNoun() ~ " " ~ locationStreetSuffix();
		}
		return "";
	}

	override string locationStreetSuffix() {
		const string[] strs =
		[ q"{ހިނގުން}", q"{މަގު}", q"{ގޯޅި}" ];

		return choice(strs, this.rnd);
	}

	override string loremWords() {
		const string[] strs =
		[ q"{ޓޫރިޒަމް}", q"{ދާއިރާ}", q"{ބޮޑު}", q"{އިންގިލާބެއް}"
		, q"{ގޮތުގައި}", q"{ތަރައްގީ}", q"{ކުރާ}", q"{ވިދާޅުވެއްޖެ}"
		, q"{އެއްގޮތަށް}", q"{ރިސޯޓުތަކާ}", q"{މުޅިން}", q"{ފެންވަރުގެ}"
		, q"{ކުންފުންޏާއި}", q"{ނާގޯށި}", q"{ޕަސެންޓެވެ}", q"{ޖޮއިންޓް}"
		, q"{ވެންޗާއެއްގެ}", q"{ފުރަތަމަ}", q"{މިލިއަން}", q"{ފަހުރުވެރިވާ}"
		, q"{އެހެނިހެން}", q"{ކަންކަން}", q"{ޖަލާލުއްދީން}", q"{ސިޓީ}"
		, q"{ޕްރިންސިޕަލް}", q"{ތަކެތި}", q"{ކުޑަކުދިންނަށް}"
		, q"{އަހައްމިޔަތު}", q"{މުސްތަގުބަލަށް}", q"{ވަސީލަތްތަކާއި}"
		, q"{ވެރިކަން}", q"{ގެއްލުންނުވާ}", q"{ފުރުސަތު}", q"{ކަންބޮޑުވުން}"
		, q"{އެންމެ}", q"{ތަންފުކެއް}", q"{އިމުގެ}", q"{މިކަންކުރަން}"
		, q"{ފޯޅަވަހީ}", q"{ބައުންޑަރީ}", q"{އިނގިރޭސިވިލާތް}" ];

		return choice(strs, this.rnd);
	}

	override string personFemaleFirstName() {
		const string[] strs =
		[ q"{ރަމްލާ}", q"{ހިންދު}", q"{ޙަފްޞާ}", q"{ޚަދީޖާ}", q"{ޒައިނަބު}"
		, q"{ޞަފިއްޔާ}", q"{ޢާއިޝާ}", q"{މައިމޫނާ}", q"{ޖުވައިރިއްޔާ}"
		, q"{ސައުދާ}", q"{މާރިޔާ}", q"{ރުޤައްޔާ}", q"{ފާޠިމާ}", q"{އުއްމުކުލްޘޫމޮ}"
		, q"{ޙައްވާ}", q"{ސާރާ}", q"{ހާޖަރު}", q"{މަރްޔަމޮ}", q"{ޒުލައިޚާ}"
		, q"{އާސިޔާ}", q"{ބަލްޤީސް}", q"{އާމިނަތު}", q"{އަސްމާއު}"
		, q"{އުމާމާ}", q"{ބަރްކާ}", q"{ޖަމީލާ}", q"{ޙަސްނާއު}", q"{ޙަލީމާ}"
		, q"{ޚަވްލާ}", q"{ޚައިރާ}", q"{ރުމައިޞާއު}", q"{ރުފައިދާ}"
		, q"{ރަޤީޤާ}", q"{ސަޢާދު}", q"{ސަލްމާ}", q"{ސުލައިމް}", q"{ސުމައްޔާ}"
		, q"{ޝަހީދާ}", q"{ޝިފާ}", q"{ޢާތިކާ}", q"{ޤައިލާ}", q"{ލަޔާލީ}"
		, q"{ކުލްޘޫމް}", q"{މުސްލިމާ}", q"{ނަސީބާ}", q"{ނަފީސާ}", q"{ނަވާރު}"
		, q"{ހާނީ}", q"{ހުނައިދާ}" ];

		return choice(strs, this.rnd);
	}

	string personFemaleLastName() {
		const string[] strs =
		[ q"{އިބާ}", q"{އަޘްމާރު}", q"{އަޘީލާ}", q"{އިރާދާ}", q"{އިރުތިޖާޢު}"
		, q"{އަރުވާ}", q"{އުމުނިއްޔާ}", q"{އަންބާ}", q"{އަންޖަލް}"
		, q"{އުމަރާ}", q"{ބަދުރިއްޔާ}", q"{ބަރުޒާ}", q"{ބަޝޫޝޤް}"
		, q"{ބަތްނާ}", q"{ބަޝާޝާ}", q"{ބާޛިލާ}", q"{ބަތޫލް}", q"{ބަރުޢުމް}"
		, q"{ބަޠްޙާއު}", q"{ބަހިއްޔު}", q"{ތާއްމާ}", q"{ތަބައްރުޢު}"
		, q"{ތަޙައްޝުމު}", q"{ތަޛްހީބު}", q"{ތަޒައްޔުން}", q"{ތަޣްރީދު}"
		, q"{ތިމްރާޙަތު}", q"{ޘަބްރާ}", q"{ޘަރާ}", q"{ޘުރައްޔާ}", q"{ޘަވާ}"
		, q"{ޘާނީ}", q"{ޖާސިމާ}", q"{ޖިދާ}", q"{ޖަސާރާ}", q"{ޖަލްވާ}", q"{ޖުމްލާނާ}"
		, q"{ޖުނައިނާ}", q"{ޖައިދާނާ}", q"{ޖުމާއު}", q"{ޙާރިސާ}", q"{ޙިބާއު}"
		, q"{ޙަބީބާ}", q"{ޙަދްވާ}", q"{ޙަޝްމާ}", q"{ޙަޞްނާ}", q"{ޙަމްރާއު}"
		, q"{ޙިންނާ}", q"{ޙަނާން}", q"{ޚާލިޞާ}", q"{ޚަދްރާ}", q"{ޚުލަސާ}"
		, q"{ޚަވްޟާ}", q"{ޚަވްލީ}", q"{ޚަވްދު}", q"{ދާއިޙާ}", q"{ދާޖިނާ}"
		, q"{ދައުމާއު}", q"{ދުއްރުން}", q"{ދަރްޤާ}", q"{ދަފީނާ}", q"{ދަލޫފް}"
		, q"{ދާނިޔާ}", q"{ޛާބިރާ}", q"{ޛަބާރާ}", q"{ޛަރާ}", q"{ޛިކްރާ}"
		, q"{ޛަމާމަތު}", q"{ރުއުޔާ}", q"{ރާބިޙާ}", q"{ރާސިޙާ}", q"{ރާފިޢާ}"
		, q"{ރާމާ}", q"{ރަބާބާ}", q"{ރަޖާ}", q"{ރަޙޫލް}", q"{ރައްސާމާ}"
		, q"{ރުޝްދިއްޔާ}", q"{ރަފާހިއްޔާ}", q"{ރުފައިދާ}", q"{ރައުޙިއްޔާ}"
		, q"{ރަވްނަޤް}", q"{ޒާޚިރާ}", q"{ޒާހް}", q"{ޒަބަރުޖަދް}", q"{ޒަޖާ}"
		, q"{ޒުރްޤުމް}", q"{ޒަރްނަޤާ}", q"{ޒުމުއްރުދާ}", q"{ޒާޚިޒުންބުޤާރާ}"
		, q"{ޒުންބުޤާ}", q"{ޒައިޒަފޫން}", q"{ޒިދުނީ}", q"{ރާޖިޔާ}"
		, q"{ރަޖާޙާ}", q"{ރިދާފާ}", q"{ރިޢާ}", q"{ރަކީނާ}", q"{ރުމައިޒާ}"
		, q"{ރަހީނާ}", q"{ޒާރާ}", q"{ޒުބައިދާ}", q"{ޒަރްކަޝާ}", q"{ޒަޢުފަރާނާ}"
		, q"{ސުއުދާ}", q"{ސާބިޤާ}", q"{ސާމިޤާ}", q"{ސުބުޙާތު}", q"{ސަޙަރު}"
		, q"{ސަޢުދިއްޔާ}", q"{ސަލްސަބީލް}", q"{ސުމައިޙާ}", q"{ސުންދުސް}"
		, q"{ސަނަމް}", q"{ޝާއިޤާ}", q"{ޝާރިޔާ}", q"{ޝަބާބު}", q"{ޝަޖިއްޔާ}"
		, q"{ޝަރްސާއު}", q"{ޝަރްޤިއްޔާ}", q"{ޝުޢާޢު}", q"{ޝަފްޝާފް}"
		, q"{ޝަލަބިއްޔާ}", q"{ޝަމަރުދަލް}", q"{ޝަމްސާ}", q"{ޝިންޝިނާ}"
		, q"{ޞާއިބާ}", q"{ޞާފީނާޒް}", q"{ޞަބިއްޔާ}", q"{ޞުބައިޙާ}"
		, q"{ޞިއްދީޤާ}", q"{ޞިންވާން}", q"{ޟާޙިޔާ}", q"{ޟާމިނަތު}"
		, q"{ޟުޙާ}", q"{ޟިފާފް}", q"{ޟިޔާ}", q"{ތާއިޢާ}", q"{ޠާހިރާ}", q"{ޠަރޫބު}"
		, q"{ޠުލްސާ}", q"{ޠުމޫޙާ}", q"{ޠައްޔިބާ}", q"{ޡާފިރާ}", q"{ޡަމްޔާ}"
		, q"{ޡުއްލާ}", q"{ޡަހީރާ}", q"{ޢާއިދާ}", q"{ޢާޖިލާ}", q"{ޢާޤިބާ}"
		, q"{ޢާލިޔާ}", q"{ޢަބީރު}", q"{ޢުތުބާ}", q"{ޢަދުލިއްޔާ}", q"{ޢަޛްރާ}"
		, q"{ޢަރޫޝާ}", q"{ޢައްޒާ}", q"{ޢަޠާޔާ}", q"{ޢަފާފާ}", q"{ޢަލާނިޔާ}"
		, q"{ޢަންނާބު}", q"{ޢަންބަރާ}", q"{ޢަންދަލީބު}", q"{ޢަލާނާ}"
		, q"{ޣާދާ}", q"{ޣާނީ}", q"{ޣާޔާ}", q"{ޣިނާ}", q"{ޣީދު}", q"{ޣީރާ}", q"{ފާއިޒާ}"
		, q"{ފާރީހާން}", q"{ފަތުޙިއްޔާ}", q"{ފަރާއިދު}", q"{ފިރްޔާލް}"
		, q"{ފުރައިސާ}", q"{ފިޠްރިއްޔާ}", q"{ފުނޫން}", q"{ފުހައިދާ}"
		, q"{ފައްވާޙާ}", q"{ފައުޤިއްޔާ}", q"{ފައިނާން}", q"{ޤާނިތު}"
		, q"{ޤަބްސާ}", q"{ޤުޘަމް}", q"{ޤުދުވާ}", q"{ޤިޠާފް}", q"{ޤުމްރިއްޔާ}"
		, q"{ޤަމީން}", q"{ކާއިނާ}", q"{ކާސިބާ}", q"{ކާޙިލާ}", q"{ކާފިޔާ}"
		, q"{ކަބީރާ}", q"{ކަރާއިމް}", q"{ކުރައިމާން}", q"{ކިފާޔާ}"
		, q"{ކުލްޘޫމް}", q"{ކިނާނާ}", q"{ކަންޒު}", q"{ލުއުލުއު}", q"{ލުބާބާ}"
		, q"{ލުއްޖާ}", q"{ލަސަން}", q"{ލުބާ}", q"{ލިޔާނާ}", q"{މުއުމިނާ}"
		, q"{މުއުނިސާ}", q"{މާހާ}", q"{މާހީ}", q"{މާސާ}", q"{މާޝީ}", q"{މާވީ}"
		, q"{މަދާ}", q"{މަރްހޫބާ}", q"{މުސްކާ}", q"{މަލަދު}", q"{މުނާ}"
		, q"{މީފާ}", q"{ނާއިފާ}", q"{ނާލާ}", q"{ނާހީ}", q"{ނާވީ}", q"{ނުބްހާ}"
		, q"{ނަޖާ}", q"{ނަޖްމާ}", q"{ނުޚްބާ}", q"{ނަރްޖިސް}", q"{ނޫރުލްހުދާ}"
		, q"{ވާޙާ}", q"{ވިޖްދާން}", q"{ވުސްޢާ}", q"{ވަޝީކު}", q"{ވަޞްފާ}"
		, q"{ވަހިއްޔާ}", q"{ހާދިއާ}", q"{ހާނީ}", q"{ހިބާ}", q"{ހުދާ}", q"{ހަނާ}"
		, q"{ހިންދާމް}", q"{ހޫނާ}", q"{ހައިނަމާ}", q"{ޔާސިރާ}", q"{ޔާޤޫތު}"
		, q"{ޔަޤްޡާ}", q"{ޔަމްނާ}", q"{ޔަޝްމް}" ];

		return choice(strs, this.rnd);
	}

	override string personFemalePrefix() {
		const string[] strs =
		[ q"{އަމީރު}", q"{އަމީރާ}", q"{ބަނޑޭރި}", q"{ބޮޑު}" ];

		return choice(strs, this.rnd);
	}

	override string personFirstName() {
		const string[] strs =
		[ q"{ހާނީ}", q"{ހާޖަރު}", q"{ހިންދު}", q"{ހުނައިދާ}", q"{ނަވާރު}"
		, q"{ނަފީސާ}", q"{ނަސީބާ}", q"{ރަމްލާ}", q"{ރަޤީޤާ}", q"{ރުމައިޞާއު}"
		, q"{ރުފައިދާ}", q"{ރުޤައްޔާ}", q"{ބަރްކާ}", q"{ބަލްޤީސް}"
		, q"{ކުލްޘޫމް}", q"{އަބޫބަކްރު}", q"{އަލީ}", q"{އަސްމާއު}"
		, q"{އާމިނަތު}", q"{އާދަމް}", q"{އާސިޔާ}", q"{އިބްރާހީމް}"
		, q"{އިލްޔާސް}", q"{އިސްމާޢީލް}", q"{އުއްމުކުލްޘޫމޮ}"
		, q"{އުމާމާ}", q"{އުސާމާ}", q"{މަރްޔަމޮ}", q"{މައިމޫނާ}", q"{މާރިޔާ}"
		, q"{މުސްލިމާ}", q"{މުޙައްމަދު}", q"{މޫސާ}", q"{ފާޠިމާ}", q"{ދާއޫދު}"
		, q"{ލަޔާލީ}", q"{ސައުދާ}", q"{ސަލްމާ}", q"{ސަޢާދު}", q"{ސާރާ}"
		, q"{ސުމައްޔާ}", q"{ސުލައިމް}", q"{ޒައިނަބު}", q"{ޒުލައިޚާ}"
		, q"{ޔޫސުފް}", q"{ޖަމީލާ}", q"{ޖުވައިރިއްޔާ}", q"{ޙައްވާ}"
		, q"{ޙަފްޞާ}", q"{ޙަލީމާ}", q"{ޙަސްނާއު}", q"{ޚައިރާ}", q"{ޚަވްލާ}"
		, q"{ޚަދީޖާ}", q"{ޝަހީދާ}", q"{ޝިފާ}", q"{ޞަފިއްޔާ}", q"{ޢަޠާ}"
		, q"{ޢާއިޝާ}", q"{ޢާތިކާ}", q"{ޢީސާ}", q"{ޤައިލާ}", q"{ޤުދާސް}" ];

		return choice(strs, this.rnd);
	}

	override string personLastName() {
		const string[] strs =
		[ q"{ހަނާ}", q"{ހައިނަމާ}", q"{ހައްފާފް}", q"{ހާނީ}", q"{ހާދިއާ}"
		, q"{ހާދީ}", q"{ހިންދާމް}", q"{ހިންދިސް}", q"{ހިބާ}", q"{ހިދާޔަތް}"
		, q"{ހުދާ}", q"{ހުޛުލޫލް}", q"{ހޫނާ}", q"{ނަރްޖިސް}", q"{ނައްބާރު}"
		, q"{ނަޖާ}", q"{ނަޖްމާ}", q"{ނާހީ}", q"{ނާއިފާ}", q"{ނާވީ}", q"{ނާލާ}"
		, q"{ނުހައިލް}", q"{ނުބްހާ}", q"{ނުސައިބު}", q"{ނުޖުދު}", q"{ނުޚްބާ}"
		, q"{ނުޢައިމް}", q"{ނޫރުލްހުދާ}", q"{ރަހީނާ}", q"{ރަބާބާ}"
		, q"{ރަކީނާ}", q"{ރައުބު}", q"{ރައުޙިއްޔާ}", q"{ރައްސާމާ}"
		, q"{ރަވްނަޤް}", q"{ރަފާހިއްޔާ}", q"{ރަޖާ}", q"{ރަޖާޙާ}", q"{ރަޙޫމް}"
		, q"{ރަޙޫލް}", q"{ރާބިޙާ}", q"{ރާބިޙް}", q"{ރާމާ}", q"{ރާފިޢާ}"
		, q"{ރާސިޙާ}", q"{ރާޖިޔާ}", q"{ރިދާފާ}", q"{ރިޢާ}", q"{ރުއުޔާ}"
		, q"{ރުމައިޒާ}", q"{ރުފައިދާ}", q"{ރުޝްދިއްޔާ}", q"{ރޫދު}"
		, q"{ބަހިއްޔު}", q"{ބަރުޒާ}", q"{ބަރުޢުމް}", q"{ބަދުރިއްޔާ}"
		, q"{ބަތޫލް}", q"{ބަތްނާ}", q"{ބަޝާޝާ}", q"{ބަޝޫޝޤް}", q"{ބަޝޫޝް}"
		, q"{ބަޠްޙާއު}", q"{ބާޛިލާ}", q"{ބާޤީ}", q"{ބުހްލޫލް}", q"{ބުރްހާން}"
		, q"{ކަންޒު}", q"{ކަރާއިމް}", q"{ކަބީރާ}", q"{ކައިސޫމް}", q"{ކައުޘަރު}"
		, q"{ކަލަޖް}", q"{ކާއިނާ}", q"{ކާފިޔާ}", q"{ކާސިބާ}", q"{ކާޙިލާ}"
		, q"{ކިނާނާ}", q"{ކިފާޔާ}", q"{ކުރައިމާން}", q"{ކުލްޘޫމް}"
		, q"{އަންބާ}", q"{އަންޖަލް}", q"{އަރުވާ}", q"{އަކްޙަލް}", q"{އަޘީލާ}"
		, q"{އަޘްހަރު}", q"{އަޘްމާރު}", q"{އިރާދާ}", q"{އިރުތިޖާޢު}"
		, q"{އިބާ}", q"{އުމަރާ}", q"{އުމުނިއްޔާ}", q"{ވަހިއްޔާ}", q"{ވަހްބު}"
		, q"{ވައްޟާޙް}", q"{ވަދީސް}", q"{ވަޝީކު}", q"{ވަޞްފާ}", q"{ވާބިޞް}"
		, q"{ވާފިރު}", q"{ވާޙާ}", q"{ވިޖްދާން}", q"{ވުސްޢާ}", q"{މަރްހޫބާ}"
		, q"{މަބްޞަރު}", q"{މައާބު}", q"{މައުރަބު}", q"{މައުމަލް}"
		, q"{މަދާ}", q"{މަލަދު}", q"{މާހާ}", q"{މާހީ}", q"{މާވީ}", q"{މާސާ}"
		, q"{މާޝީ}", q"{މީފާ}", q"{މުނާ}", q"{މުއުނިސާ}", q"{މުއުމިނާ}"
		, q"{މުދުރިކަތު}", q"{މުތަނާސިޤް}", q"{މުސްކާ}", q"{ފަހުމާން}"
		, q"{ފަރާއިދު}", q"{ފައިނާން}", q"{ފައިލަޤު}", q"{ފައުޤިއްޔާ}"
		, q"{ފައްވާޙާ}", q"{ފަތުޙިއްޔާ}", q"{ފަތޫޙް}", q"{ފާރީހާން}"
		, q"{ފާއިޒާ}", q"{ފާއިޤު}", q"{ފިރްޔާލް}", q"{ފިޠްރިއްޔާ}"
		, q"{ފުހައިދާ}", q"{ފުނޫން}", q"{ފުރައިސާ}", q"{ދަރްޤާ}", q"{ދައުމާއު}"
		, q"{ދައްރާކު}", q"{ދަފީނާ}", q"{ދަލޫފް}", q"{ދާނިޔާ}", q"{ދާރިބު}"
		, q"{ދާއިޙާ}", q"{ދާޖިނާ}", q"{ދިރްފިސް}", q"{ދީވާން}", q"{ދުއްރުން}"
		, q"{ތަރަފް}", q"{ތަބައްރުޢު}", q"{ތައްމާމް}", q"{ތަޒައްޔުން}"
		, q"{ތަޙައްޝުމު}", q"{ތަޛްހީބު}", q"{ތަޣްރީދު}", q"{ތާއިޢާ}"
		, q"{ތާއްމާ}", q"{ތިމްރާޙަތު}", q"{ތުކްލާން}", q"{ލަބިޤު}"
		, q"{ލަސަން}", q"{ލިޔާނާ}", q"{ލުބަދު}", q"{ލުބާ}", q"{ލުބާބާ}"
		, q"{ލުއުލުއު}", q"{ލުއްޖާ}", q"{ލުޠުފީ}", q"{ލުޤުމާން}", q"{ސަނަމް}"
		, q"{ސަރުމަދު}", q"{ސަލްސަބީލް}", q"{ސަޙަރު}", q"{ސަޢުދިއްޔާ}"
		, q"{ސާބިޤާ}", q"{ސާމިޤާ}", q"{ސާޖީ}", q"{ސާޤީ}", q"{ސިބުޠު}", q"{ސުންދުސް}"
		, q"{ސުބުޙާތު}", q"{ސުއުދާ}", q"{ސުމައިޙާ}", q"{ޒަރްނަޤާ}"
		, q"{ޒަރްކަޝާ}", q"{ޒަބަރުޖަދް}", q"{ޒައިޒަފޫން}", q"{ޒަޖާ}"
		, q"{ޒަޢުފަރާނާ}", q"{ޒާހް}", q"{ޒާރާ}", q"{ޒާޚިރާ}", q"{ޒާޚިޒުންބުޤާރާ}"
		, q"{ޒިރުޔާބު}", q"{ޒިބްރިޖު}", q"{ޒިދުނީ}", q"{ޒުންބުޤާ}"
		, q"{ޒުރްޤުމް}", q"{ޒުބައިދާ}", q"{ޒުމުއްރުދާ}", q"{ޒޯފިޝާން}"
		, q"{ޔަމްނާ}", q"{ޔަލްމަޢި}", q"{ޔަގްޡާން}", q"{ޔަޝްމް}", q"{ޔަޤްޡާ}"
		, q"{ޔާސިރާ}", q"{ޔާޤޫތު}", q"{ޔޫޝަޢު}", q"{ޖައިދާނާ}", q"{ޖަލްވާ}"
		, q"{ޖަސާރާ}", q"{ޖަޛަލް}", q"{ޖާބިރު}", q"{ޖާސިމާ}", q"{ޖާސިމް}"
		, q"{ޖިދާ}", q"{ޖުނައިނާ}", q"{ޖުންދު}", q"{ޖުމާއު}", q"{ޖުމްލާނާ}"
		, q"{ޖުސުމް}", q"{ޘަރާ}", q"{ޘަރިއްޔު}", q"{ޘަބްރާ}", q"{ޘަވާ}"
		, q"{ޘަވިއްޔު}", q"{ޘާނީ}", q"{ޘާޣިމް}", q"{ޘުރައްޔާ}", q"{ޙަނާން}"
		, q"{ޙަބީބާ}", q"{ޙަބީބު}", q"{ޙަމްރާއު}", q"{ޙަދްވާ}", q"{ޙަޘީޘް}"
		, q"{ޙަޝްމާ}", q"{ޙަޞްނާ}", q"{ޙާރިސާ}", q"{ޙާބިސް}", q"{ޙާފިދު}"
		, q"{ޙިންނާ}", q"{ޙިބާއު}", q"{ޙުސްނީ}", q"{ޚައިރީ}", q"{ޚަވްދު}"
		, q"{ޚަވްލީ}", q"{ޚަވްޟާ}", q"{ޚަދްރާ}", q"{ޚާބިސް}", q"{ޚާފިޤާނި}"
		, q"{ޚާލިޞާ}", q"{ޚިތާމް}", q"{ޚުލަސާ}", q"{ޛަހަބު}", q"{ޛަރާ}"
		, q"{ޛަބާރާ}", q"{ޛަކީ}", q"{ޛަމާމަތު}", q"{ޛާބިރާ}", q"{ޛިކްރާ}"
		, q"{ޛުއްނޫރު}", q"{ޝަރްސާއު}", q"{ޝަރްޤިއްޔާ}", q"{ޝަބާބު}"
		, q"{ޝަމަރުދަލް}", q"{ޝަމްސާ}", q"{ޝަފްޝާފް}", q"{ޝަލަބިއްޔާ}"
		, q"{ޝަލޫލް}", q"{ޝަޖިއްޔާ}", q"{ޝާރިޔާ}", q"{ޝާއިޤާ}", q"{ޝާމިސް}"
		, q"{ޝިންޝިނާ}", q"{ޝުބޫލް}", q"{ޝުޢާޢު}", q"{ޞަބިއްޔާ}", q"{ޞަބޫރު}"
		, q"{ޞަފިއްޔު}", q"{ޞަދޫޙު}", q"{ޞާއިބާ}", q"{ޞާފީނާޒް}", q"{ޞިންވާން}"
		, q"{ޞިއްދީޤާ}", q"{ޞުރޫޙު}", q"{ޞުބައިޙާ}", q"{ޟާމިނަތު}"
		, q"{ޟާޙިޔާ}", q"{ޟިފާފް}", q"{ޟިޔާ}", q"{ޟުޙާ}", q"{ޠަރޫބު}", q"{ޠައްޔިބާ}"
		, q"{ޠާހިރާ}", q"{ޠާލިބު}", q"{ޠާޙީ}", q"{ޠިބާބު}", q"{ޠުމޫޙާ}"
		, q"{ޠުލްސާ}", q"{ޡަހީރާ}", q"{ޡަމްޔާ}", q"{ޡަފަރު}", q"{ޡާފިރާ}"
		, q"{ޡިލާލް}", q"{ޡުހޫރު}", q"{ޡުއްލާ}", q"{ޢަންނާބު}", q"{ޢަންބަރާ}"
		, q"{ޢަންބަރު}", q"{ޢަންދަލީބު}", q"{ޢަރޫޝާ}", q"{ޢަބީރު}"
		, q"{ޢަބްޤަރީ}", q"{ޢައްމާރު}", q"{ޢައްޒާ}", q"{ޢަފާފާ}", q"{ޢަދުލިއްޔާ}"
		, q"{ޢަލާނާ}", q"{ޢަލާނިޔާ}", q"{ޢަޛްރާ}", q"{ޢަޠާޔާ}", q"{ޢާބިދީން}"
		, q"{ޢާއިދާ}", q"{ޢާލިޔާ}", q"{ޢާޖިލާ}", q"{ޢާޤިބާ}", q"{ޢިއްޒަތު}"
		, q"{ޢުތުބާ}", q"{ޣަންދޫރު}", q"{ޣައްރާފް}", q"{ޣައްސާން}"
		, q"{ޣަޔްދަން}", q"{ޣާނީ}", q"{ޣާދާ}", q"{ޣާދިފު}", q"{ޣާޔާ}", q"{ޣިނާ}"
		, q"{ޣީރާ}", q"{ޣީދު}", q"{ޣުމޫމް}", q"{ޤަބްސާ}", q"{ޤަވާމް}", q"{ޤަމީން}"
		, q"{ޤާނިތު}", q"{ޤާބޫސް}", q"{ޤިންދީލް}", q"{ޤިންޠާރް}", q"{ޤިޠާފް}"
		, q"{ޤުމްރިއްޔާ}", q"{ޤުދުވާ}", q"{ޤުޘަމް}" ];

		return choice(strs, this.rnd);
	}

	override string personMaleFirstName() {
		const string[] strs =
		[ q"{އާދަމް}", q"{އިބްރާހީމް}", q"{އިލްޔާސް}", q"{އިސްމާޢީލް}"
		, q"{ޢީސާ}", q"{އަބޫބަކްރު}", q"{އަލީ}", q"{އުސާމާ}", q"{ދާއޫދު}"
		, q"{ޢަޠާ}", q"{ޤުދާސް}", q"{މުޙައްމަދު}", q"{މޫސާ}", q"{ޔޫސުފް}" ];

		return choice(strs, this.rnd);
	}

	string personMaleLastName() {
		const string[] strs =
		[ q"{އަކްޙަލް}", q"{އަޘްހަރު}", q"{ބުރްހާން}", q"{ބާޤީ}", q"{ބުހްލޫލް}"
		, q"{ބަޝޫޝް}", q"{ތަރަފް}", q"{ތައްމާމް}", q"{ތުކްލާން}", q"{ޘަވިއްޔު}"
		, q"{ޘާޣިމް}", q"{ޘަރިއްޔު}", q"{ޖާބިރު}", q"{ޖާސިމް}", q"{ޖަޛަލް}"
		, q"{ޖުސުމް}", q"{ޖުންދު}", q"{ޙާބިސް}", q"{ޙާފިދު}", q"{ޙަބީބު}"
		, q"{ޙަޘީޘް}", q"{ޙުސްނީ}", q"{ޚާބިސް}", q"{ޚާފިޤާނި}", q"{ޚިތާމް}"
		, q"{ޚައިރީ}", q"{ދާރިބު}", q"{ދައްރާކު}", q"{ދިރްފިސް}", q"{ދީވާން}"
		, q"{ޛަހަބު}", q"{ޛުއްނޫރު}", q"{ޛަކީ}", q"{ރާބިޙް}", q"{ރައުބު}"
		, q"{ރަޙޫމް}", q"{ރޫދު}", q"{ޒިބްރިޖު}", q"{ޒިރުޔާބު}", q"{ޒޯފިޝާން}"
		, q"{ސާޤީ}", q"{ސިބުޠު}", q"{ސަރުމަދު}", q"{ސާޖީ}", q"{ޝާމިސް}"
		, q"{ޝަބާބު}", q"{ޝުބޫލް}", q"{ޝަފްޝާފް}", q"{ޝަލޫލް}", q"{ޞަބޫރު}"
		, q"{ޞަދޫޙު}", q"{ޞަފިއްޔު}", q"{ޞުރޫޙު}", q"{ޠާޙީ}", q"{ޠާލިބު}"
		, q"{ޠިބާބު}", q"{ޡަފަރު}", q"{ޡިލާލް}", q"{ޡުހޫރު}", q"{ޢާބިދީން}"
		, q"{ޢަބްޤަރީ}", q"{ޢިއްޒަތު}", q"{ޢައްމާރު}", q"{ޢަންބަރު}"
		, q"{ޢަންދަލީބު}", q"{ޣާދިފު}", q"{ޣައްރާފް}", q"{ޣައްސާން}"
		, q"{ޣުމޫމް}", q"{ޣަންދޫރު}", q"{ޣަޔްދަން}", q"{ފާއިޤު}", q"{ފަތޫޙް}"
		, q"{ފަހުމާން}", q"{ފައިލަޤު}", q"{ޤާބޫސް}", q"{ޤިންދީލް}"
		, q"{ޤިންޠާރް}", q"{ޤަވާމް}", q"{ކަލަޖް}", q"{ކައުޘަރު}", q"{ކައިސޫމް}"
		, q"{ލުބަދު}", q"{ލަބިޤު}", q"{ލަސަން}", q"{ލުޠުފީ}", q"{ލުޤުމާން}"
		, q"{މައުރަބު}", q"{މައުމަލް}", q"{މައާބު}", q"{މަބްޞަރު}"
		, q"{މުތަނާސިޤް}", q"{މުދުރިކަތު}", q"{ނުޖުދު}", q"{ނުސައިބު}"
		, q"{ނުޢައިމް}", q"{ނައްބާރު}", q"{ނުހައިލް}", q"{ވާބިޞް}"
		, q"{ވަދީސް}", q"{ވާފިރު}", q"{ވައްޟާޙް}", q"{ވަހްބު}", q"{ހާދީ}"
		, q"{ހިދާޔަތް}", q"{ހުޛުލޫލް}", q"{ހައްފާފް}", q"{ހިންދިސް}"
		, q"{ޔާޤޫތު}", q"{ޔަލްމަޢި}", q"{ޔޫޝަޢު}", q"{ޔަގްޡާން}" ];

		return choice(strs, this.rnd);
	}

	override string personMalePrefix() {
		const string[] strs =
		[ q"{އަމީރު}", q"{އަމީރާ}", q"{ބަނޑޭރި}", q"{ބޮޑު}" ];

		return choice(strs, this.rnd);
	}

	override string personName() {
		const int rndInt = uniform(0, 1, this.rnd);

		if(rndInt >= 0 && rndInt < 1) {
			return personFirstName() ~ " " ~ personLastName();
		}

		return "";
	}

	override string personPrefix() {
		const string[] strs =
		[ q"{ބަނޑޭރި}", q"{ބޮޑު}", q"{އަމީރާ}", q"{އަމީރު}" ];

		return choice(strs, this.rnd);
	}

	override string personSex() {
		const string[] strs =
		[ q"{އަންހެން}", q"{ފިރިހެން}" ];

		return choice(strs, this.rnd);
	}

	override string phoneNumberFormats() {
		const string[] strs =
		[ q"{3######}", q"{4######}", q"{5######}", q"{6######}", q"{7######}", q"{8######}", q"{9######}"
		, q"{3## ####}", q"{4## ####}", q"{5## ####}", q"{6## ####}", q"{7## ####}", q"{8## ####}", q"{9## ####}"
		, q"{+9603######}", q"{+9604######}", q"{+9605######}", q"{+9606######}", q"{+9607######}"
		, q"{+9608######}", q"{+9609######}", q"{+960 3## ####}", q"{+960 4## ####}", q"{+960 5## ####}"
		, q"{+960 6## ####}", q"{+960 7## ####}", q"{+960 8## ####}", q"{+960 9## ####}", q"{+960-3######}"
		, q"{+960-4######}", q"{+960-5######}", q"{+960-6######}", q"{+960-7######}", q"{+960-8######}"
		, q"{+960-9######}", q"{+960-3##-####}", q"{+960-4##-####}", q"{+960-5##-####}", q"{+960-6##-####}"
		, q"{+960-7##-####}", q"{+960-8##-####}", q"{+960-9##-####}" ];

		return numberBuild(choice(strs, this.rnd));
	}

}
