module faked.faker_he;

import std.algorithm : map, joiner;
import std.array;
import std.conv : to;
import std.exception : enforce;
import std.format;
import std.random;
import std.range : iota, take, repeat;
import std.string : toUpper;
import std.typecons : Nullable, nullable;

import faked.customtypes;
import faked.fakerenums;

import faked.faker_en;

class Faker_he : Faker_en {
@safe:
	this(int seed) {
		super(seed);
	}

	override string cellPhoneFormats() {
		const string[] strs =
		[ q"{050-#######}", q"{051-#######}", q"{052-#######}", q"{053-#######}", q"{054-#######}"
		, q"{055-#######}", q"{057-#######}", q"{058-#######}", q"{+972-50-#######}", q"{+972-51-#######}"
		, q"{+972-52-#######}", q"{+972-53-#######}", q"{+972-54-#######}", q"{+972-55-#######}"
		, q"{+972-57-#######}", q"{+972-58-#######}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string commerceProductDescription() {
		const string[] strs =
		[ q"{כסא מנהלים ארגונומי מרופד בעור שחור מלוכדות ובמושב ובגב מרופד PVC לנוחות ותמיכה לאורך כל היום}"
		, q"{מערך הרכב מורכב מעיצוב מנוע קדמי, עם תיבות הילוכים מסוג ציר טרנסוולר המותקנות בחלק האחורי של המנוע והנעה עם ארבעה גלגלים}", q"{חדש ABC 13 9370, 13.3, דור 5 CoreA5-8250U, 8GB RAM, 256GB SSD, כוח UHD גרפיקה, OS 10 Home, OS Office A & J 2016}"
		, q"{מקלדת מייפל גיימינג דקה ופשוטה מבית Dev Byte מגיעה עם גוף אלגנטי ותאורת RGB LED בגוון 7 צבעים לפונקציונליות חכמה}", q"{אפולוטק B340 הוא עכבר אלחוטי במחיר סביר עם קישוריות אמינה, חיי סוללה של 12 חודשים ועיצוב מודרני}"
		, q"{נאגסאקי לנדר הוא השם המסחרי המסחרי של מספר סדרות של אופני ספורט נגסאקי, שהחלו ב- ABC800J משנת 1984}", q"{הכדורגל טוב לאימונים ולמטרות פנאי}"
		, q"{כפפות שוער רשת קרבוניט מעוצבות באופן ארגונומי בכדי להעניק התאמה קלה}", q"{טכנולוגיית שחיקת הדחיסה המתקדמת ביותר של בוסטון מגבירה את החמצון בשרירים, מייצבת שרירים פעילים}"
		, q"{מגוון חדש של חולצות רשמיות מעוצבות תוך התחשבות בך. עם התאמות ועיצוב שיגרמו לך להתבלט}", q"{המגוון היפה של תפוח נטורל שיש בו שילוב מרגש של מרכיבים טבעיים. עם הטוב של 100% מרכיבים טבעיים}"
		, q"{נעלי אנדי נועדו לזכור עמידות כמו גם טרנדים, מגוון הנעליים והסנדלים המסוגננים ביותר}" ];

		return choice(strs, this.rnd);
	}

	override string commerceProductNameAdjective() {
		const string[] strs =
		[ q"{קטן}", q"{ארגונומי}", q"{כפרי}", q"{אינטליגנטי}", q"{מאוד יפה}"
		, q"{מדהים}", q"{פנטסטי}", q"{מעשי}", q"{מלוטש}", q"{גנרית}", q"{עבודת יד}"
		, q"{מורשה}", q"{מְזוּקָק}", q"{לא ממותג}", q"{טעים}" ];

		return choice(strs, this.rnd);
	}

	override string commerceProductNameMaterial() {
		const string[] strs =
		[ q"{פלדה}", q"{עץ}", q"{בטון}", q"{פלסטי}", q"{כותנה}", q"{גרניט}", q"{גומי}"
		, q"{מתכת}", q"{רך}", q"{צַח}", q"{קפוא}" ];

		return choice(strs, this.rnd);
	}

	override string commerceProductNameProduct() {
		const string[] strs =
		[ q"{כיסא}", q"{אוטו}", q"{מחשב}", q"{מקלדת}", q"{עכבר}", q"{אופניים}"
		, q"{כדור}", q"{כפפות}", q"{מכנסיים}", q"{חולצה}", q"{שולחן}", q"{נעליים}"
		, q"{כובע}", q"{מגבות}", q"{סבון}", q"{טונה}", q"{עוף}", q"{דג}", q"{גבינה}"
		, q"{בייקון}", q"{פיצה}", q"{סלט}", q"{נקניקיות}", q"{צ'יפס}" ];

		return choice(strs, this.rnd);
	}

	override string commerceDepartment() {
		const string[] strs =
		[ q"{ספרים}", q"{סרטים}", q"{מוסיקה}", q"{משחקים}", q"{מכשירי חשמל}"
		, q"{מחשבים}", q"{בית}", q"{גן}", q"{כלים}", q"{מכולת}", q"{בריאות}"
		, q"{יופי}", q"{צעצועים}", q"{ילדים}", q"{תִינוֹק}", q"{ביגוד}"
		, q"{נעליים}", q"{תכשיטים}", q"{ספורט}", q"{מחוץ לבית}", q"{רכב}"
		, q"{תעשייתי}" ];

		return choice(strs, this.rnd);
	}

	override string dateMonthWide() {
		const string[] strs =
		[ q"{ינואר}", q"{פברואר}", q"{מרץ}", q"{אפריל}", q"{מאי}", q"{יוני}"
		, q"{יולי}", q"{אוגוסט}", q"{ספטמבר}", q"{אוקטובר}", q"{נובמבר}"
		, q"{דצמבר}" ];

		return choice(strs, this.rnd);
	}

	override string dateMonthAbbr() {
		const string[] strs =
		[ q"{Jan}", q"{Feb}", q"{Mar}", q"{Apr}", q"{May}", q"{Jun}", q"{Jul}", q"{Aug}", q"{Sep}", q"{Oct}", q"{Nov}"
		, q"{Dec}" ];

		return choice(strs, this.rnd);
	}

	override string dateWeekdayWide() {
		const string[] strs =
		[ q"{יום ראשון}", q"{יום שני}", q"{יום שלישי}", q"{יום רביעי}"
		, q"{יום חמישי}", q"{יום שישי}", q"{שבת}" ];

		return choice(strs, this.rnd);
	}

	override string dateWeekdayAbbr() {
		const string[] strs =
		[ q"{יום א׳}", q"{יום ב׳}", q"{יום ג׳}", q"{יום ד׳}", q"{יום ה׳}"
		, q"{יום ו׳}", q"{שבת}" ];

		return choice(strs, this.rnd);
	}

	override string locationBuildingNumber() {
		const string[] strs =
		[ q"{###}", q"{##}", q"{#}", q"{'ב##}", q"{'א##}", q"{'א#}", q"{'ב#}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationCityName() {
		const string[] strs =
		[ q"{אבו גוש}", q"{אבו סנאן}", q"{אבו סריחאן (שבט)}", q"{אבו עבדון (שבט)}"
		, q"{אבו עמאר (שבט)}", q"{אבו עמרה (שבט)}", q"{אבו קורינאת (שבט)}"
		, q"{אבו קרינאת (יישוב)}", q"{אבו רובייעה (שבט)}", q"{אבו רוקייק (שבט)}"
		, q"{אבו תלול}", q"{אבטין}", q"{אבטליון}", q"{אביאל}", q"{אביבים}"
		, q"{אביגדור}", q"{אביחיל}", q"{אביטל}", q"{אביעזר}", q"{אבירים}"
		, q"{אבן יהודה}", q"{אבן מנחם}", q"{אבן ספיר}", q"{אבן שמואל}"
		, q"{אבני איתן}", q"{אבני חפץ}", q"{אבנת}", q"{אבשלום}", q"{אדורה}"
		, q"{אדירים}", q"{אדמית}", q"{אדרת}", q"{אודים}", q"{אודם}", q"{אוהד}"
		, q"{אום אל-פחם}", q"{אום אל-קוטוף}", q"{אום בטין}", q"{אומן}"
		, q"{אומץ}", q"{אופקים}", q"{אור הגנוז}", q"{אור הנר}", q"{אור יהודה}"
		, q"{אור עקיבא}", q"{אורה}", q"{אורות}", q"{אורטל}", q"{אורים}"
		, q"{אורנים}", q"{אורנית}", q"{אושה}", q"{אזור}", q"{אחווה}", q"{אחוזם}"
		, q"{אחוזת ברק}", q"{אחיהוד}", q"{אחיטוב}", q"{אחיסמך}", q"{אחיעזר}"
		, q"{אטרש (שבט)}", q"{איבים}", q"{אייל}", q"{איילת השחר}", q"{אילון}"
		, q"{אילות}", q"{אילניה}", q"{אילת}", q"{אירוס}", q"{איתמר}", q"{איתן}"
		, q"{איתנים}", q"{אכסאל}", q"{אל סייד}", q"{אל-עזי}", q"{אל-עריאן}"
		, q"{אל-רום}", q"{אלומה}", q"{אלומות}", q"{אלון הגליל}", q"{אלון מורה}"
		, q"{אלון שבות}", q"{אלוני אבא}", q"{אלוני הבשן}", q"{אלוני יצחק}"
		, q"{אלונים}", q"{אלי-עד}", q"{אליאב}", q"{אליכין}", q"{אליפז}"
		, q"{אליפלט}", q"{אליקים}", q"{אלישיב}", q"{אלישמע}", q"{אלמגור}"
		, q"{אלמוג}", q"{אלעד}", q"{אלעזר}", q"{אלפי מנשה}", q"{אלקוש}"
		, q"{אלקנה}", q"{אמונים}", q"{אמירים}", q"{אמנון}", q"{אמציה}"
		, q"{אניעם}", q"{אסד (שבט)}", q"{אספר}", q"{אעבלין}", q"{אעצם (שבט)}"
		, q"{אפיניש (שבט)}", q"{אפיק}", q"{אפיקים}", q"{אפק}", q"{אפרת}"
		, q"{ארבל}", q"{ארגמן}", q"{ארז}", q"{אריאל}", q"{ארסוף}", q"{אשבול}"
		, q"{אשבל}", q"{אשדוד}", q"{אשדות יעקב (איחוד)}", q"{אשדות יעקב (מאוחד)}"
		, q"{אשחר}", q"{אשכולות}", q"{אשל הנשיא}", q"{אשלים}", q"{אשקלון}"
		, q"{אשרת}", q"{אשתאול}", q"{אתגר}", q"{באקה אל-גרביה}", q"{באר אורה}"
		, q"{באר גנים}", q"{באר טוביה}", q"{באר יעקב}", q"{באר מילכה}"
		, q"{באר שבע}", q"{בארות יצחק}", q"{בארותיים}", q"{בארי}", q"{בוסתן הגליל}"
		, q"{בועיינה-נוג'ידאת}", q"{בוקעאתא}", q"{בורגתה}", q"{בחן}"
		, q"{בטחה}", q"{ביצרון}", q"{ביר אל-מכסור}", q"{ביר הדאג'}"
		, q"{ביריה}", q"{בית אורן}", q"{בית אל}", q"{בית אלעזרי}", q"{בית אלפא}"
		, q"{בית אריה}", q"{בית ברל}", q"{בית ג'ן}", q"{בית גוברין}"
		, q"{בית גמליאל}", q"{בית דגן}", q"{בית הגדי}", q"{בית הלוי}"
		, q"{בית הלל}", q"{בית העמק}", q"{בית הערבה}", q"{בית השיטה}"
		, q"{בית זיד}", q"{בית זית}", q"{בית זרע}", q"{בית חורון}", q"{בית חירות}"
		, q"{בית חלקיה}", q"{בית חנן}", q"{בית חנניה}", q"{בית חשמונאי}"
		, q"{בית יהושע}", q"{בית יוסף}", q"{בית ינאי}", q"{בית יצחק-שער חפר}"
		, q"{בית לחם הגלילית}", q"{בית מאיר}", q"{בית נחמיה}", q"{בית ניר}"
		, q"{בית נקופה}", q"{בית עובד}", q"{בית עוזיאל}", q"{בית עזרא}"
		, q"{בית עריף}", q"{בית צבי}", q"{בית קמה}", q"{בית קשת}", q"{בית רבן}"
		, q"{בית רימון}", q"{בית שאן}", q"{בית שמש}", q"{בית שערים}"
		, q"{בית שקמה}", q"{ביתן אהרן}", q"{ביתר עילית}", q"{בלפוריה}"
		, q"{בן זכאי}", q"{בן עמי}", q"{בן שמן (כפר נוער)}", q"{בן שמן (מושב)}"
		, q"{בני ברק}", q"{בני דקלים}", q"{בני דרום}", q"{בני דרור}"
		, q"{בני יהודה}", q"{בני נצרים}", q"{בני עטרות}", q"{בני עי"ש}"
		, q"{בני ציון}", q"{בני ראם}", q"{בניה}", q"{בנימינה-גבעת עדה}"
		, q"{בסמ"ה}", q"{בסמת טבעון}", q"{בענה}", q"{בצרה}", q"{בצת}", q"{בקוע}"
		, q"{בקעות}", q"{בר גיורא}", q"{בר יוחאי}", q"{ברוכין}", q"{ברור חיל}"
		, q"{ברוש}", q"{ברכה}", q"{ברכיה}", q"{ברעם}", q"{ברק}", q"{ברקאי}"
		, q"{ברקן}", q"{ברקת}", q"{בת הדר}", q"{בת חן}", q"{בת חפר}", q"{בת ים}"
		, q"{בת עין}", q"{בת שלמה}", q"{ג'דיידה-מכר}", q"{ג'ולס}", q"{ג'לג'וליה}"
		, q"{ג'נאביב (שבט)}", q"{ג'סר א-זרקא}", q"{ג'ש (גוש חלב)}"
		, q"{ג'ת}", q"{גאולי תימן}", q"{גאולים}", q"{גאליה}", q"{גבולות}"
		, q"{גבים}", q"{גבע}", q"{גבע בנימין}", q"{גבע כרמל}", q"{גבעולים}"
		, q"{גבעון החדשה}", q"{גבעות בר}", q"{גבעות עדן}", q"{גבעת אבני}"
		, q"{גבעת אלה}", q"{גבעת ברנר}", q"{גבעת השלושה}", q"{גבעת זאב}"
		, q"{גבעת ח"ן}", q"{גבעת חיים (איחוד)}", q"{גבעת חיים (מאוחד)}"
		, q"{גבעת יואב}", q"{גבעת יערים}", q"{גבעת ישעיהו}", q"{גבעת כ"ח}"
		, q"{גבעת ניל"י}", q"{גבעת עוז}", q"{גבעת שמואל}", q"{גבעת שמש}"
		, q"{גבעת שפירא}", q"{גבעתי}", q"{גבעתיים}", q"{גברעם}", q"{גבת}"
		, q"{גדות}", q"{גדיש}", q"{גדעונה}", q"{גדרה}", q"{גונן}", q"{גורן}"
		, q"{גורנות הגליל}", q"{גזית}", q"{גזר}", q"{גיאה}", q"{גיבתון}"
		, q"{גיזו}", q"{גילון}", q"{גילת}", q"{גינוסר}", q"{גיניגר}", q"{גינתון}"
		, q"{גיתה}", q"{גיתית}", q"{גלאון}", q"{גלגל}", q"{גליל ים}", q"{גלעד (אבן יצחק)}"
		, q"{גמזו}", q"{גן הדרום}", q"{גן השומרון}", q"{גן חיים}", q"{גן יאשיה}"
		, q"{גן יבנה}", q"{גן נר}", q"{גן שורק}", q"{גן שלמה}", q"{גן שמואל}"
		, q"{גנות}", q"{גנות הדר}", q"{גני הדר}", q"{גני טל}", q"{גני יוחנן}"
		, q"{גני מודיעין}", q"{גני עם}", q"{גני תקווה}", q"{געש}", q"{געתון}"
		, q"{גפן}", q"{גרופית}", q"{גשור}", q"{גשר}", q"{גשר הזיו}", q"{גת (קיבוץ)}"
		, q"{גת רימון}", q"{דאלית אל-כרמל}", q"{דבורה}", q"{דבוריה}"
		, q"{דבירה}", q"{דברת}", q"{דגניה א'}", q"{דגניה ב'}", q"{דוב"ב}"
		, q"{דולב}", q"{דור}", q"{דורות}", q"{דחי}", q"{דייר אל-אסד}", q"{דייר חנא}"
		, q"{דייר ראפאת}", q"{דימונה}", q"{דישון}", q"{דליה}", q"{דלתון}"
		, q"{דמיידה}", q"{דן}", q"{דפנה}", q"{דקל}", q"{דריג'את}", q"{האון}"
		, q"{הבונים}", q"{הגושרים}", q"{הדר עם}", q"{הוד השרון}", q"{הודיה}"
		, q"{הודיות}", q"{הוואשלה (שבט)}", q"{הוזייל (שבט)}", q"{הושעיה}"
		, q"{הזורע}", q"{הזורעים}", q"{החותרים}", q"{היוגב}", q"{הילה}"
		, q"{המעפיל}", q"{הסוללים}", q"{העוגן}", q"{הר אדר}", q"{הר גילה}"
		, q"{הר עמשא}", q"{הראל}", q"{הרדוף}", q"{הרצליה}", q"{הררית}"
		, q"{ורד יריחו}", q"{ורדון}", q"{זבארגה (שבט)}", q"{זבדיאל}"
		, q"{זוהר}", q"{זיקים}", q"{זיתן}", q"{זכרון יעקב}", q"{זכריה}"
		, q"{זמר}", q"{זמרת}", q"{זנוח}", q"{זרועה}", q"{זרזיר}", q"{זרחיה}"
		, q"{ח'ואלד}", q"{ח'ואלד (שבט)}", q"{חבצלת השרון}", q"{חבר}"
		, q"{חברון}", q"{חגור}", q"{חגי}", q"{חגלה}", q"{חד-נס}", q"{חדיד}"
		, q"{חדרה}", q"{חוג'ייראת (ד'הרה)}", q"{חולדה}", q"{חולון}"
		, q"{חולית}", q"{חולתה}", q"{חוסן}", q"{חוסנייה}", q"{חופית}", q"{חוקוק}"
		, q"{חורה}", q"{חורפיש}", q"{חורשים}", q"{חזון}", q"{חיבת ציון}"
		, q"{חיננית}", q"{חיפה}", q"{חירות}", q"{חלוץ}", q"{חלץ}", q"{חמאם}"
		, q"{חמד}", q"{חמדיה}", q"{חמדת}", q"{חמרה}", q"{חניאל}", q"{חניתה}"
		, q"{חנתון}", q"{חספין}", q"{חפץ חיים}", q"{חפצי-בה}", q"{חצב}"
		, q"{חצבה}", q"{חצור הגלילית}", q"{חצור-אשדוד}", q"{חצרים}"
		, q"{חרב לאת}", q"{חרוצים}", q"{חריש}", q"{חרמש}", q"{חרשים}", q"{חשמונאים}"
		, q"{טבריה}", q"{טובא-זנגריה}", q"{טורעאן}", q"{טייבה}", q"{טייבה (בעמק)}"
		, q"{טירה}", q"{טירת יהודה}", q"{טירת כרמל}", q"{טירת צבי}"
		, q"{טל שחר}", q"{טל-אל}", q"{טללים}", q"{טלמון}", q"{טמרה}", q"{טמרה (יזרעאל)}"
		, q"{טנא}", q"{טפחות}", q"{יאנוח-ג'ת}", q"{יבול}", q"{יבנאל}", q"{יבנה}"
		, q"{יגור}", q"{יגל}", q"{יד בנימין}", q"{יד השמונה}", q"{יד חנה}"
		, q"{יד מרדכי}", q"{יד נתן}", q"{יד רמב"ם}", q"{ידידה}", q"{יהוד-מונוסון}"
		, q"{יהל}", q"{יובל}", q"{יובלים}", q"{יודפת}", q"{יונתן}", q"{יושיביה}"
		, q"{יזרעאל}", q"{יחיעם}", q"{יטבתה}", q"{ייט"ב}", q"{יכיני}", q"{ינוב}"
		, q"{ינון}", q"{יסוד המעלה}", q"{יסודות}", q"{יסעור}", q"{יעד}"
		, q"{יעל}", q"{יעף}", q"{יערה}", q"{יפיע}", q"{יפית}", q"{יפעת}", q"{יפתח}"
		, q"{יצהר}", q"{יציץ}", q"{יקום}", q"{יקיר}", q"{יקנעם (מושבה)}"
		, q"{יקנעם עילית}", q"{יראון}", q"{ירדנה}", q"{ירוחם}", q"{ירושלים}"
		, q"{ירחיב}", q"{ירכא}", q"{ירקונה}", q"{ישע}", q"{ישעי}", q"{ישרש}"
		, q"{יתד}", q"{כאבול}", q"{כאוכב אבו אל-היג'א}", q"{כברי}", q"{כדורי}"
		, q"{כדיתה}", q"{כוכב השחר}", q"{כוכב יאיר}", q"{כוכב יעקב}"
		, q"{כוכב מיכאל}", q"{כורזים}", q"{כחל}", q"{כחלה}", q"{כיסופים}"
		, q"{כישור}", q"{כליל}", q"{כלנית}", q"{כמאנה}", q"{כמהין}", q"{כמון}"
		, q"{כנות}", q"{כנף}", q"{כנרת (מושבה)}", q"{כנרת (קבוצה)}", q"{כסיפה}"
		, q"{כסלון}", q"{כסרא-סמיע}", q"{כעביה-טבאש-חג'אג'רה}"
		, q"{כפר אביב}", q"{כפר אדומים}", q"{כפר אוריה}", q"{כפר אחים}"
		, q"{כפר ביאליק}", q"{כפר ביל"ו}", q"{כפר בלום}", q"{כפר בן נון}"
		, q"{כפר ברא}", q"{כפר ברוך}", q"{כפר גדעון}", q"{כפר גלים}"
		, q"{כפר גליקסון}", q"{כפר גלעדי}", q"{כפר דניאל}", q"{כפר האורנים}"
		, q"{כפר החורש}", q"{כפר המכבי}", q"{כפר הנגיד}", q"{כפר הנוער הדתי}"
		, q"{כפר הנשיא}", q"{כפר הס}", q"{כפר הרא"ה}", q"{כפר הרי"ף}"
		, q"{כפר ויתקין}", q"{כפר ורבורג}", q"{כפר ורדים}", q"{כפר זוהרים}"
		, q"{כפר זיתים}", q"{כפר חב"ד}", q"{כפר חושן}", q"{כפר חיטים}"
		, q"{כפר חיים}", q"{כפר חנניה}", q"{כפר חסידים א'}", q"{כפר חסידים ב'}"
		, q"{כפר חרוב}", q"{כפר טרומן}", q"{כפר יאסיף}", q"{כפר ידידיה}"
		, q"{כפר יהושע}", q"{כפר יונה}", q"{כפר יחזקאל}", q"{כפר יעבץ}"
		, q"{כפר כמא}", q"{כפר כנא}", q"{כפר מונש}", q"{כפר מימון}"
		, q"{כפר מל"ל}", q"{כפר מנדא}", q"{כפר מנחם}", q"{כפר מסריק}"
		, q"{כפר מצר}", q"{כפר מרדכי}", q"{כפר נטר}", q"{כפר סאלד}"
		, q"{כפר סבא}", q"{כפר סילבר}", q"{כפר סירקין}", q"{כפר עבודה}"
		, q"{כפר עזה}", q"{כפר עציון}", q"{כפר פינס}", q"{כפר קאסם}"
		, q"{כפר קיש}", q"{כפר קרע}", q"{כפר ראש הנקרה}", q"{כפר רוזנואלד (זרעית)}"
		, q"{כפר רופין}", q"{כפר רות}", q"{כפר שמאי}", q"{כפר שמואל}"
		, q"{כפר שמריהו}", q"{כפר תבור}", q"{כפר תפוח}", q"{כרי דשא}"
		, q"{כרכום}", q"{כרם בן זמרה}", q"{כרם בן שמן}", q"{כרם יבנה (ישיבה)}"
		, q"{כרם מהר"ל}", q"{כרם שלום}", q"{כרמי יוסף}", q"{כרמי צור}"
		, q"{כרמי קטיף}", q"{כרמיאל}", q"{כרמיה}", q"{כרמים}", q"{כרמל}"
		, q"{לא רשום}", q"{לבון}", q"{לביא}", q"{לבנים}", q"{להב}", q"{להבות הבשן}"
		, q"{להבות חביבה}", q"{להבים}", q"{לוד}", q"{לוזית}", q"{לוחמי הגיטאות}"
		, q"{לוטם}", q"{לוטן}", q"{לימן}", q"{לכיש}", q"{לפיד}", q"{לפידות}"
		, q"{לקיה}", q"{מאור}", q"{מאיר שפיה}", q"{מבוא ביתר}", q"{מבוא דותן}"
		, q"{מבוא חורון}", q"{מבוא חמה}", q"{מבוא מודיעים}", q"{מבואות ים}"
		, q"{מבואות יריחו}", q"{מבועים}", q"{מבטחים}", q"{מבקיעים}"
		, q"{מבשרת ציון}", q"{מג'ד אל-כרום}", q"{מג'דל שמס}", q"{מגאר}"
		, q"{מגדים}", q"{מגדל}", q"{מגדל העמק}", q"{מגדל עוז}", q"{מגדלים}"
		, q"{מגידו}", q"{מגל}", q"{מגן}", q"{מגן שאול}", q"{מגשימים}", q"{מדרך עוז}"
		, q"{מדרשת בן גוריון}", q"{מדרשת רופין}", q"{מודיעין עילית}"
		, q"{מודיעין-מכבים-רעות}", q"{מולדת}", q"{מוצא עילית}"
		, q"{מוקייבלה}", q"{מורן}", q"{מורשת}", q"{מזור}", q"{מזכרת בתיה}"
		, q"{מזרע}", q"{מזרעה}", q"{מחולה}", q"{מחנה הילה}", q"{מחנה טלי}"
		, q"{מחנה יהודית}", q"{מחנה יוכבד}", q"{מחנה יפה}", q"{מחנה יתיר}"
		, q"{מחנה מרים}", q"{מחנה תל נוף}", q"{מחניים}", q"{מחסיה}"
		, q"{מטולה}", q"{מטע}", q"{מי עמי}", q"{מיטב}", q"{מייסר}", q"{מיצר}"
		, q"{מירב}", q"{מירון}", q"{מישר}", q"{מיתר}", q"{מכורה}", q"{מכחול}"
		, q"{מכמורת}", q"{מכמנים}", q"{מלאה}", q"{מלילות}", q"{מלכיה}"
		, q"{מלכישוע}", q"{מנוחה}", q"{מנוף}", q"{מנות}", q"{מנחמיה}", q"{מנרה}"
		, q"{מנשית זבדה}", q"{מסד}", q"{מסדה}", q"{מסילות}", q"{מסילת ציון}"
		, q"{מסלול}", q"{מסעדה}", q"{מסעודין אל-עזאזמה}", q"{מעברות}"
		, q"{מעגלים}", q"{מעגן}", q"{מעגן מיכאל}", q"{מעוז חיים}", q"{מעון}"
		, q"{מעונה}", q"{מעיליא}", q"{מעין ברוך}", q"{מעין צבי}", q"{מעלה אדומים}"
		, q"{מעלה אפרים}", q"{מעלה גלבוע}", q"{מעלה גמלא}", q"{מעלה החמישה}"
		, q"{מעלה לבונה}", q"{מעלה מכמש}", q"{מעלה עירון}", q"{מעלה עמוס}"
		, q"{מעלות-תרשיחא}", q"{מענית}", q"{מעש}", q"{מפלסים}", q"{מצדות יהודה}"
		, q"{מצובה}", q"{מצליח}", q"{מצפה}", q"{מצפה אבי"ב}", q"{מצפה אילן}"
		, q"{מצפה יריחו}", q"{מצפה נטופה}", q"{מצפה רמון}", q"{מצפה שלם}"
		, q"{מצר}", q"{מקווה ישראל}", q"{מרגליות}", q"{מרום גולן}"
		, q"{מרחב עם}", q"{מרחביה (מושב)}", q"{מרחביה (קיבוץ)}"
		, q"{מרכז שפירא}", q"{משאבי שדה}", q"{משגב דב}", q"{משגב עם}"
		, q"{משהד}", q"{משואה}", q"{משואות יצחק}", q"{משכיות}", q"{משמר איילון}"
		, q"{משמר דוד}", q"{משמר הירדן}", q"{משמר הנגב}", q"{משמר העמק}"
		, q"{משמר השבעה}", q"{משמר השרון}", q"{משמרות}", q"{משמרת}"
		, q"{משען}", q"{מתן}", q"{מתת}", q"{מתתיהו}", q"{נאות גולן}", q"{נאות הכיכר}"
		, q"{נאות מרדכי}", q"{נאות סמדר}", q"{נאעורה}", q"{נבטים}"
		, q"{נגבה}", q"{נגוהות}", q"{נהורה}", q"{נהלל}", q"{נהריה}", q"{נוב}"
		, q"{נוגה}", q"{נוה צוף}", q"{נווה}", q"{נווה אבות}", q"{נווה אור}"
		, q"{נווה אטי"ב}", q"{נווה אילן}", q"{נווה איתן}", q"{נווה דניאל}"
		, q"{נווה זוהר}", q"{נווה זיו}", q"{נווה חריף}", q"{נווה ים}"
		, q"{נווה ימין}", q"{נווה ירק}", q"{נווה מבטח}", q"{נווה מיכאל}"
		, q"{נווה שלום}", q"{נועם}", q"{נוף איילון}", q"{נוף הגליל}"
		, q"{נופים}", q"{נופית}", q"{נופך}", q"{נוקדים}", q"{נורדיה}", q"{נורית}"
		, q"{נחושה}", q"{נחל עוז}", q"{נחלה}", q"{נחליאל}", q"{נחלים}"
		, q"{נחם}", q"{נחף}", q"{נחשולים}", q"{נחשון}", q"{נחשונים}", q"{נטועה}"
		, q"{נטור}", q"{נטע}", q"{נטעים}", q"{נטף}", q"{ניין}", q"{ניל"י}", q"{ניצן}"
		, q"{ניצן ב'}", q"{ניצנה (קהילת חינוך)}", q"{ניצני סיני}"
		, q"{ניצני עוז}", q"{ניצנים}", q"{ניר אליהו}", q"{ניר בנים}"
		, q"{ניר גלים}", q"{ניר דוד (תל עמל)}", q"{ניר ח"ן}", q"{ניר יפה}"
		, q"{ניר יצחק}", q"{ניר ישראל}", q"{ניר משה}", q"{ניר עוז}"
		, q"{ניר עם}", q"{ניר עציון}", q"{ניר עקיבא}", q"{ניר צבי}"
		, q"{נירים}", q"{נירית}", q"{נמרוד}", q"{נס הרים}", q"{נס עמים}"
		, q"{נס ציונה}", q"{נעורים}", q"{נעלה}", q"{נעמ"ה}", q"{נען}", q"{נערן}"
		, q"{נצאצרה (שבט)}", q"{נצר חזני}", q"{נצר סרני}", q"{נצרת}"
		, q"{נשר}", q"{נתיב הגדוד}", q"{נתיב הל"ה}", q"{נתיב העשרה}"
		, q"{נתיב השיירה}", q"{נתיבות}", q"{נתניה}", q"{סאג'ור}", q"{סאסא}"
		, q"{סביון}", q"{סגולה}", q"{סואעד (חמרייה)}", q"{סואעד (כמאנה) (שבט)}"
		, q"{סולם}", q"{סוסיה}", q"{סופה}", q"{סח'נין}", q"{סייד (שבט)}"
		, q"{סלמה}", q"{סלעית}", q"{סמר}", q"{סנסנה}", q"{סעד}", q"{סעוה}", q"{סער}"
		, q"{ספיר}", q"{סתריה}", q"{ע'ג'ר}", q"{עבדון}", q"{עברון}", q"{עגור}"
		, q"{עדי}", q"{עדנים}", q"{עוזה}", q"{עוזייר}", q"{עולש}", q"{עומר}"
		, q"{עופר}", q"{עופרה}", q"{עוצם}", q"{עוקבי (בנו עוקבה)}", q"{עזוז}"
		, q"{עזר}", q"{עזריאל}", q"{עזריה}", q"{עזריקם}", q"{עטאוונה (שבט)}"
		, q"{עטרת}", q"{עידן}", q"{עיילבון}", q"{עיינות}", q"{עילוט}", q"{עין איילה}"
		, q"{עין אל-אסד}", q"{עין גב}", q"{עין גדי}", q"{עין דור}", q"{עין הבשור}"
		, q"{עין הוד}", q"{עין החורש}", q"{עין המפרץ}", q"{עין הנצי"ב}"
		, q"{עין העמק}", q"{עין השופט}", q"{עין השלושה}", q"{עין ורד}"
		, q"{עין זיוון}", q"{עין חוד}", q"{עין חצבה}", q"{עין חרוד (איחוד)}"
		, q"{עין חרוד (מאוחד)}", q"{עין יהב}", q"{עין יעקב}", q"{עין כרם-בי"ס חקלאי}"
		, q"{עין כרמל}", q"{עין מאהל}", q"{עין נקובא}", q"{עין עירון}"
		, q"{עין צורים}", q"{עין קנייא}", q"{עין ראפה}", q"{עין שמר}"
		, q"{עין שריד}", q"{עין תמר}", q"{עינת}", q"{עיר אובות}", q"{עכו}"
		, q"{עלומים}", q"{עלי}", q"{עלי זהב}", q"{עלמה}", q"{עלמון}", q"{עמוקה}"
		, q"{עמיחי}", q"{עמינדב}", q"{עמיעד}", q"{עמיעוז}", q"{עמיקם}"
		, q"{עמיר}", q"{עמנואל}", q"{עמקה}", q"{ענב}", q"{עספיא}", q"{עפולה}"
		, q"{עצמון שגב}", q"{עראבה}", q"{עראמשה}", q"{ערב אל נעים}"
		, q"{ערד}", q"{ערוגות}", q"{ערערה}", q"{ערערה-בנגב}", q"{עשרת}"
		, q"{עתלית}", q"{עתניאל}", q"{פארן}", q"{פדואל}", q"{פדויים}", q"{פדיה}"
		, q"{פוריה - כפר עבודה}", q"{פוריה - נווה עובד}", q"{פוריה עילית}"
		, q"{פוריידיס}", q"{פורת}", q"{פטיש}", q"{פלך}", q"{פלמחים}", q"{פני חבר}"
		, q"{פסגות}", q"{פסוטה}", q"{פעמי תש"ז}", q"{פצאל}", q"{פקיעין (בוקייעה)}"
		, q"{פקיעין חדשה}", q"{פרדס חנה-כרכור}", q"{פרדסיה}", q"{פרוד}"
		, q"{פרזון}", q"{פרי גן}", q"{פתח תקווה}", q"{פתחיה}", q"{צאלים}"
		, q"{צביה}", q"{צבעון}", q"{צובה}", q"{צוחר}", q"{צופיה}", q"{צופים}"
		, q"{צופית}", q"{צופר}", q"{צוקי ים}", q"{צוקים}", q"{צור הדסה}"
		, q"{צור יצחק}", q"{צור משה}", q"{צור נתן}", q"{צוריאל}", q"{צורית}"
		, q"{ציפורי}", q"{צלפון}", q"{צנדלה}", q"{צפריה}", q"{צפרירים}"
		, q"{צפת}", q"{צרופה}", q"{צרעה}", q"{קבועה (שבט)}", q"{קבוצת יבנה}"
		, q"{קדומים}", q"{קדימה-צורן}", q"{קדמה}", q"{קדמת צבי}", q"{קדר}"
		, q"{קדרון}", q"{קדרים}", q"{קודייראת א-צאנע(שבט)}", q"{קוואעין (שבט)}"
		, q"{קוממיות}", q"{קורנית}", q"{קטורה}", q"{קיסריה}", q"{קלחים}"
		, q"{קליה}", q"{קלנסווה}", q"{קלע}", q"{קציר}", q"{קצר א-סר}", q"{קצרין}"
		, q"{קרית אונו}", q"{קרית ארבע}", q"{קרית אתא}", q"{קרית ביאליק}"
		, q"{קרית גת}", q"{קרית טבעון}", q"{קרית ים}", q"{קרית יערים}"
		, q"{קרית יערים(מוסד)}", q"{קרית מוצקין}", q"{קרית מלאכי}"
		, q"{קרית נטפים}", q"{קרית ענבים}", q"{קרית עקרון}", q"{קרית שלמה}"
		, q"{קרית שמונה}", q"{קרני שומרון}", q"{קשת}", q"{ראמה}", q"{ראס אל-עין}"
		, q"{ראס עלי}", q"{ראש העין}", q"{ראש פינה}", q"{ראש צורים}"
		, q"{ראשון לציון}", q"{רבבה}", q"{רבדים}", q"{רביבים}", q"{רביד}"
		, q"{רגבה}", q"{רגבים}", q"{רהט}", q"{רווחה}", q"{רוויה}", q"{רוח מדבר}"
		, q"{רוחמה}", q"{רומאנה}", q"{רומת הייב}", q"{רועי}", q"{רותם}"
		, q"{רחוב}", q"{רחובות}", q"{רחלים}", q"{ריחאניה}", q"{ריחן}", q"{ריינה}"
		, q"{רימונים}", q"{רינתיה}", q"{רכסים}", q"{רם-און}", q"{רמות}"
		, q"{רמות השבים}", q"{רמות מאיר}", q"{רמות מנשה}", q"{רמות נפתלי}"
		, q"{רמלה}", q"{רמת גן}", q"{רמת דוד}", q"{רמת הכובש}", q"{רמת השופט}"
		, q"{רמת השרון}", q"{רמת טראמפ}", q"{רמת יוחנן}", q"{רמת ישי}"
		, q"{רמת מגשימים}", q"{רמת צבי}", q"{רמת רזיאל}", q"{רמת רחל}"
		, q"{רנן}", q"{רעים}", q"{רעננה}", q"{רקפת}", q"{רשפון}", q"{רשפים}"
		, q"{רתמים}", q"{שאר ישוב}", q"{שבי דרום}", q"{שבי ציון}", q"{שבי שומרון}"
		, q"{שבלי - אום אל-גנם}", q"{שגב-שלום}", q"{שדה אילן}", q"{שדה אליהו}"
		, q"{שדה אליעזר}", q"{שדה בוקר}", q"{שדה דוד}", q"{שדה ורבורג}"
		, q"{שדה יואב}", q"{שדה יעקב}", q"{שדה יצחק}", q"{שדה משה}"
		, q"{שדה נחום}", q"{שדה נחמיה}", q"{שדה ניצן}", q"{שדה עוזיהו}"
		, q"{שדה צבי}", q"{שדות ים}", q"{שדות מיכה}", q"{שדי אברהם}"
		, q"{שדי חמד}", q"{שדי תרומות}", q"{שדמה}", q"{שדמות דבורה}"
		, q"{שדמות מחולה}", q"{שדרות}", q"{שואבה}", q"{שובה}", q"{שובל}"
		, q"{שוהם}", q"{שומרה}", q"{שומריה}", q"{שוקדה}", q"{שורש}", q"{שורשים}"
		, q"{שושנת העמקים}", q"{שזור}", q"{שחר}", q"{שחרות}", q"{שיבולים}"
		, q"{שיזף}", q"{שיטים}", q"{שייח' דנון}", q"{שילה}", q"{שילת}", q"{שכניה}"
		, q"{שלווה}", q"{שלווה במדבר}", q"{שלוחות}", q"{שלומי}", q"{שלומית}"
		, q"{שם_ישוב}", q"{שמיר}", q"{שמעה}", q"{שמרת}", q"{שמשית}", q"{שני}"
		, q"{שניר}", q"{שעב}", q"{שעל}", q"{שעלבים}", q"{שער אפרים}", q"{שער הגולן}"
		, q"{שער העמקים}", q"{שער מנשה}", q"{שער שומרון}", q"{שפיים}"
		, q"{שפיר}", q"{שפר}", q"{שפרעם}", q"{שקד}", q"{שקף}", q"{שרונה}", q"{שריגים (לי-און)}"
		, q"{שריד}", q"{שרשרת}", q"{שתולה}", q"{שתולים}", q"{תאשור}", q"{תדהר}"
		, q"{תובל}", q"{תומר}", q"{תושיה}", q"{תימורים}", q"{תירוש}", q"{תל אביב - יפו}"
		, q"{תל יוסף}", q"{תל יצחק}", q"{תל מונד}", q"{תל עדשים}", q"{תל קציר}"
		, q"{תל שבע}", q"{תל תאומים}", q"{תלם}", q"{תלמי אליהו}", q"{תלמי אלעזר}"
		, q"{תלמי ביל"ו}", q"{תלמי יוסף}", q"{תלמי יחיאל}", q"{תלמי יפה}"
		, q"{תלמים}", q"{תמרת}", q"{תנובות}", q"{תעוז}", q"{תפרח}", q"{תקומה}"
		, q"{תקוע}", q"{תראבין א-צאנע (שבט)}", q"{תראבין א-צאנע(ישוב)}"
		, q"{תרום}" ];

		return choice(strs, this.rnd);
	}

	override string locationCityPattern() {
		final switch(uniform(0, 1, this.rnd)) {
			case 0: return locationCityName();
		}
		return "";
	}

	override string locationCountry() {
		const string[] strs =
		[ q"{אוגנדה}", q"{אוזבקיסטן}", q"{אוסטריה}", q"{אוסטרליה}"
		, q"{אוקראינה}", q"{אורוגוואי}", q"{אזרבייג'ן}", q"{איטליה}"
		, q"{איי מרשל}", q"{איי סיישל}", q"{איי שלמה}", q"{אינדונזיה}"
		, q"{איסלנד}", q"{איראן}", q"{אירלנד}", q"{אל סלוודור}", q"{אלבניה}"
		, q"{אלג'יריה}", q"{אנגולה}", q"{אנדורה}", q"{אנטיגואה וברבודה}"
		, q"{אסטוניה}", q"{אפגניסטן}", q"{אקוודור}", q"{ארגנטינה}"
		, q"{אריתריאה}", q"{ארמניה}", q"{ארצות הברית}", q"{אתיופיה}"
		, q"{בהאמה}", q"{בהוטן}", q"{בוטסואנה}", q"{בולגריה}", q"{בוליביה}"
		, q"{בוסניה והרצגובינה}", q"{בורונדי}", q"{בורמה}", q"{בורקינה פאסו}"
		, q"{בחריין}", q"{בלגיה}", q"{בליז}", q"{בלארוס}", q"{בנגלדש}"
		, q"{בנין}", q"{ברבדוס}", q"{ברוניי}", q"{ברזיל}", q"{בריטניה}"
		, q"{גאורגיה}", q"{גאנה}", q"{גבון}", q"{גואטמלה}", q"{גיאנה}"
		, q"{ג'יבוטי}", q"{גינאה}", q"{גינאה ביסאו}", q"{גיניאה המשוונית}"
		, q"{גמביה}", q"{ג'מייקה}", q"{גרמניה}", q"{גרנדה}", q"{דומיניקה}"
		, q"{דנמרק}", q"{דרום אפריקה}", q"{דרום סודאן}", q"{האיטי}"
		, q"{האמירויות הערביות המאוחדות}", q"{הודו}", q"{הולנד}"
		, q"{הונגריה}", q"{הונדורס}", q"{הממלכה המאוחדת}", q"{וייטנאם}"
		, q"{ונואטו}", q"{ונצואלה}", q"{ותיקן}", q"{זאיר}", q"{זימבבואה}"
		, q"{זמביה}", q"{חוף השנהב}", q"{טג'יקיסטן}", q"{טובאלו}", q"{טוגו}"
		, q"{טונגה}", q"{טורקיה}", q"{טורקמניסטן}", q"{טנזניה}", q"{טרינידד וטובגו}"
		, q"{יוון}", q"{יפן}", q"{ירדן}", q"{ישראל}", q"{כווית}", q"{כף ורדה}"
		, q"{לאוס}", q"{לבנון}", q"{לוב}", q"{לוקסמבורג}", q"{לטביה}", q"{ליבריה}"
		, q"{ליטא}", q"{ליכטנשטיין}", q"{לסוטו}", q"{מאוריטניה}", q"{מאוריציוס}"
		, q"{מאלי}", q"{מדגסקר}", q"{מוזמביק}", q"{מולדובה}", q"{מונגוליה}"
		, q"{מונטנגרו}", q"{מונקו}", q"{מזרח טימור}", q"{מיאנמר}"
		, q"{מיקרונזיה}", q"{מלאווי}", q"{מלדיביים, ה-}", q"{מלזיה}"
		, q"{מלטה}", q"{מצרים}", q"{מקדוניה}", q"{מקסיקו}", q"{מרוקו}"
		, q"{נאורו}", q"{נורבגיה}", q"{ניגריה}", q"{ניו זילנד}", q"{ניז'ר}"
		, q"{ניקרגואה}", q"{נמיביה}", q"{נפאל}", q"{סאו טומה ופרינסיפה}"
		, q"{סודאן}", q"{סווזילנד}", q"{סומליה}", q"{סוריה}", q"{סורינם}"
		, q"{סיירה לאונה}", q"{סין}", q"{סינגפור}", q"{סלובניה}", q"{סלובקיה}"
		, q"{סמואה}", q"{סן מרינו}", q"{סנגל}", q"{סנט וינסנט והגרנדינים}"
		, q"{סנט לוסיה}", q"{סנט קיטס ונוויס}", q"{ספרד}", q"{סרביה}"
		, q"{סרי לנקה}", q"{עומאן}", q"{עיראק}", q"{ערב הסעודית}", q"{פולין}"
		, q"{פורטוגל}", q"{פיג'י}", q"{פיליפינים}", q"{פינלנד}", q"{פלאו}"
		, q"{פנמה}", q"{פפואה גינאה החדשה}", q"{פקיסטן}", q"{פרגוואי}"
		, q"{פרו}", q"{צ'אד}", q"{צ'ילה}", q"{צ'כיה}", q"{צרפת}", q"{קובה}", q"{קולומביה}"
		, q"{קומורו}", q"{קונגו}", q"{קוסטה ריקה}", q"{קוריאה הדרומית}"
		, q"{קוריאה הצפונית}", q"{קזחסטן}", q"{קטאר}", q"{קירגיזסטן}"
		, q"{קיריבטי}", q"{קמבודיה}", q"{קמרון}", q"{קנדה}", q"{קניה}"
		, q"{קפריסין}", q"{קרואטיה}", q"{קריית הוותיקן}", q"{רואנדה}"
		, q"{רומניה}", q"{רוסיה}", q"{הרפובליקה הדומיניקנית}"
		, q"{הרפובליקה המרכז אפריקאית}", q"{הרפובליקה הסינית}"
		, q"{שבדיה}", q"{שווייץ}", q"{תאילנד}", q"{תוניסיה}", q"{תורכיה}"
		, q"{תימן}" ];

		return choice(strs, this.rnd);
	}

	override string locationCounty() {
		const string[] strs =
		[ q"{Not relevant for Israel}" ];

		return choice(strs, this.rnd);
	}

	override string locationDefaultCountry() {
		const string[] strs =
		[ q"{ישראל}" ];

		return choice(strs, this.rnd);
	}

	override string locationDirection() {
		const string[] strs =
		[ q"{צפון}", q"{מזרח}", q"{דרום}", q"{מערב}", q"{צפון מזרח}", q"{צפון מערב}"
		, q"{דרום מזרח}", q"{דרום מערב}" ];

		return choice(strs, this.rnd);
	}

	override string locationDirectionAbbr() {
		const string[] strs =
		[ q"{צ}", q"{מז}", q"{ד}", q"{מע}", q"{צ-מז}", q"{צ-מע}", q"{ד-מז}", q"{ד-מע}" ];

		return choice(strs, this.rnd);
	}

	override string locationPostcode() {
		const string[] strs =
		[ q"{#####}", q"{#######}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationSecondaryAddress() {
		const string[] strs =
		[ q"{# דירה}", q"{## דירה}", q"{# חדר}", q"{## חדר}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationState() {
		const string[] strs =
		[ q"{חיפה}", q"{תל אביב}", q"{הגדה המערבית}", q"{צפון}", q"{דרום}"
		, q"{ירושלים}", q"{מרכז}" ];

		return choice(strs, this.rnd);
	}

	override string locationStateAbbr() {
		const string[] strs =
		[ q"{AL}", q"{AK}", q"{AZ}", q"{AR}", q"{CA}", q"{CO}", q"{CT}", q"{DE}", q"{FL}", q"{GA}", q"{HI}", q"{ID}", q"{IL}"
		, q"{IN}", q"{IA}", q"{KS}", q"{KY}", q"{LA}", q"{ME}", q"{MD}", q"{MA}", q"{MI}", q"{MN}", q"{MS}", q"{MO}", q"{MT}"
		, q"{NE}", q"{NV}", q"{NH}", q"{NJ}", q"{NM}", q"{NY}", q"{NC}", q"{ND}", q"{OH}", q"{OK}", q"{OR}", q"{PA}", q"{RI}"
		, q"{SC}", q"{SD}", q"{TN}", q"{TX}", q"{UT}", q"{VT}", q"{VA}", q"{WA}", q"{WV}", q"{WI}", q"{WY}" ];

		return choice(strs, this.rnd);
	}

	override string locationStreetAddress() {
		const LocationStreetAddressEnum[] enums = [ LocationStreetAddressEnum.normal, LocationStreetAddressEnum.full ];
		return locationStreetAddress(choice(enums, this.rnd));
	}

	override string locationStreetAddress(LocationStreetAddressEnum which) {
		final switch(which) {
			case LocationStreetAddressEnum.normal: return locationStreet() ~ " " ~ locationBuildingNumber();
			case LocationStreetAddressEnum.full: return locationStreet() ~ " " ~ locationBuildingNumber() ~ " " ~ locationSecondaryAddress();
		}
		return "";
	}

	override string locationStreetName() {
		const string[] strs =
		[ q"{אבות ישורון}", q"{אביי}", q"{אגדיר}", q"{אגס}", q"{אגת-שבו}"
		, q"{אדוננו ברוך}", q"{אדיסון}", q"{אדמו"ר מפיטסבורג}"
		, q"{אהוד מנור}", q"{אהרונסון שרה}", q"{אוניון}", q"{אוסישקין מנחם}"
		, q"{אופל}", q"{אור לציון}", q"{אורט}", q"{אוריה החיתי}", q"{אזור בקמה}"
		, q"{אזור המרינה}", q"{אזור יא}", q"{אזורים}", q"{אחוזת בית}"
		, q"{אחימאיר אבא}", q"{אחלמה}", q"{אטלי}", q"{אידלסון בבה}"
		, q"{אל הציפור}", q"{אלבז נתן}", q"{אלברט איינשטיין}"
		, q"{אליאב לובה}", q"{אליאשוילי}", q"{אליעזר בן הורקנוס}"
		, q"{אלתרמן נתן}", q"{אמנון ליפקין שחק}", q"{אמרלד}", q"{אנילביץ מרדכי}"
		, q"{אסבסטונים}", q"{אפרים לנגסנר}", q"{אפרסמון}", q"{אפרסק}"
		, q"{אפרתי אליהו}", q"{אקסודוס}", q"{ארבע האמהות}", q"{אריק איינשטיין}"
		, q"{ארן זלמן}", q"{אשדוד}", q"{אשכולית}", q"{בבלי}", q"{בגין עליזה}"
		, q"{בובר מרטין}", q"{בוסקילה יצחק}", q"{בורחס חורחה}"
		, q"{בורלא יהודה}", q"{בטהובן}", q"{בית קנדה}", q"{בן אליעזר אריה}"
		, q"{בן ברוך אורי}", q"{בן דיוואן עמרם}", q"{בן הכט}", q"{בן יוסף שלמה}"
		, q"{בן עמי עובד}", q"{בעלי מלאכה}", q"{בקעת הירח}", q"{ברהמס}"
		, q"{ברוריה}", q"{ברק בן אבינועם}", q"{ג'ו עמר}", q"{גאפונוב}"
		, q"{גבעת יונה}", q"{גבעת עדה}", q"{גדרה}", q"{גוגול}", q"{גולדברג לאה}"
		, q"{גור דב}", q"{גור מרדכי}", q"{גטה}", q"{גיא אוני}", q"{גלעדי ישראל}"
		, q"{גרונר דב}", q"{גרינברג אורי צבי}", q"{גשר עד הלום}"
		, q"{דבורה עומר}", q"{דה וינצ'י}", q"{דוד אלעזר}", q"{דולומיט}"
		, q"{דן שומרון}", q"{ה' באייר}", q"{האדמו"ר מבעלז}", q"{האדמו"ר מגור}"
		, q"{האדמו"ר מויז'ניץ}", q"{האוניה}", q"{האופים}", q"{האר"י הקדוש}"
		, q"{האשכול}", q"{האשלג}", q"{הבטיחות}", q"{הבעל שם טוב}", q"{הבשור}"
		, q"{הגולשים}", q"{הגוררת}", q"{הגלימה}", q"{הגר"א}", q"{הדוברה}"
		, q"{הדולפין}", q"{ההגשמה}", q"{ההפלגה}", q"{הוסטל שלום}"
		, q"{החבצלות}", q"{החובלים}", q"{החולה}", q"{החניכים}", q"{החשמל}"
		, q"{הטיילת}", q"{היהלומים}", q"{היזמה}", q"{היידן}", q"{הימאים}"
		, q"{היציקה}", q"{הכתר}", q"{הלביאה}", q"{הלפרין ירמיהו}"
		, q"{המאבק}", q"{המברק}", q"{המגדלור}", q"{המגיד}", q"{המדע}", q"{המחקר}"
		, q"{המליץ}", q"{המלך אליקים}", q"{המלך אמציה}", q"{המלך אסא}"
		, q"{המלך דוד}", q"{המלך הדד}", q"{המלך חזקיה}", q"{המלך יהוא}"
		, q"{המלך יהואחז}", q"{המלך יהויכין}", q"{המלך יהושפט}"
		, q"{המלך יובב}", q"{המלך יותם}", q"{המלך ירבעם}", q"{המלך עזריה}"
		, q"{המלך עמרי}", q"{המלך רחבעם}", q"{המלך שאול}", q"{המלך שלמה}"
		, q"{המלכים}", q"{המסחר}", q"{המעבורת}", q"{המעגן}", q"{המפרץ}"
		, q"{המפרש}", q"{המצפן}", q"{המרי}", q"{המשקיף}", q"{המתכת}", q"{המתנדבים}"
		, q"{הנביא אליהו}", q"{הנביא אלישע}", q"{הנביא גד}", q"{הנביא דניאל}"
		, q"{הנביא הושע}", q"{הנביא זכריה}", q"{הנביא חבקוק}"
		, q"{הנביא חגי}", q"{הנביא יואל}", q"{הנביא יחזקאל}", q"{הנביא ירמיהו}"
		, q"{הנביא ישעיהו}", q"{הנביא מיכה}", q"{הנביא מלאכי}"
		, q"{הנביא נחום}", q"{הנביא נחמיה}", q"{הנביא נתן}", q"{הנביא עובדיה}"
		, q"{הנביא עמוס}", q"{הנביא צפניה}", q"{הנביא שמואל}"
		, q"{הנחושת}", q"{הנחשול}", q"{הנפט}", q"{הנשיא ויצמן}", q"{הסיפון}"
		, q"{הספנות}", q"{העוגן}", q"{העופרים}", q"{העופרת}", q"{העשרים ואחד}"
		, q"{הפריון}", q"{הצבי}", q"{הצוללים}", q"{הצורפים}", q"{הציונות}"
		, q"{הצפירה}", q"{הקדמה}", q"{הקיטור}", q"{הקליטה}", q"{הקריה-מגורים}"
		, q"{הקריה-מע"ר}", q"{הר אביטל}", q"{הר גלבוע}", q"{הר כרמל}"
		, q"{הר ציון}", q"{הר תבור}", q"{הראם}", q"{הרב אבן דנן}", q"{הרב אברמסקי}"
		, q"{הרב בוזגלו דוד}", q"{הרב בלולו}", q"{הרב הגר}", q"{הרב חיים שושנה}"
		, q"{הרב טייב}", q"{הרב יהושע מאמאן}", q"{הרב יורם אברג'ל}"
		, q"{הרב מימון}", q"{הרב משאש יוסף}", q"{הרב ניסים}", q"{הרב קלישר}"
		, q"{הרב רוזובסקי}", q"{הרב ריינס}", q"{הרב שאולי}", q"{הרי גולן}"
		, q"{הרי"ם לוין}", q"{הרמ"א}", q"{הרפואה}", q"{הרציף}", q"{השייטים}"
		, q"{התורן}", q"{התלמוד}", q"{התעסוקה}", q"{התקוה}", q"{התקשורת}"
		, q"{ואלוס}", q"{ואן גוך}", q"{וולפסון דוד}", q"{ויקטור הוגו}"
		, q"{ויתקין יוסף}", q"{ורדימון יצחק}", q"{זולה אמיל}"
		, q"{זייד אלכסנדר}", q"{זינגר בשביס}", q"{זכרון יעקב}"
		, q"{זלמן דוד לבונטין}", q"{זנגביל}", q"{חדרה}", q"{חולדה הנביאה}"
		, q"{הרצל}", q"{רוטשילד}", q"{חורי חיים}", q"{חזנוב עמרם}"
		, q"{חטיבת גבעתי}", q"{חטיבת יפתח}", q"{חטיבת כרמלי}"
		, q"{חיבת ציון}", q"{חיים ברלב}", q"{חיים הרצוג}", q"{חנינא בן דוסא}"
		, q"{חנקין יהושע}", q"{חסידי אומות העולם}", q"{חסן ובן גרה}"
		, q"{חרטום}", q"{טולסטוי}", q"{טשרניחובסקי}", q"{יאיר}", q"{יבנאל}"
		, q"{יגאל ידין}", q"{יד העפלה ממרוקו}", q"{יואב בן צרויה}"
		, q"{יואל משה סלומון}", q"{יוהנה זבוטינסקי}", q"{יוחנן בן זכאי}"
		, q"{יום טוב צמח}", q"{יונה הנביא}", q"{יוסי בנאי}", q"{יוסי בר חלפתא}"
		, q"{יוספטל}", q"{יורדי הסירה}", q"{ילין דוד}", q"{יסוד המעלה}"
		, q"{יעל}", q"{יפה ירקוני}", q"{יצחק אילן}", q"{יצחק הנשיא}"
		, q"{יצחק שמיר}", q"{יקינתון}", q"{ירמוך}", q"{ירקן}", q"{ישפה}"
		, q"{כ"ט בנובמבר}", q"{כוכב הדרום}", q"{כוכב הים}", q"{כוכב הצפון}"
		, q"{כוכב השחר}", q"{כינור}", q"{כפתור החולות}", q"{לוחמי האש}"
		, q"{לוי שלמה}", q"{לויתן}", q"{לילי}", q"{למרחב}", q"{מאיר בעל הנס}"
		, q"{מבצע ברק}", q"{מדרחוב הנביאים}", q"{מורדי הגטאות}"
		, q"{מזכרת בתיה}", q"{מטולה}", q"{מיכשוילי}", q"{מילמן}", q"{מיסטרל}"
		, q"{מכאל אנג'לו}", q"{מכולות}", q"{מנגו}", q"{מעגל השמחה}"
		, q"{מפקורה}", q"{מקוה ישראל}", q"{מקלנבורג}", q"{מרזוק ושמואל}"
		, q"{מרים הנביאה}", q"{מרכז קליטה שלום}", q"{משה לוי(מוישה וחצי)}"
		, q"{משמר הירדן}", q"{משמש}", q"{משנה}", q"{משעול האירוסים}"
		, q"{מתחם אלתא}", q"{נאות ספיר}", q"{נגרו אהרן}", q"{נהלל}"
		, q"{נוה דניה}", q"{נוה יהונתן}", q"{נוה ים}", q"{נופך}", q"{נחל דן}"
		, q"{נחל הליטני}", q"{נחמן מברסלב}", q"{ניסים חדד}", q"{נמל אשדוד}"
		, q"{נמלי ישראל}", q"{נס ציונה}", q"{סאלק יונה}", q"{סולד הנריטה}"
		, q"{סופר אברהם}", q"{סטרומה}", q"{סיטרין}", q"{סילבר אבא הלל}"
		, q"{סירקין נחמן}", q"{סלבדור}", q"{סמ אל הים}", q"{סמ יהואש}"
		, q"{סמטה א}", q"{סמטה ב}", q"{סמי אלמגריבי}", q"{סנפיר}", q"{ספיח}"
		, q"{עגנון שי}", q"{עדי עם שלום}", q"{עובדי הנמל}", q"{עוזי חיטמן}"
		, q"{עופר אברהם}", q"{עינבר}", q"{ענבים}", q"{עקביא בן מהללאל}"
		, q"{פאנצו}", q"{פארק השיטה המלבינה}", q"{פורצי הדרך}"
		, q"{פטדה}", q"{פיינברג יוסף}", q"{פן אלכסנדר}", q"{פנינה}"
		, q"{פסטר לואי}", q"{פרנק אנה}", q"{פתח תקווה}", q"{צאלים}"
		, q"{צדקת יוסף}", q"{צור הדסה}", q"{ציזלינג}", q"{צפת}", q"{קדושי בלזן}"
		, q"{קורל}", q"{קורצ'ק יאנוש}", q"{קישון}", q"{קמי אלברט}"
		, q"{קק"ל}", q"{קרית חרדים}", q"{קרית פוניבש}", q"{ראש פינה}"
		, q"{רב אשי}", q"{רב חיסדא}", q"{רב ינאי}", q"{רבא}", q"{רבי דוד אלקיים}"
		, q"{רבי דוד בן חסין}", q"{רבין יצחק}", q"{רבינא}", q"{רבנו גרשום}"
		, q"{רבנו וידל הצרפתי}", q"{רובינא חנה}", q"{רוגוזין}"
		, q"{רופין ארתור}", q"{רחל ינאית}", q"{רמברנדט}", q"{רנטגן}"
		, q"{רפאל איתן (רפול)}", q"{שאגל מארק}", q"{שאול בן שמחון}"
		, q"{שבט אשר}", q"{שבט בנימין}", q"{שבט גד}", q"{שבט דן}", q"{שבט זבולון}"
		, q"{שבט יהודה}", q"{שבט יוסף}", q"{שבט יששכר}", q"{שבט לוי}"
		, q"{שבט נפתלי}", q"{שבט ראובן}", q"{שבט שמעון}", q"{שבי ציון}"
		, q"{שגב}", q"{שהם}", q"{שובר הגלים}", q"{שועלי שמשון}", q"{שושנה דמארי}"
		, q"{שושנת הרוחות}", q"{שחם יואב}", q"{שילר}", q"{שכ ונטורה}"
		, q"{שלומציון המלכה}", q"{שלונסקי אברהם}", q"{שלזינגר ארווין}"
		, q"{שמואל הנגיד}", q"{שמר}", q"{שער האריות}", q"{שער הים}"
		, q"{שערי יושר}", q"{שפיה}", q"{שפירא משה חיים}", q"{שרה אמנו}"
		, q"{תחנת הכח}", q"{תיאודור רוזוולט}", q"{תנין}", q"{תפוז}"
		, q"{תש"ח}", q"{אהרון מאיר מזיא}", q"{בוקסר אהרון}", q"{בוקסר ירמיהו}"
		, q"{בית השיקום}", q"{בן אבי איתמר}", q"{בן יהודה אבנר}"
		, q"{בר-כוכבא}", q"{ברושים}", q"{גבעת האהבה}", q"{גבעת הצבר}"
		, q"{גבעת התור}", q"{גבעת מיכאל}", q"{גבעת נוף}", q"{גוטהלף שמואל}"
		, q"{גולדה מילוסלבסקי}", q"{גולי דמשק}", q"{גלילי}", q"{גני איריס}"
		, q"{דגל ישראל}", q"{גבעות הכורכר}", q"{הנפת הדגל}", q"{האלופים}"
		, q"{היימן ישראל}", q"{המאה ואחד}", q"{המזמרה}", q"{המנין הראשון}"
		, q"{הנבחרות}", q"{הרב בארי}", q"{הרב שאול אחרק}", q"{הרמן מאיר}"
		, q"{התרמ"ג}", q"{זמל זוסיא}", q"{טוקאן}", q"{טפר חיים}", q"{יואש}"
		, q"{כהנוב זאב}", q"{כחליל}", q"{ככר המיסדים}", q"{לחמי שלום}"
		, q"{לנדו דוד}", q"{לסקוב}", q"{לרר משה}", q"{מירון אליהו}"
		, q"{משחתת אילת}", q"{נווה כרמית}", q"{נחלת ראובן}", q"{נחמיאס שמואל}"
		, q"{סביוני הפארק}", q"{סביוני נצר}", q"{סלוביס שמואל}"
		, q"{סעדיה נחום}", q"{עונות השנה}", q"{עמק ההדרים}", q"{עמק השושנים}"
		, q"{פארק המדע}", q"{פייגה לרר}", q"{פלדמן יוסף}", q"{פנינה פצ'ורניק}"
		, q"{פניק דוד}", q"{פרופ אברהם פצ'ורניק}", q"{קוברסקי משה}"
		, q"{רופמן שמואל}", q"{רחבעם}", q"{שבועות}", q"{שמיד ישראל}"
		, q"{שקמים}", q"{א-דאמון}", q"{א-דוארה}", q"{א-דוראת}", q"{א-דורי}"
		, q"{א-דיר}", q"{א-דמידה}", q"{א-דמימי}", q"{א-דעקה}", q"{א-דראג'}"
		, q"{א-דרבאשי}", q"{א-זאהיריה}", q"{א-זאהר}", q"{א-זאוייה}"
		, q"{א-זוודאת}", q"{א-זיזפון}", q"{א-זייאן}", q"{א-זיין}", q"{א-זרזור}"
		, q"{א-זרעייה}", q"{א-זרקא}", q"{א-טאבר'ה}", q"{א-טאחונה}", q"{א-טבק}"
		, q"{א-טוואל}", q"{א-טיאר}", q"{א-טיור}", q"{א-טירה}", q"{א-לאתין}"
		, q"{א-לד}", q"{א-לור'ד}", q"{א-נבי סאלח}", q"{א-נוורס}", q"{א-נירוז}"
		, q"{א-נמוז}", q"{א-נעום}", q"{א-נפאפעה}", q"{א-סאפח}", q"{א-סבר}"
		, q"{א-סובאט}", q"{א-סוכר}", q"{א-סומאכ}", q"{א-סוקור}", q"{א-סורה}"
		, q"{א-סחאלי}", q"{א-סלבאק}", q"{א-סמארה}", q"{א-סנדייאנה}"
		, q"{א-ר'זאלי}", q"{א-רהו}", q"{א-רואפיד}", q"{א-רוג'ום}", q"{א-רחבאני}"
		, q"{א-רייאן}", q"{א-ריינה}", q"{א-שיח' אבו עלי נסר}", q"{א-שייח' אמין טריף}"
		, q"{א-שימאל}", q"{א-שעאע}", q"{א-ת'אמין מין אדאר}", q"{א-תומור}"
		, q"{א-תמור}", q"{א-תמר אל-הינדי}", q"{אבו א-סראיא}", q"{אבו אל-נג'ק}"
		, q"{אבו אל-קמח}", q"{אבו חרב}", q"{אבו מסנסל}", q"{אבו סברי חמדי}"
		, q"{אבו סמרה}", q"{אבו עפן}", q"{אבו שהאב}", q"{אבו שושי}"
		, q"{אגזם}", q"{אוול אייאר}", q"{אום א-זינאת}", q"{אום א-תות}"
		, q"{אום אלחממיס}", q"{אום אלסחאלי}", q"{אום אלפרג}", q"{אום רומאנה}"
		, q"{אום רושרוש}", q"{איבטין}", q"{איבן א-רושד}", q"{איבן אל-עמיד}"
		, q"{איברהים נימר חוסין}", q"{אילא הדאסה}", q"{אירביד}"
		, q"{אל-אבל}", q"{אל-אג'אס}", q"{אל-אדיב}", q"{אל-אום תריזא}"
		, q"{אל-איסכנדרייה}", q"{אל-אסאייל}", q"{אל-אפר'אני}", q"{אל-אר'אני}"
		, q"{אל-באב אל-ר'רבי}", q"{אל-באדייה}", q"{אל-בארוכ}", q"{אל-בוריני}"
		, q"{אל-בורתוקאל}", q"{אל-ביטריה}", q"{אל-ביירוני}", q"{אל-בלאט}"
		, q"{אל-בלח}", q"{אל-בס}", q"{אל-בקארה}", q"{אל-בראדיש}", q"{אל-ברי}"
		, q"{אל-ברר'ותי}", q"{אל-ג'ורן}", q"{אל-ג'יש}", q"{אל-ג'רוס}"
		, q"{אל-האשמי}", q"{אל-וז}", q"{אל-וליד}", q"{אל-ח'ולפא}", q"{אל-ח'וריה}"
		, q"{אל-ח'לאייל}", q"{אל-ח'מסה}", q"{אל-חאג'}", q"{אל-חבק}", q"{אל-חג'וג'}"
		, q"{אל-חג'יראת}", q"{אל-חדאד}", q"{אל-חולה}", q"{אל-חוסרי}"
		, q"{אל-חיזב}", q"{אל-חילף}", q"{אל-חלאג'}", q"{אל-חמאם}", q"{אל-חמדאני}"
		, q"{אל-חמיד}", q"{אל-חסבה}", q"{אל-חסרום}", q"{אל-ימן}", q"{אל-ירמוכ}"
		, q"{אל-כאברי}", q"{אל-כברה}", q"{אל-כוות'ר}", q"{אל-כוסברה}"
		, q"{אל-כמאני}", q"{אל-כמון}", q"{אל-כסאייר}", q"{אל-כסאראת}"
		, q"{אל-כסתנא}", q"{אל-כעביה}", q"{אל-כראג'}", q"{אל-כראוויה}"
		, q"{אל-כרוואן}", q"{אל-כרכ}", q"{אל-כרכס}", q"{אל-כתאב}", q"{אל-לג'ון}"
		, q"{אל-מבארקה}", q"{אל-מדאחל}", q"{אל-מדח'ל א-שרקי}", q"{אל-מדח'ל אל-ג'נובי}"
		, q"{אל-מהנא}", q"{אל-מונדיה}", q"{אל-מועלם בולוס}", q"{אל-מחאדד}"
		, q"{אל-מחפרה}", q"{אל-מטר}", q"{אל-מלעב א-רייאדי}", q"{אל-מנאג'ר}"
		, q"{אל-מנסורה}", q"{אל-מסלא}", q"{אל-מסלח'}", q"{אל-מעסרה}"
		, q"{אל-מר'אוור}", q"{אל-מר'ארבה}", q"{אל-מריכ}", q"{אל-משארף}"
		, q"{אל-משהד}", q"{אל-משמש}", q"{אל-נח'יל}", q"{אל-עהדה אל-עומרייה}"
		, q"{אל-עוכל}", q"{אל-פוסתוק}", q"{אל-קאהירה}", q"{אל-קרעאוי}"
		, q"{אל-ר'אזי}", q"{אל-ר'בראא}", q"{אל-ר'זאלייאת}", q"{אל-ר'ית}"
		, q"{אל-ר'נאמה}", q"{אל-ר'נטוס}", q"{אל-שוויקה}", q"{אלאקצה אלעמריה}"
		, q"{אלבורתקאל}", q"{אלברווה}", q"{אלברכה-העיר העתיקה}"
		, q"{אלברכוכ}", q"{אלבשת}", q"{אלג'עונה}", q"{אלדאהר}", q"{אלהוארה-העיר העתיקה}"
		, q"{אלוני}", q"{אלוער}", q"{אלח'לוה-העיר העתיקה}", q"{אלח'נדק-העיר העתיקה}"
		, q"{אלח'רוביה}", q"{אלחדת'ה}", q"{אלחרש}", q"{אליאכוכ}", q"{אליאס סלבאק}"
		, q"{אלכוטראן}", q"{אלכותר}", q"{אלכסאר}", q"{אלכסטל}", q"{אלכרך}"
		, q"{אלמדרסה אלת'נאויה}", q"{אלמוחסן}", q"{אלמכמאנה}"
		, q"{אלמכתב-העיר העתיקה}", q"{אלמנטאר}", q"{אלמנשיה}"
		, q"{אלמראח-העיר העתיקה}", q"{אלנאבלסי}", q"{אלנאעורה}"
		, q"{אלנאעמה}", q"{אלנבי רובין}", q"{אלסאלחה}", q"{אלסויד}"
		, q"{אלסמאן}", q"{אלסמיריה}", q"{אלסעדה}", q"{אלספאר}", q"{אלספרה}"
		, q"{אלסרג'את}", q"{אלע'אבסיה}", q"{אלעבאסיה}", q"{אלעבוד}"
		, q"{אלעג'וז}", q"{אלעואדיה}", q"{אלעטאריה}", q"{אלעין אלע'רבי}"
		, q"{אלעמאר}", q"{אלעמורי}", q"{אלעקבי}", q"{אלפאלוג'ה}", q"{אלפארסי}"
		, q"{אלפג'את}", q"{אלפואר מערבי}", q"{אלפורן}", q"{אלפל}", q"{אלפלפל}"
		, q"{אלפר}", q"{אלפראדה}", q"{אלפרהוד}", q"{אלקאק}", q"{אלקדומי}"
		, q"{אלקהווה}", q"{אלקוטראן}", q"{אלקלעה-העיר העתיקה}"
		, q"{אלקסארא אבן סיד}", q"{אלשבעאנה}", q"{אלשהאבי}", q"{אלשוהדא}"
		, q"{אלשוויכה}", q"{אלשונה}", q"{אלשופאניה}", q"{אלשיכון}"
		, q"{אלשכארה}", q"{אלשלבי}", q"{אלשנאר}", q"{אלשעבי}", q"{אלשרופיה}"
		, q"{אלשתיוי}", q"{אלתונה}", q"{אלתלאל א-סבע}", q"{אמיל גרינצוויג}"
		, q"{אסעד מנסור}", q"{אעולא}", q"{ארסלאן}", q"{באב א-דיר-עיר עתיקה}"
		, q"{באב אל-הווא}", q"{בדראן משיעל}", q"{בוקרשט}", q"{בורג' א-סוכר}"
		, q"{בטרירך כלימנסו בחות}", q"{ביאר אל-עדס}", q"{ביר אבו חוסין}"
		, q"{ביר אלסיכה}", q"{בית א-שעב}", q"{בית הקברות הדרוזי}"
		, q"{ביתהופן}", q"{בלד אלשיך}", q"{בנקוק}", q"{ג'בור יוסף ג'בור}"
		, q"{ג'בל א-טור}", q"{ג'בל אל-ערב}", q"{ג'דרו}", q"{ג'וב א-נח'ל}"
		, q"{ג'וב יוסף}", q"{ג'וויד}", q"{ג'וז אל-הינד}", q"{ג'ול ג'מאל}"
		, q"{ג'יפארא}", q"{ג'מילה בו חיירד}", q"{ג'עפר}", q"{גומיז}"
		, q"{גלידאן}", q"{גמל עבד אלנאסר}", q"{דאהור סלימאן תלחמי}"
		, q"{דאווד סלמאן תלחמי}", q"{דאחס}", q"{דהר אל-כניס}", q"{דוביאן}"
		, q"{דיר אלקאסי}", q"{דיר חנא}", q"{דלאתא}", q"{א-טייבה}", q"{אבו שאח}"
		, q"{אבו תאבת}", q"{אל-בורג'}", q"{אל-בירכה}", q"{אל-בסלייה}"
		, q"{אל-ווסטאני}", q"{אל-חי אל-אח'דר}", q"{אל-כרם}", q"{אל-מטלה}"
		, q"{אל-מידאן}", q"{אל-פוואר}", q"{אל-קלעה}", q"{אלחי אלח'דר}"
		, q"{אלשאהין}", q"{באב אלדיר}", q"{באב אלחואסל}", q"{ג'באתא}"
		, q"{ואדי א-סקיע}", q"{ואדי אל-חמאם}", q"{מדרסת אל-עין}"
		, q"{עג'רוש}", q"{עין עאפיה}", q"{דרע אל-משירפה}", q"{דרע מרשאן}"
		, q"{דרעא}", q"{הארון א-רשיד}", q"{הישאם א-שראבי}", q"{הראשון במאי}"
		, q"{ואדי א-סנע}", q"{ואדי אל-ג'מאל}", q"{ואדי אל-מלק}"
		, q"{ואדי בלאן}", q"{ואדי הושה}", q"{ואדי הושי}", q"{ואדי חנין}"
		, q"{ואדי סלאמי}", q"{ואן כוח'}", q"{ווערת ג'רוס}", q"{ויא תריסטי}"
		, q"{וערת אלמשאחר}", q"{וערת אלסובח}", q"{זאהר עומר א-זידאני}"
		, q"{זהר א-שריף}", q"{זהר אל-וסטאני}", q"{זהר אל-קלעה}"
		, q"{זהר חסן}", q"{זהר שרתא}", q"{זודאת אל-חריק}", q"{זומורוד}"
		, q"{זופא}", q"{זידאן סלאמה}", q"{זיתון אל-פרוטסטנט}"
		, q"{זמארין}", q"{זרעין}", q"{ח'דר אבו אל-עולא}", q"{ח'ירבת ג'דין}"
		, q"{ח'ירבת ח'ראזה}", q"{ח'לאייל א-נור}", q"{ח'לף אחמד א-סעידי}"
		, q"{ח'לת איר'ראב}", q"{ח'לת אלח'מאש}", q"{ח'לת אליהוד}"
		, q"{ח'לת אלעבהר}", q"{ח'לת אלעיאדה}", q"{ח'לת אלפארס}"
		, q"{ח'לת נסים}", q"{ח'ניפס}", q"{ח'ראמת אלדרוז}", q"{ח'ראמת אלמסיחיין}"
		, q"{ח'רדל}", q"{חאסביא}", q"{חאפז אברהים}", q"{חארת אבו רחמה}"
		, q"{חארת אלח'לווה}", q"{חארת אלמכתב}", q"{חארת אלמראח}"
		, q"{חארת באב אלחואסל}", q"{חג'ר אלנוס}", q"{חוסין עליאן}"
		, q"{חיילים משוחררים א+ב}", q"{חיילים משוחררים צפו}"
		, q"{חלים אבו רחמה}", q"{חמוד}", q"{חנא מויס}", q"{חנא סלימאן חדאד}"
		, q"{חנא עספור}", q"{חסן נימר חוסין}", q"{חסן סלאמה}", q"{ט'הר אלכניס}"
		, q"{טאחונת א-ראהיב}", q"{טואחין כורדאני}", q"{טובאס}"
		, q"{טנטורא}", q"{טראבין}", q"{טרביה}", q"{טרפא אבן אלעבד}"
		, q"{טרפה איבן אל-עבד}", q"{יוחנא בולוס א-ת'אני}", q"{יום אלארד'}"
		, q"{יוסף אידריס}", q"{יוסף כרכבי}", q"{יוסף סליבא}", q"{יני יני}"
		, q"{כאמלה מרושי}", q"{כוויכאת}", q"{כווכב}", q"{כוזברה}"
		, q"{כורדאני}", q"{כלת א-תון}", q"{כלת אלג'אמע}", q"{כפר לאם}"
		, q"{כפר סבת}", q"{כפר קדום}", q"{כראד אל-ח'יט}", q"{כרום אלענב}"
		, q"{כרם א-זייתון}", q"{כרם אלח'ורי}", q"{כרם ג'בור}", q"{לוביה}"
		, q"{לורד}", q"{לקייה}", q"{מאיר וילנר}", q"{מאר יוחנא אלמועמדאן}"
		, q"{מאראשון}", q"{מארון אלראס}", q"{מארתן לותר קינג}"
		, q"{מדרסת אל-בסלייה}", q"{מואיד אברהים}", q"{מוופק דיאב}"
		, q"{מוחמד אל-ענזה}", q"{מוחמד גמגום}", q"{מוחמד חמאדי}"
		, q"{מוחמד עבד אל-ווהאב}", q"{מועין בסיסו}", q"{מועתז}"
		, q"{מוצרט}", q"{מור'ור אלר'יט}", q"{מחמד חמודי}", q"{מחמוד דרוויש}"
		, q"{מיכאיל נועימה}", q"{מיסלון}", q"{מיעאר}", q"{מלבס}", q"{מנסור ארמלי}"
		, q"{מנסור כרדוש}", q"{מנסור קורטאם}", q"{מסכנא}", q"{מקאם א-שופה}"
		, q"{מרג' א-זוהור}", q"{מרג' עיון}", q"{מרים בוארדי}", q"{מרכז מסחר-ע עתיקה}"
		, q"{נאבולי}", q"{נאג'י אלעלי}", q"{נבטיה}", q"{נגיב נסאר}"
		, q"{נגראן}", q"{נוואר א-שמס}", q"{נועום אל-ג'ליל}", q"{ניקולא א-דור}"
		, q"{נלסון מנדילא}", q"{נעים קאסם נפאע}", q"{נעמה חוסין ח'אזם}"
		, q"{סאבא בחות'}", q"{סאבע סמא}", q"{סאברין}", q"{סבארתאכוס}"
		, q"{סבסטיא}", q"{סג'רת אל-יהוד}", q"{סובחי יאסין}", q"{סוואר א-ד'הב}"
		, q"{סופתעאדי}", q"{סליבא}", q"{סלימאן אבו עביד}", q"{סלימאן אל-ח'ורי}"
		, q"{סלפית}", q"{סעד זר'לול}", q"{סעד ח'ניפס}", q"{סעד נכד}"
		, q"{סעיד אחמד ח'טיב}", q"{ספסאף}", q"{ספרג'ל}", q"{סרקיס}"
		, q"{סת נזירה}", q"{ע'אבת טבעון}", q"{עארף עארף}", q"{עבאד א-שמס}"
		, q"{עבד א-נבי}", q"{עבד אל-חלים חאפז}", q"{עבד אלכרים אלכרמי}"
		, q"{עבד אלמלק}", q"{עבד אלקאדר אלגזארי}", q"{עבד אלרחים מחמוד}"
		, q"{עבד אלרחמן אלדאכל}", q"{עבדאללה בהיג'}", q"{עבדאללה חסון}"
		, q"{עבדאללה קדרי}", q"{עבלין}", q"{עבס}", q"{עווד}", q"{עומר אבן אלעאס}"
		, q"{עומר סעסעאני}", q"{עוסמאן}", q"{עוסמאן חוג'יראת}"
		, q"{עטא אלזיר}", q"{עיון קארא}", q"{עין אל-חמלה}", q"{עין סעיד}"
		, q"{עין קנביט}", q"{עין ר'זאל}", q"{עלי עאשור}", q"{עמקא}"
		, q"{ענזה}", q"{עסא א-ראעי}", q"{ערוס א-תורכמאן}", q"{פאטמה אלזהרא}"
		, q"{פואד חגאזי}", q"{פואד נסאר}", q"{פורט סעיד}", q"{פראדי}"
		, q"{פרח}", q"{צפד}", q"{קאסם אמין}", q"{קדיתא}", q"{קדמאני}", q"{קוסטנטין והילאנה}"
		, q"{קוריש}", q"{קיביה}", q"{קיס}", q"{ראם אללה}", q"{ראשד חוסין}"
		, q"{רדא עזאם}", q"{רויס}", q"{רשיד אל-ח'ורי}", q"{שבעא}", q"{שדאד}"
		, q"{שוכרי מבאריכי}", q"{שחאדה שחאדה}", q"{שיבלי אל-עריאן}"
		, q"{שכ א-טייבה}", q"{שכ אבו שח}", q"{שכ אבו תאבת}", q"{שכ אל-בורג'}"
		, q"{שכ אל-בסלייה}", q"{שכ אל-כאשף}", q"{שכ אל-מטלה}", q"{שכ אלחי אלח'דר}"
		, q"{שכ אלכרם}", q"{שכ ג'באתא}", q"{שכ ג'באתא מערבית}", q"{שכ ואדי אלחמאם}"
		, q"{שכ ואדי אלסקיע}", q"{שכ עין עאפיה}", q"{שכ שאהין-חסון}"
		, q"{שעאנין}", q"{שפיק עזאם}", q"{תבריז}", q"{תופיק טובי}"
		, q"{תין הלאל}", q"{תל א-דהב}", q"{תל א-זיב}", q"{תל א-נסים}"
		, q"{תל אל-קאדי}", q"{תל אלזבדה}", q"{תר'לב}", q"{אבא ושרה נאמן}"
		, q"{אבולעפיה רבקה ושלמה}", q"{אביאסף}", q"{אבינרי יצחק}"
		, q"{אביצור שמואל}", q"{אביתר}", q"{אבן ג'נאח}", q"{אברך ישעיהו}"
		, q"{אגדתי ברוך}", q"{אדיל עאזר}", q"{אדלר יש"י וברכה}"
		, q"{אדם ברוך}", q"{אדמון ידידייה}", q"{אהרון דוד גורדון}"
		, q"{אהרון טוב משה}", q"{אוארבך}", q"{אוגרית}", q"{אוז'שקובה}"
		, q"{אויסטרך דויד}", q"{אונטרמן איסר יהודה}", q"{אוניברסיטת תל -אביב}"
		, q"{אוניקובסקי פרץ}", q"{אופטושו יוסף}", q"{אופיר שייקה}"
		, q"{אורי}", q"{אוריאל אקוסטה}", q"{אורלוב חנה}", q"{אזור הספורט}"
		, q"{אזורי חן}", q"{אחילוף}", q"{אחימעץ}", q"{אחרון יוסף}"
		, q"{אטאטורק}", q"{אידלסון אברהם}", q"{אידלסון רחל ושמואל}"
		, q"{איזמוזי'ק לאה ודויד}", q"{אייבשיץ}", q"{איל"ן}", q"{איסקוב נסים}"
		, q"{איסרליש}", q"{איתיאל}", q"{איתין אהרון}", q"{אלביטר עבדאלראוף}"
		, q"{אלו מציאות}", q"{אלוף}", q"{אלוף בצלות}", q"{אלוף דן לנר}"
		, q"{אליאב בנימין}", q"{אליאש מרים}", q"{אליהו מפירארה}"
		, q"{אליוט ג'ורג'}", q"{אליעז רפאל}", q"{אליקום}", q"{אלישברג}"
		, q"{אלמוג דוד}", q"{אלעזר (רוקח)}", q"{אלעזר בן יוסי}"
		, q"{אלעזר בן עזריה}", q"{אלעזר בן צדוק}", q"{אלפרין חיים}"
		, q"{אנדרוס}", q"{אנטוקולסקי}", q"{אנטיגונוס}", q"{אנכי}"
		, q"{אפ"ק}", q"{אפטר יעקב}", q"{אפקים}", q"{אפשטיין יעקב}"
		, q"{אקסלרוד נתן}", q"{ארבר מנחם}", q"{ארטר יצחק}", q"{אריכא יוסף}"
		, q"{אריסטובול}", q"{ארלנג'ר}", q"{ארם משה}", q"{ארסטידס סוזה מנדס}"
		, q"{ארצי יצחק}", q"{אשרמן יוסף}", q"{באסולה}", q"{בארט}", q"{בובליק}"
		, q"{בובר שלמה}", q"{בוגרשוב}", q"{בויאר אברהם}", q"{בוני העיר}"
		, q"{בוסקוביץ}", q"{בוקי בן יגלי}", q"{בוקסנבאום יוסף}"
		, q"{בוקשפן דוד}", q"{בור נילס}", q"{בורמה}", q"{בחור אליהו}"
		, q"{ביירון}", q"{בילויה}", q"{בילטמור}", q"{בית החיים}", q"{בית הנוער}"
		, q"{בית חדש}", q"{בית יצקר}", q"{בית ירח}", q"{בית עולים שמעון}"
		, q"{בית פלט}", q"{בית קציר}", q"{בית רעים}", q"{ביתוס}", q"{בכורי ציון}"
		, q"{בלאס שמחה}", q"{בלוך דוד}", q"{בלומנפלד יהודה}", q"{בלקינד}"
		, q"{בלשן}", q"{בן אביגדור}", q"{בן אחיטוב}", q"{בן גל מיכאל}"
		, q"{בן גמליאל}", q"{בן דוד חיים}", q"{בן הלל מרדכי}", q"{בן זבארה}"
		, q"{בן חיל}", q"{בן חסד}", q"{בן יעקב}", q"{בן ישי}", q"{בן סירה יעקב}"
		, q"{בן עזרא}", q"{בן שפרוט}", q"{בנימיני אהרון}", q"{בסוק חיים מנחם דר'}"
		, q"{בעל העקידה}", q"{בר הופמן}", q"{בראלי}", q"{ברגי בנימין}"
		, q"{ברגנר אליזבת}", q"{ברודי}", q"{ברון עקיבא}", q"{ברוק צבי}"
		, q"{ברזאני משה}", q"{בריג אמיל}", q"{בריינין ראובן}"
		, q"{ברכיהו הנקדן}", q"{ברלין אליהו}", q"{ברלין ישעיהו}"
		, q"{ברלינר}", q"{ברנדט וילי}", q"{ברנט}", q"{ברנשטיין אדוארד}"
		, q"{ברנשטין כהן}", q"{ברסלבי יוסף}", q"{ברסקי יהודה לייב}"
		, q"{ברקאי שמואל}", q"{ברקוביץ}", q"{ברתנא מרדכי}", q"{בת מרים יוכבד}"
		, q"{בת עמי}", q"{בת ציון}", q"{גארי ברתיני}", q"{גבירטיג מרדכי}"
		, q"{גברן חליל גברן}", q"{גואל}", q"{גוז'קוב}", q"{גוטלובר}"
		, q"{גוטליב}", q"{גוטמאכר}", q"{גולדפאדן}", q"{גולי אריתראה}"
		, q"{גולינקין מרדכי}", q"{גופר}", q"{גורדון י ל}", q"{גורי ישראל}"
		, q"{גורלסקי ברוך}", q"{גורקי}", q"{גז מטילדה}", q"{גייגר}"
		, q"{גילוץ דבורה ומנחם}", q"{גינצבורג}", q"{גלאנץ לייב}"
		, q"{גלבלום אריה}", q"{גלזנר}", q"{גליצנשטין}", q"{גליקסברג}"
		, q"{גלעזר אליהו}", q"{גמזו חיים דר'}", q"{גני יהושע}"
		, q"{גני צהלה}", q"{גנני}", q"{גנתון}", q"{גר צדק}", q"{גרונימן}"
		, q"{גרטרוד קראוס}", q"{גרשום שלום}", q"{ד"ר כרמי יוגב}"
		, q"{ד"ר פלד רות}", q"{דאנטה}", q"{דב ממזריץ}", q"{דבלין אלפרד}"
		, q"{דה האז}", q"{דה וינצ'י לאונרדו}", q"{דה מודינה אריה}"
		, q"{דה פיג'וטו}", q"{דה פיליפ אדיס}", q"{דואר שושנה}"
		, q"{דוד רחל (שרעבי)}", q"{דוידקה}", q"{דוליצקי}", q"{דון-יחייא שבתי}"
		, q"{דונולו הרופא}", q"{דוש}", q"{די רוסי}", q"{דילה רינה יוסף}"
		, q"{דיסנצ'יק אריה}", q"{דיק}", q"{דני קיי}", q"{דנין}", q"{דעואל}"
		, q"{דר' מיכאלי יצחק}", q"{דרויאנוב}", q"{דריוס מיו}", q"{דריפוס}"
		, q"{דשבסקי}", q"{האוזנר דב}", q"{האחים אל כוויתי}", q"{האחים בילסקי}"
		, q"{האחים מסלאויטה}", q"{האלקושי}", q"{האספרגוס}", q"{הארון אל רשיד}"
		, q"{הגבור האלמוני}", q"{הגיחון}", q"{הגייסות}", q"{הגמנסיה העברית}"
		, q"{הדגה}", q"{הדר יוסף}", q"{הונא}", q"{הופמן יעקב}", q"{הופנקו משה}"
		, q"{הורודצקי}", q"{החזיון}", q"{החטה}", q"{החלפנים}", q"{הטית זין}"
		, q"{היהודי זיס}", q"{הייקל יוסף}", q"{היכל התלמוד}", q"{היסוד}"
		, q"{הירשביין}", q"{הלה טוני}", q"{הלוי ז'ק}", q"{הלוי משה}"
		, q"{הלענה}", q"{המבצעים}", q"{המגיד מדובנא}", q"{המכבש}"
		, q"{המלך חירם}", q"{המנוע}", q"{המערכה}", q"{המקצוע}", q"{המשלטים}"
		, q"{המשמר האזרחי}", q"{המתנדב}", q"{הנופש}", q"{הסבא משפולה}"
		, q"{הספינה}", q"{הפרטיזן היהודי}", q"{הצפון החדש}", q"{הצפון הישן}"
		, q"{הצרי}", q"{הקריה}", q"{הרב בידאני עובדיה}", q"{הרב גביזון חי}"
		, q"{הרב הלר חיים}", q"{הרב יעקב טראב}", q"{הרב פרידמן}"
		, q"{הרב צוברי יוסף}", q"{הרב רייפמן}", q"{הרב רפאל אנקאווא}"
		, q"{הרבי מבכרך}", q"{הרבי מויטבסק}", q"{הרבי מלילוב}"
		, q"{הרבי מפשיסחא}", q"{הרבי מקוטוב}", q"{הרבי מקוצק}"
		, q"{הרבי מקרלין}", q"{הרבסט קרול}", q"{הרה"ג מחבוב יחיא}"
		, q"{הרטגלס}", q"{הרכבי אברהם}", q"{הרנ"ה}", q"{הרץ יוסף צבי}"
		, q"{הש"ך}", q"{השופט נופך}", q"{השוק סמ}", q"{השחקנים}", q"{השיפון}"
		, q"{השכל}", q"{השנית}", q"{התחנה המרכזית החדשה}", q"{התחנה המרכזית הישנה}"
		, q"{התלמי יהושע}", q"{התניא}", q"{התעודה האדומה}", q"{התערוכה}"
		, q"{ואלין משה}", q"{וולמן יהודה}", q"{וורמיזה}", q"{ויזל}"
		, q"{ויטלה מאוריציו}", q"{וייז ג'ורג'}", q"{ויינר זאב}"
		, q"{ויינשל}", q"{וייס אייזיק הירש}", q"{ויל קורט}", q"{וילון}"
		, q"{וילנא}", q"{וינשטיין נחום}", q"{ויסבורג חיים}", q"{ויסוצקי}"
		, q"{ויסר חנה ויעקב}", q"{וכטנגוב}", q"{ולבה יואל}", q"{ולנסיה}"
		, q"{וסרמן יעקב}", q"{ועידת קטוביץ}", q"{וקנין רפי}", q"{ורדיאל}"
		, q"{ורשבסקי}", q"{ותיק}", q"{ז'ורס ז'אן}", q"{זאבי רחבעם (גנדי)}"
		, q"{זבד}", q"{זולצר}", q"{זטורי משה}", q"{זיו רבקה}", q"{זימן}"
		, q"{זינגר בשביס יצחק}", q"{זיע"א יוסף חיים}", q"{זכרון קדושים}"
		, q"{זכריני}", q"{זלוציסטי}", q"{זלטופולסקי}", q"{זליבנסקי}"
		, q"{זליג}", q"{זליגמן מקס}", q"{זמר חנה}", q"{זעירא מרדכי}"
		, q"{זרח}", q"{זרעים}", q"{חבר הלאומים}", q"{חברה חדשה}", q"{חבשוש חיים}"
		, q"{חדד סעדיא}", q"{חוף גורדון}", q"{חופשי דוד}", q"{חזק}"
		, q"{חיוג יהודה}", q"{חיותמן}", q"{חייבי משה}", q"{חיים ואלישע}"
		, q"{חיל המשמר}", q"{חילו יצחק}", q"{חירותנו}", q"{חכמי אתונה}"
		, q"{חכמי דוד}", q"{חכמי קירואן}", q"{חלד יוסף}", q"{חנוך}"
		, q"{חנינא בן תרדיון}", q"{חסידי האומות}", q"{חפץ ישה}"
		, q"{חרוץ}", q"{חריף אייזיק}", q"{טאגור רבינדרנארט}", q"{טברסקי}"
		, q"{טג'יר שמואל וסולטנה}", q"{טוביה הרופא}", q"{טובים עמנואל}"
		, q"{טוכולסקי קורט}", q"{טולוז}", q"{טולקובסקי}", q"{טור מלכא}"
		, q"{טורטשינר}", q"{טורקוב זיגמונד}", q"{טייגר היל}", q"{טימן יעקב}"
		, q"{טריטש}", q"{טרפון}", q"{טשרנא}", q"{יד המעביר}", q"{ידעיה הפניני}"
		, q"{יהודה החסיד}", q"{יהודה הימית}", q"{יהודה הצעיר}"
		, q"{יהודה מרגוזה}", q"{יהושע בן פרחיה}", q"{יהל"ל}", q"{יוחננוף כהן שמואל}"
		, q"{יום טוב}", q"{יון מצולה}", q"{יונדב}", q"{יוניצ'מן}", q"{יונתן הופסי}"
		, q"{יוסט}", q"{יוסי ידין}", q"{יוסף אליהו}", q"{יוסף האפרתי}"
		, q"{יועזר איש הבירה}", q"{יורה}", q"{יורם}", q"{יורם קניוק}"
		, q"{יזהר}", q"{יטבת}", q"{ילין מור נתן}", q"{ימין}", q"{יעוד ודרך}"
		, q"{יעקב ג'ורג' חנאניא}", q"{יעקב שבתאי}", q"{יעקובוב אוריאל}"
		, q"{יפה בצלאל}", q"{יפו העתיקה}", q"{יפת}", q"{יצחק (זיקו) גרציאני}"
		, q"{יקותיאל}", q"{יקותיאלי יוסף}", q"{יקנעם}", q"{ירבלום מרק}"
		, q"{יש"ר מקנדיא}", q"{ישיבת וולוז'ין}", q"{ישכון}", q"{ישעיהו ליבוביץ}"
		, q"{ישראל טל}", q"{ישראל מריז'ין}", q"{ישראלי יצחק}", q"{ישראליס}"
		, q"{יששכרוב חי}", q"{כ"ץ בן ציון}", q"{כ"ץ יעקב יוסף}"
		, q"{כהן הרמן}", q"{כהן עופר}", q"{כהנשטם}", q"{כוכבי יצחק}"
		, q"{כפר שלם}", q"{כצנלסון בת שבע}", q"{כרם התימנים}", q"{כרם חמד}"
		, q"{כרמי דב}", q"{לאן א}", q"{לאן ב}", q"{לב אברהם}", q"{לבלוב}"
		, q"{לבנדה}", q"{לבנדובסקי}", q"{לבני איתן}", q"{לה גארדיה}"
		, q"{לואי מרשל}", q"{לודויפול}", q"{לוזים}", q"{לוי שלום אהרון}"
		, q"{לויד ג'ורג'}", q"{לויטן יצחק}", q"{לוין קיפניס}", q"{לוין שלום}"
		, q"{לוינסון אברהם}", q"{לונדון בצלאל}", q"{לחובר}", q"{לטריס}"
		, q"{ליב בן שרה}", q"{ליבנה אליעזר}", q"{ליברמן}", q"{ליוויק}"
		, q"{ליכטר יהושע}", q"{לילי מנחם}", q"{לינקאוס יוסף פופר}"
		, q"{ליענר שלמה}", q"{למואל}", q"{למרטין}", q"{לסקר}", q"{לפין}"
		, q"{לצרוס משה}", q"{לקרט}", q"{מאור הגולה}", q"{מאור משה}"
		, q"{מאור עינים}", q"{מאייר מרדכי}", q"{מאירבר}", q"{מבחר}"
		, q"{מבשר}", q"{מגדל שרשן}", q"{מגדלי נאמן}", q"{מגן אברהם}"
		, q"{מד אנדרומדה}", q"{מדמון מנחם}", q"{מדרש פנחס}", q"{מדרש תנחומא}"
		, q"{מהלל העדני}", q"{מהרש"א}", q"{מוהר יחיאל}", q"{מוזיר יעקב}"
		, q"{מוזס ולטר}", q"{מוזס יהודה ונח}", q"{מויאל אהרון}"
		, q"{מונאש}", q"{מוסינזון}", q"{מוקדי משה}", q"{מורד הטיילת}"
		, q"{מורה נבוכים}", q"{מוריץ דניאל}", q"{מושיע}", q"{מזל סרטן}"
		, q"{מחנה אריאל}", q"{מחנה יוסף}", q"{מחפוז נג'יב}", q"{מטלון}"
		, q"{מטמון כהן}", q"{מיזאן}", q"{מייטוס אליהו}", q"{מיכאל (נאמן)}"
		, q"{מיכאל אנג'לו}", q"{מילוא יוסף}", q"{מילר כהן אניטה}"
		, q"{מימון שלמה}", q"{מינקובסקי}", q"{מיצקביץ אדם}", q"{מיקוניס שמואל}"
		, q"{מכלל יופי}", q"{מל"ן}", q"{מלבי"ם}", q"{מלון אורה}", q"{מלון אסטור}"
		, q"{מלון בזל}", q"{מלון ימית}", q"{מלון מנדרין}", q"{מלון קרלטון}"
		, q"{מלקוש}", q"{מנדלקרן}", q"{מנדלר אלברט אברהם}", q"{מנדלשטם}"
		, q"{מנדלשטם אוסיפ}", q"{מנורת המאור}", q"{מניה וישראל}"
		, q"{מנשה בן ישראל}", q"{מע א כ שלם}", q"{מע ב כ שלם}", q"{מע יד המעביר}"
		, q"{מעונות אוניברסיטה}", q"{מעלה שמיר משה}", q"{מעפילי סלואדור}"
		, q"{מקס ברוד}", q"{מקראי קדש}", q"{מרד גטו ורשה}", q"{מרדור מוניה}"
		, q"{מרדכי (מוטה) גור}", q"{מרזוק ועזר}", q"{מרזוק מחמד}"
		, q"{מרכז גולדה מאיר}", q"{מרכז הירידים}", q"{מרכז רפואי סוראסקי}"
		, q"{מרכלת}", q"{מרמורק}", q"{מרסל ינקו}", q"{מרק יעקב}", q"{מרקיש פרץ}"
		, q"{משה (שלוש)}", q"{משה בריל בר-כוכבא}", q"{משה ז"ק}", q"{משל ירוחם}"
		, q"{משעול שירה}", q"{משעול שמידט יוסף}", q"{משפחת חלפי}"
		, q"{מתחם התחנה(מנשייה)}", q"{מתחם שטח נמל ת"א}", q"{מתתיהו כהן גדול}"
		, q"{נ"א (כפר שלם)}", q"{נאדיה חילו}", q"{נאמן יובל פרופ'}"
		, q"{נוה אליעזר}", q"{נוה ברבור}", q"{נוה כפיר}", q"{נוה תקוה}"
		, q"{נווה דן}", q"{נווה עופר}", q"{נוזהה}", q"{נוריאל}", q"{נח}"
		, q"{נחלאות}", q"{ניסן כהן}", q"{ניר אביב}", q"{נמירובר}", q"{נמל יפו}"
		, q"{נמרי דוידקה}", q"{נס לגויים}", q"{נסאר ג'ורג'}", q"{נפחא יצחק}"
		, q"{נרדור}", q"{נרדי נחום}", q"{נשרי צבי}", q"{נתיבי איילון דרום}"
		, q"{נתיבי איילון צפון}", q"{נתן החכם}", q"{סאמט שמעון}"
		, q"{סגל ירושלים}", q"{סגל צבי הרמן}", q"{סגל שמוליק}"
		, q"{סוגיהרה סמפו}", q"{סוטין}", q"{סומו יהודה}", q"{סומקן}"
		, q"{סוסליק אריה}", q"{סוסקין אברהם}", q"{סחרוב אנדרי}"
		, q"{סטארה אלברט}", q"{סטוצ'בסקי יהויכין}", q"{סטימצקי}"
		, q"{סי אנד סאן}", q"{סילמן יהודה קדיש}", q"{סימן טוב}"
		, q"{סירני חיים}", q"{סלואדור}", q"{סלונימסקי}", q"{סלסלה}"
		, q"{סלע יעקב}", q"{סלע עמנואל}", q"{סנהדראי טובה}", q"{ספיר אליהו}"
		, q"{ספיר ברוך}", q"{סשא ארגוב}", q"{ע הלל}", q"{עבאס אברהם}"
		, q"{עבד אל-גני}", q"{עברי}", q"{עוזר}", q"{עולי ציון}", q"{עזאי}"
		, q"{עזריה מן האדומים}", q"{עין זיתים}", q"{עין חרוד}"
		, q"{עיר שמש}", q"{על פרשת דרכים}", q"{עם ישראל חי}", q"{עמדן יעקב}"
		, q"{עמיקם אליהו (קשאק)}", q"{עמירן עמנואל}", q"{עמנואל הרומי}"
		, q"{עקיבא אריה}", q"{פארק צ'ארלס קלור}", q"{פברגט אנריקה}"
		, q"{פוזננסקי שמואל}", q"{פוחובסקי אריה}", q"{פוירשטיין אמיל}"
		, q"{פומרוק יוסף}", q"{פוריה}", q"{פושקין}", q"{פטאי יוסף}"
		, q"{פייר מנדס פרנס}", q"{פילון}", q"{פיליכובסקי}", q"{פילץ אריה}"
		, q"{פין}", q"{פישמן מימון}", q"{פלדרמן וילהלם}", q"{פלטיאל}"
		, q"{פליטי הספר}", q"{פלקירה}", q"{פנואל}", q"{פנחס בן יאיר}"
		, q"{פנץ נתן}", q"{פסטלוצי}", q"{פסטרנק אריה}", q"{פעמוני יוסף}"
		, q"{פראנצויז}", q"{פראנקל}", q"{פרופ' פנינה זלצמן}", q"{פרוץ לאו}"
		, q"{פרחי אביב}", q"{פרי עץ חיים}", q"{פרידלנד צבי}", q"{פרידמן שרגא}"
		, q"{פרייגרזון צבי}", q"{פריש דניאל}", q"{פרלוק משה}"
		, q"{פרלשטיין יצחק}", q"{פרלשטיין פסיה ויעקב}", q"{פרנץ קפקא}"
		, q"{פרנקפורט}", q"{פתחיה מרגנשבורג}", q"{צ'מרינסקי ברוך}"
		, q"{צ'רטוק שמשון}", q"{צ'רצ'יל וינסטון}", q"{צבי צור (צ'רה)}"
		, q"{צדוק הכהן}", q"{צהלון הרופא}", q"{צוויג סטפן}", q"{צויפל}"
		, q"{צונזר}", q"{צונץ}", q"{צורישדי}", q"{ציהתל"י}", q"{צימפל פרידריך}"
		, q"{צלאן פאול}", q"{צלילי חנינא}", q"{צמח דוד}", q"{צמחי היהודים}"
		, q"{צנובר}", q"{ק"ם}", q"{קאונטרי קלאב}", q"{קדמוני אסא}"
		, q"{קדמיאל}", q"{קהילת אודסה}", q"{קהילת אוסטרליה}", q"{קהילת בודפסט}"
		, q"{קהילת ביאליסטוק}", q"{קהילת ברזיל}", q"{קהילת בריסק}"
		, q"{קהילת ונציה}", q"{קהילת ז'יטומיר}", q"{קהילת זגלביה}"
		, q"{קהילת טשרנוביץ}", q"{קהילת יאסי}", q"{קהילת לבוב}"
		, q"{קהילת מכסיקו}", q"{קהילת סאלוניקי}", q"{קהילת סופיה}"
		, q"{קהילת עדן}", q"{קהילת פאדובה}", q"{קהילת פוזנא}"
		, q"{קהילת קובנה}", q"{קהילת קיוב}", q"{קהילת קישינוב}"
		, q"{קהילת קליבלנד}", q"{קהילת קנדה}", q"{קהילת קרקוב}"
		, q"{קהילת ריגא}", q"{קומפרט}", q"{קוסובסקי}", q"{קוץ' אדוארד}"
		, q"{קור פאול}", q"{קורולנקו}", q"{קורין עזרא}", q"{קורקידי}"
		, q"{קיוסו אלברט}", q"{קיכלר זילברמן לנה}", q"{קיציס יוסף}"
		, q"{קלונימוס}", q"{קליי}", q"{קלין רלף}", q"{קלמר משה}", q"{קלצ'קין}"
		, q"{קמואל}", q"{קמינסקה}", q"{קנטור}", q"{קפאח יחיה}", q"{קפלן יעקב ד"ר}"
		, q"{קפלן שלמה}", q"{קרוא ברוך}", q"{קרויס}", q"{קריגר משה}"
		, q"{קרית המוזיאונים}", q"{קרית עתידים}", q"{קרית שאול}"
		, q"{קרמניצקי}", q"{קרשקש חסדאי}", q"{ראסין ז'אן}", q"{רב אלוף דוד אלעזר}"
		, q"{רב אלוף יעקב דורי}", q"{רבי אדא}", q"{רבי אחא}", q"{רבי יוחנן}"
		, q"{רבי נחמן}", q"{רבי פנחס}", q"{רבי תנחום}", q"{רבינוביץ שפ"ר}"
		, q"{רבנו חננאל}", q"{רבנו ירוחם}", q"{רדינג}", q"{רובין שלמה}"
		, q"{רובינשטיין יצחק}", q"{רוזוב}", q"{רוזין יהושע}", q"{רוזנבאום}"
		, q"{רוזנבלט צבי}", q"{רוזנפלד שלום}", q"{רוזנשטיין אברהם}"
		, q"{רויגו אברהם}", q"{רומן רולן}", q"{רומנו}", q"{רומנילי}"
		, q"{רוני}", q"{רוסלאן}", q"{רופא המחתרות}", q"{רזי}", q"{רחבת מרטון ארנסט}"
		, q"{רטוש יונתן}", q"{רי"ז}", q"{ריבולוב מנחם}", q"{רייך}"
		, q"{רילף יצחק}", q"{רינהרט מקס}", q"{ריש גלותא}", q"{רכטר זאב}"
		, q"{רמת הטייסים}", q"{רצאבי זכריה}", q"{רצון}", q"{רציף הירקון}"
		, q"{רציף הרברט סמואל}", q"{רקנאטי}", q"{רשף}", q"{ש"בי יעקב מאור}"
		, q"{ש"ץ}", q"{שביב}", q"{שבלים}", q"{שבע השקמים}", q"{שגאל מרק}"
		, q"{שוהם מתתיהו}", q"{שוהם צילה}", q"{שויצר דוביד}", q"{שולמן}"
		, q"{שונצינו}", q"{שוסטקוביץ דימיטרי}", q"{שוקן}", q"{שורר חיים}"
		, q"{שטח התערוכה הישנה}", q"{שטיבל}", q"{שטיינר}", q"{שטינמן}"
		, q"{שטינשנידר}", q"{שטרן אברהם (יאיר)}", q"{שטרן איזק}"
		, q"{שטרנהרץ}", q"{שי"ר}", q"{שיינקין}", q"{שינמן פנחס}", q"{שיק}"
		, q"{שכ אבו כביר}", q"{שכ ביצרון}", q"{שכ גב אלישיב}", q"{שלבים}"
		, q"{שלושת החיצים}", q"{שלזינגר}", q"{שם הגדולים}", q"{שמואל בן עדיה}"
		, q"{שמואל ירחינאי}", q"{שמי יחיאל}", q"{שמעון בן זומא}"
		, q"{שמעון בן עזאי}", q"{שניצלר}", q"{שניצר שמואל}", q"{שערי ניקנור}"
		, q"{שפיר קליין}", q"{שפע טל}", q"{שפתי ישנים}", q"{שץ גגה גרשון}"
		, q"{שרון אריה}", q"{שרים אליהו הרב}", q"{שרמן משה}", q"{שרשים}"
		, q"{ששון}", q"{שתי האחיות}", q"{תג'ר ציונה}", q"{תוספתא}"
		, q"{תל גבורים}", q"{תמריר}", q"{תעוז}", q"{תרדיון}", q"{תרפ"א}"
		, q"{תרפט}", q"{תשבי}" ];

		return choice(strs, this.rnd);
	}

	override string locationStreetPattern() {
		final switch(uniform(0, 1, this.rnd)) {
			case 0: return locationStreetPrefix() ~ " " ~ locationStreetName();
		}
		return "";
	}

	string locationStreetPrefix() {
		const string[] strs =
		[ q"{רחוב}", q"{שדרות}", q"{משעול}", q"{דרך}", q"{סמטת}" ];

		return choice(strs, this.rnd);
	}

	override string loremWords() {
		const string[] strs =
		[ q"{לורם}", q"{איפסום}", q"{דולור}", q"{סיט}", q"{אמט}", q"{קונסקטורר}"
		, q"{אדיפיסינג}", q"{אלית}", q"{צש}", q"{בליא}", q"{מנסוטו}", q"{צמלח}"
		, q"{לביקו}", q"{ננבי}", q"{צמוקו}", q"{בלוקריה}", q"{שיצמה}", q"{ברורק}"
		, q"{נולום}", q"{ארווס}", q"{סאפיאן}", q"{פוסיליס}", q"{קוויס}"
		, q"{אקווזמן}", q"{קוואזי}", q"{במר}", q"{מודוף}", q"{אודיפו}"
		, q"{בלאסטיק}", q"{מונופץ}", q"{קליר}", q"{בנפת}", q"{נפקט}", q"{למסון}"
		, q"{בלרק}", q"{וענוף}", q"{לפרומי}", q"{בלוף}", q"{קינץ}", q"{תתיח}"
		, q"{לרעח}", q"{לת}", q"{צשחמי}", q"{סחטיר}", q"{בלובק}", q"{תצטנפל}"
		, q"{בלינדו}", q"{למרקל}", q"{אס}", q"{לכימפו}", q"{דול}", q"{צוט}"
		, q"{ומעיוט}", q"{לפתיעם}", q"{ברשג}", q"{ולתיעם}", q"{גדדיש}"
		, q"{קוויז}", q"{דומור}", q"{ליאמום}", q"{בלינך}", q"{רוגצה}", q"{לפמעט}"
		, q"{מוסן}", q"{מנת}", q"{הועניב}", q"{היושבב}", q"{שערש}", q"{שמחויט}"
		, q"{שלושע}", q"{ותלברו}", q"{חשלו}", q"{שעותלשך}", q"{וחאית}"
		, q"{נובש}", q"{ערששף}", q"{זותה}", q"{מנק}", q"{הבקיץ}", q"{אפאח}"
		, q"{דלאמת}", q"{יבש}", q"{כאנה}", q"{ניצאחו}", q"{נמרגי}", q"{שהכים}"
		, q"{תוק}", q"{הדש}", q"{שנרא}", q"{התידם}", q"{הכייר}", q"{וק}", q"{קולהע}"
		, q"{צופעט}", q"{למרקוח}", q"{איבן}", q"{איף}", q"{ברומץ}", q"{כלרשט}"
		, q"{מיחוצים}", q"{קלאצי}", q"{}", q"{סת}", q"{אלמנקום}", q"{ניסי}"
		, q"{נון}", q"{ניבאה}", q"{דס}", q"{איאקוליס}", q"{וולופטה}", q"{דיאם}"
		, q"{וסטיבולום}", q"{אט}", q"{קראס}", q"{אגת}", q"{לקטוס}", q"{וואל}"
		, q"{אאוגו}", q"{סוליסי}", q"{טידום}", q"{בעליק}", q"{קונדימנטום}"
		, q"{קורוס}", q"{בליקרה}", q"{נונסטי}", q"{קלובר}", q"{בריקנה}"
		, q"{סטום}", q"{לפריקך}", q"{תצטריק}", q"{לרטי}" ];

		return choice(strs, this.rnd);
	}

	override string musicGenre() {
		const string[] strs =
		[ q"{רוק}", q"{רוק מטאלי}", q"{פופ}", q"{אלקטרוני}", q"{מוזיקת עם}"
		, q"{מוזיקת עולם}", q"{קאנטרי}", q"{ג'אז}", q"{פאנק}", q"{נשמה}"
		, q"{היפ הופ}", q"{קלאסית}", q"{לטינית}", q"{רגאיי}", q"{במה ומסך}"
		, q"{בלוז}", q"{לא מוסיקה}", q"{ראפ}", q"{טראנס}", q"{האוס}" ];

		return choice(strs, this.rnd);
	}

	override string personFemaleFirstName() {
		const string[] strs =
		[ q"{אביב}", q"{אביבית}", q"{אביגיל}", q"{אביה}", q"{אביטל}", q"{אבישג}"
		, q"{אגם}", q"{אדווה}", q"{אדל}", q"{אדר}", q"{אהבה}", q"{אודיה}", q"{אודליה}"
		, q"{אווה}", q"{אופיר}", q"{אופירה}", q"{אופל}", q"{אופק}", q"{אור}"
		, q"{אורטל}", q"{אורי}", q"{אוריה}", q"{אורית}", q"{אורלי}", q"{אושרי}"
		, q"{איב}", q"{איה}", q"{איילה}", q"{איילת}", q"{אילנה}", q"{אילנית}"
		, q"{אימרי}", q"{אירית}", q"{אלה}", q"{אלומה}", q"{אליאנה}", q"{אליה}"
		, q"{אלין}", q"{אלינור}", q"{אליענה}", q"{אלירז}", q"{אלישבע}"
		, q"{אלכס}", q"{אלמוג}", q"{אמונה}", q"{אמור}", q"{אן}", q"{אנאבל}"
		, q"{אנה}", q"{אסיף}", q"{אסנת}", q"{אסתר}", q"{אפיק}", q"{אפריל}", q"{אפרת}"
		, q"{אראלה}", q"{ארבל}", q"{אריאל}", q"{אריאלה}", q"{אריאנה}", q"{ארייה}"
		, q"{בארי}", q"{בל}", q"{בלה}", q"{בר}", q"{ברית}", q"{ברקת}", q"{בת}", q"{בת אל}"
		, q"{בת חן}", q"{בת שבע}", q"{בתיה}", q"{גאיה}", q"{גבריאל}", q"{גבריאלה}"
		, q"{גוון}", q"{ג'וי}", q"{ג'ון}", q"{גוני}", q"{גורן}", q"{גיל}", q"{גילי}"
		, q"{גילת}", q"{גל}", q"{גלי}", q"{גליה}", q"{גלית}", q"{גפן}", q"{דבורה}"
		, q"{דגן}", q"{דגנית}", q"{דור}", q"{דורון}", q"{דורין}", q"{דורית}"
		, q"{דיאנה}", q"{דינה}", q"{דליה}", q"{דנה}", q"{דניאל}", q"{דניאלה}"
		, q"{דנית}", q"{דפנה}", q"{דקל}", q"{דקלה}", q"{הגר}", q"{הדס}", q"{הדסה}"
		, q"{הדר}", q"{הודיה}", q"{הילה}", q"{הלל}", q"{ויויאן}", q"{ויטה}"
		, q"{ויקטוריה}", q"{ורד}", q"{זהבה}", q"{זוהר}", q"{זיו}", q"{חגית}"
		, q"{חושן}", q"{חיננית}", q"{חירות}", q"{חמוטל}", q"{חן}", q"{חנה}"
		, q"{חנית}", q"{טובה}", q"{טופז}", q"{טל}", q"{טלי}", q"{טליה}", q"{טנא}"
		, q"{יהב}", q"{יהודית}", q"{יהל}", q"{יהלום}", q"{יהלי}", q"{יובל}"
		, q"{יודפת}", q"{יוכבד}", q"{יוליה}", q"{יונית}", q"{יונת}", q"{ים}"
		, q"{ימית}", q"{יסכה}", q"{יסמין}", q"{יעל}", q"{יעלה}", q"{יערה}", q"{יפה}"
		, q"{יפית}", q"{יפעת}", q"{ירדן}", q"{כוכב}", q"{כליל}", q"{כרם}", q"{כרמי}"
		, q"{כרמית}", q"{כרמל}", q"{לאה}", q"{לבנה}", q"{לוטם}", q"{לוטן}", q"{לוסי}"
		, q"{לי}", q"{ליאור}", q"{ליאורה}", q"{ליאל}", q"{ליאם}", q"{ליאן}"
		, q"{ליאת}", q"{ליב}", q"{ליבי}", q"{לידור}", q"{ליה}", q"{ליהיא}", q"{ליזה}"
		, q"{ליטל}", q"{לילי}", q"{ליליה}", q"{לילך}", q"{לימור}", q"{ליעד}"
		, q"{ליר}", q"{לירון}", q"{לירז}", q"{לירן}", q"{לשם}", q"{מאור}", q"{מאי}"
		, q"{מאיה}", q"{מגי}", q"{מגל}", q"{מור}", q"{מוריה}", q"{מורן}", q"{מיה}"
		, q"{מיטב}", q"{מיטל}", q"{מיכאל}", q"{מיכאלה}", q"{מיכל}", q"{מיקה}"
		, q"{מירן}", q"{מלכה}", q"{מעיין}", q"{מצדה}", q"{מרב}", q"{מריה}", q"{מרים}"
		, q"{מרינה}", q"{מתנה}", q"{מתת}", q"{נאוה}", q"{נגה}", q"{נוי}", q"{נויה}"
		, q"{נועה}", q"{נועם}", q"{נופר}", q"{נורית}", q"{נטלי}", q"{נטע}", q"{נטעלי}"
		, q"{ניב}", q"{נילי}", q"{נינט}", q"{ניצן}", q"{נעמה}", q"{נעמי}", q"{נרי}"
		, q"{נריה}", q"{סביון}", q"{סהר}", q"{סול}", q"{סופיה}", q"{סיגלית}"
		, q"{סיון}", q"{סמדר}", q"{ספיר}", q"{סשה}", q"{סתיו}", q"{עדי}", q"{עדן}"
		, q"{עדנה}", q"{עומר}", q"{עופרי}", q"{עיינה}", q"{עינב}", q"{עינת}"
		, q"{עלמא}", q"{עלמה}", q"{עמית}", q"{עמליה}", q"{עמנואל}", q"{ענבל}"
		, q"{ענבר}", q"{ענהאל}", q"{ענת}", q"{עפרה}", q"{ערגה}", q"{פלג}", q"{צאלה}"
		, q"{צוף}", q"{צופיה}", q"{צליל}", q"{צמרת}", q"{קורין}", q"{קורל}"
		, q"{קטיה}", q"{קליה}", q"{קמה}", q"{קסם}", q"{קסניה}", q"{קרן}", q"{קשת}"
		, q"{רביד}", q"{רבקה}", q"{רויטל}", q"{רוית}", q"{רומי}", q"{רון}", q"{רונהלי}"
		, q"{רוני}", q"{רונית}", q"{רות}", q"{רותם}", q"{רז}", q"{רחל}", q"{ריטה}"
		, q"{רימון}", q"{רינת}", q"{רננה}", q"{רעות}", q"{שגב}", q"{שגית}", q"{שובל}"
		, q"{שוהם}", q"{שולמית}", q"{שונית}", q"{שושנה}", q"{שחף}", q"{שחר}"
		, q"{שי}", q"{שי לי}", q"{שיר}", q"{שיראל}", q"{שירה}", q"{שירז}", q"{שירי}"
		, q"{שלהבת}", q"{שלומית}", q"{שלי}", q"{שמחה}", q"{שמרית}", q"{שני}"
		, q"{שקד}", q"{שקמה}", q"{שרה}", q"{שרון}", q"{שרית}", q"{תאיר}", q"{תאנה}"
		, q"{תבור}", q"{תהילה}", q"{תו}", q"{תום}", q"{תומר}", q"{תכלת}", q"{תלמה}"
		, q"{תמר}", q"{תמרה}", q"{תפארת}", q"{תקווה}" ];

		return choice(strs, this.rnd);
	}

	override string personFemalePrefix() {
		const string[] strs =
		[ q"{גברת}", q"{עו"ד}", q"{'פרופ}", q"{ד"ר}" ];

		return choice(strs, this.rnd);
	}

	override string personFirstName() {
		const string[] strs =
		[ q"{אביאל}", q"{אביב}", q"{אביבית}", q"{אביגדור}", q"{אביגיל}"
		, q"{אביה}", q"{אביחי}", q"{אביטל}", q"{אבינועם}", q"{אביעד}", q"{אבירם}"
		, q"{אבירן}", q"{אבישג}", q"{אבישי}", q"{אביתר}", q"{אברהם}", q"{אבשלום}"
		, q"{אגם}", q"{אדווה}", q"{אדיר}", q"{אדל}", q"{אדם}", q"{אדר}", q"{אהבה}"
		, q"{אהוד}", q"{אהרון}", q"{אודיה}", q"{אודליה}", q"{אוהד}", q"{אווה}"
		, q"{אופיר}", q"{אופירה}", q"{אופל}", q"{אופק}", q"{אור}", q"{אורטל}"
		, q"{אורי}", q"{אוריאל}", q"{אוריה}", q"{אורית}", q"{אורלי}", q"{אורן}"
		, q"{אושרי}", q"{אחיה}", q"{איב}", q"{איה}", q"{אייל}", q"{איילה}", q"{איילת}"
		, q"{איל}", q"{אילון}", q"{אילן}", q"{אילנה}", q"{אילנית}", q"{אימרי}"
		, q"{אירית}", q"{איתי}", q"{איתם}", q"{איתמר}", q"{איתן}", q"{אלדד}"
		, q"{אלדר}", q"{אלה}", q"{אלומה}", q"{אלון}", q"{אלחי}", q"{אלחנן}"
		, q"{אליאב}", q"{אליאור}", q"{אליאנה}", q"{אליאס}", q"{אליה}", q"{אליהו}"
		, q"{אלימלך}", q"{אלין}", q"{אלינור}", q"{אליסף}", q"{אליענה}"
		, q"{אלירז}", q"{אלירן}", q"{אלישבע}", q"{אלישיב}", q"{אלישמע}"
		, q"{אלישע}", q"{אלכס}", q"{אלכסנדר}", q"{אלמוג}", q"{אלעד}", q"{אלקנה}"
		, q"{אלרועי}", q"{אמונה}", q"{אמור}", q"{אמיר}", q"{אמיתי}", q"{אמנון}"
		, q"{אן}", q"{אנאבל}", q"{אנה}", q"{אניעם}", q"{אסיף}", q"{אסנת}", q"{אסף}"
		, q"{אסתר}", q"{אפיק}", q"{אפריל}", q"{אפרים}", q"{אפרת}", q"{אראל}"
		, q"{אראלה}", q"{ארבל}", q"{ארז}", q"{ארטיום}", q"{ארי}", q"{אריאל}"
		, q"{אריאלה}", q"{אריאנה}", q"{אריה}", q"{ארייה}", q"{ארנון}", q"{ארתור}"
		, q"{אשד}", q"{אשל}", q"{אשר}", q"{בארי}", q"{בועז}", q"{בל}", q"{בלה}", q"{בן אל}"
		, q"{בן ציון}", q"{בניה}", q"{בנימין}", q"{בצלאל}", q"{בר}", q"{בראל}"
		, q"{ברוך}", q"{ברי}", q"{ברית}", q"{ברק}", q"{ברקת}", q"{בת}", q"{בת אל}"
		, q"{בת חן}", q"{בת שבע}", q"{בתיה}", q"{ג'וי}", q"{ג'ון}", q"{גאיה}"
		, q"{גבריאל}", q"{גבריאלה}", q"{גד}", q"{גדעון}", q"{גוון}", q"{גולן}"
		, q"{גוני}", q"{גור}", q"{גורן}", q"{גיא}", q"{גיורא}", q"{גיל}", q"{גילי}"
		, q"{גילת}", q"{גל}", q"{גלבוע}", q"{גלי}", q"{גליה}", q"{גלית}", q"{גלעד}"
		, q"{גפן}", q"{דבורה}", q"{דביר}", q"{דגן}", q"{דגנית}", q"{דוד}", q"{דולב}"
		, q"{דור}", q"{דורון}", q"{דורין}", q"{דורית}", q"{דיאנה}", q"{דינה}"
		, q"{דליה}", q"{דן}", q"{דנה}", q"{דני}", q"{דניאל}", q"{דניאלה}", q"{דנית}"
		, q"{דפנה}", q"{דקל}", q"{דקלה}", q"{דרור}", q"{הגר}", q"{הדס}", q"{הדסה}"
		, q"{הדר}", q"{הוד}", q"{הודיה}", q"{הילה}", q"{הלל}", q"{הראל}", q"{ויויאן}"
		, q"{ויטה}", q"{ויקטוריה}", q"{ולדימיר}", q"{ורד}", q"{זאב}", q"{זבולון}"
		, q"{זהבה}", q"{זוהר}", q"{זיו}", q"{חביב}", q"{חגי}", q"{חגית}", q"{חושן}"
		, q"{חי}", q"{חיים}", q"{חיננית}", q"{חירות}", q"{חמוטל}", q"{חמי}"
		, q"{חן}", q"{חנה}", q"{חנוך}", q"{חנית}", q"{חנן}", q"{חסד}", q"{טובה}"
		, q"{טופז}", q"{טל}", q"{טלי}", q"{טליה}", q"{טנא}", q"{יאיר}", q"{יאן}"
		, q"{יגאל}", q"{יגל}", q"{ידיד}", q"{ידידיה}", q"{יהב}", q"{יהודה}"
		, q"{יהודית}", q"{יהונתן}", q"{יהורם}", q"{יהושע}", q"{יהל}", q"{יהלום}"
		, q"{יהלי}", q"{יואב}", q"{יואל}", q"{יובל}", q"{יוגב}", q"{יודפת}"
		, q"{יוחאי}", q"{יוכבד}", q"{יוליה}", q"{יונית}", q"{יונת}", q"{יונתן}"
		, q"{יוסף}", q"{יורם}", q"{יותם}", q"{יחזקאל}", q"{ים}", q"{ימית}", q"{ינון}"
		, q"{יניב}", q"{יסכה}", q"{יסמין}", q"{יעל}", q"{יעלה}", q"{יעקב}", q"{יערה}"
		, q"{יפה}", q"{יפית}", q"{יפעת}", q"{יפתח}", q"{יצחק}", q"{יקיר}", q"{ירדן}"
		, q"{ירון}", q"{יריב}", q"{ישי}", q"{ישראל}", q"{יששכר}", q"{כוכב}"
		, q"{כליל}", q"{כפיר}", q"{כרם}", q"{כרמי}", q"{כרמית}", q"{כרמל}", q"{לאה}"
		, q"{לב}", q"{לביא}", q"{לבנה}", q"{לוטם}", q"{לוטן}", q"{לוי}", q"{לוסי}"
		, q"{לי}", q"{ליאון}", q"{ליאור}", q"{ליאורה}", q"{ליאל}", q"{ליאם}"
		, q"{ליאן}", q"{ליאת}", q"{ליב}", q"{ליבי}", q"{לידור}", q"{ליה}", q"{ליהיא}"
		, q"{ליזה}", q"{ליטל}", q"{לילי}", q"{ליליה}", q"{לילך}", q"{לימור}"
		, q"{ליעד}", q"{ליר}", q"{לירוי}", q"{לירון}", q"{לירז}", q"{לירן}"
		, q"{לשם}", q"{מאור}", q"{מאי}", q"{מאיה}", q"{מאיר}", q"{מגי}", q"{מגל}"
		, q"{מור}", q"{מוריה}", q"{מורן}", q"{מיה}", q"{מיטב}", q"{מיטל}", q"{מיכאל}"
		, q"{מיכאלה}", q"{מיכל}", q"{מיקה}", q"{מירן}", q"{מלאכי}", q"{מלכה}"
		, q"{מנחם}", q"{מנשה}", q"{מעיין}", q"{מצדה}", q"{מרב}", q"{מרדכי}"
		, q"{מריה}", q"{מרים}", q"{מרינה}", q"{משה}", q"{מתן}", q"{מתנה}", q"{מתת}"
		, q"{נאוה}", q"{נבו}", q"{נגה}", q"{נדב}", q"{נהוראי}", q"{נוב}", q"{נוי}"
		, q"{נויה}", q"{נועה}", q"{נועם}", q"{נופר}", q"{נורית}", q"{נח}", q"{נחשון}"
		, q"{נטלי}", q"{נטע}", q"{נטעלי}", q"{ניב}", q"{נילי}", q"{נינט}", q"{ניסן}"
		, q"{ניצן}", q"{ניקולס}", q"{ניר}", q"{ניתאי}", q"{נמרוד}", q"{נעמה}"
		, q"{נעמי}", q"{נפתלי}", q"{נרי}", q"{נריה}", q"{נתיב}", q"{נתן}", q"{נתנאל}"
		, q"{סביון}", q"{סהר}", q"{סול}", q"{סופיה}", q"{סטפן}", q"{סיגלית}"
		, q"{סיון}", q"{סיני}", q"{סמדר}", q"{סער}", q"{ספיר}", q"{סרגיי}", q"{סשה}"
		, q"{סתיו}", q"{עברי}", q"{עדי}", q"{עדן}", q"{עדנה}", q"{עודד}", q"{עוז}"
		, q"{עוזיה}", q"{עומר}", q"{עומרי}", q"{עופר}", q"{עופרי}", q"{עידו}"
		, q"{עידן}", q"{עיינה}", q"{עילאי}", q"{עינב}", q"{עינת}", q"{עלי}"
		, q"{עלמא}", q"{עלמה}", q"{עמוס}", q"{עמיחי}", q"{עמית}", q"{עמליה}"
		, q"{עמנואל}", q"{ענבל}", q"{ענבר}", q"{ענהאל}", q"{ענת}", q"{עפרה}"
		, q"{עקיבא}", q"{ערגה}", q"{ערן}", q"{פלא}", q"{פלג}", q"{צאלה}", q"{צבי}"
		, q"{צדק}", q"{צוף}", q"{צופיה}", q"{צוק}", q"{צור}", q"{צח}", q"{צחי}", q"{ציון}"
		, q"{צליל}", q"{צמרת}", q"{קורין}", q"{קורל}", q"{קטיה}", q"{קליה}"
		, q"{קמה}", q"{קסם}", q"{קסניה}", q"{קרן}", q"{קשת}", q"{ראובן}", q"{ראם}"
		, q"{רביב}", q"{רביד}", q"{רבקה}", q"{רגב}", q"{רויטל}", q"{רוית}", q"{רומי}"
		, q"{רון}", q"{רונהלי}", q"{רוני}", q"{רונית}", q"{רועי}", q"{רות}"
		, q"{רותם}", q"{רז}", q"{רחל}", q"{ריטה}", q"{ריי}", q"{רימון}", q"{רינת}"
		, q"{רם}", q"{רן}", q"{רננה}", q"{רעות}", q"{רעי}", q"{רפאל}", q"{שאול}"
		, q"{שגב}", q"{שגיא}", q"{שגית}", q"{שובל}", q"{שוהם}", q"{שולמית}"
		, q"{שונית}", q"{שושנה}", q"{שחף}", q"{שחק}", q"{שחר}", q"{שי}", q"{שי לי}"
		, q"{שילה}", q"{שיר}", q"{שיראל}", q"{שירה}", q"{שירז}", q"{שירי}", q"{שלהבת}"
		, q"{שלום}", q"{שלומי}", q"{שלומית}", q"{שלי}", q"{שלמה}", q"{שמאי}"
		, q"{שמואל}", q"{שמחה}", q"{שמעון}", q"{שמרית}", q"{שני}", q"{שקד}"
		, q"{שקמה}", q"{שרה}", q"{שרון}", q"{שרית}", q"{תאיר}", q"{תאנה}", q"{תבור}"
		, q"{תהילה}", q"{תו}", q"{תום}", q"{תומר}", q"{תיאו}", q"{תכלת}", q"{תלמה}"
		, q"{תמיר}", q"{תמר}", q"{תמרה}", q"{תפארת}", q"{תקווה}" ];

		return choice(strs, this.rnd);
	}

	override string personLastName() {
		const string[] strs =
		[ q"{אביב}", q"{אביבי}", q"{אביגור}", q"{אבידור}", q"{אבידן}", q"{אביטל}"
		, q"{אבינועם}", q"{אבינר}", q"{אבינרי}", q"{אביעד}", q"{אביעזר}"
		, q"{אבירם}", q"{אבישי}", q"{אבישר}", q"{אביתר}", q"{אבן}", q"{אבן זהב}"
		, q"{אבן חן}", q"{אבן צור}", q"{אבן שושן}", q"{אבנון}", q"{אבני}"
		, q"{אבניאל}", q"{אבנר}", q"{אבנרי}", q"{אברהם}", q"{אברהמי}", q"{אברון}"
		, q"{אבריאל}", q"{אגוז}", q"{אגוזי}", q"{אגמון}", q"{אגרון}", q"{אדוני}"
		, q"{אדיב}", q"{אדירי}", q"{אדם}", q"{אדמון}", q"{אדמוני}", q"{אדר}"
		, q"{אהרוני}", q"{אהרן}", q"{אוהד}", q"{און}", q"{אופיר}", q"{אופק}"
		, q"{אור}", q"{אורון}", q"{אוריאל}", q"{אוריה}", q"{אוריון}", q"{אוריין}"
		, q"{אורן}", q"{אזרחי}", q"{אחז}", q"{אחיטוב}", q"{אחרון}", q"{אייל}"
		, q"{איילון}", q"{אילון}", q"{אילן}", q"{אילני}", q"{אילת}", q"{איש כסית}"
		, q"{איש שלום}", q"{איתם}", q"{איתן}", q"{אלדד}", q"{אלדן}", q"{אלול}"
		, q"{אלון}", q"{אלוני}", q"{אלוף}", q"{אלחנני}", q"{אליאב}", q"{אליהו}"
		, q"{אליעז}", q"{אליעזר}", q"{אליצור}", q"{אליקים}", q"{אלישיב}"
		, q"{אלמגור}", q"{אלמוג}", q"{אלעד}", q"{אלעזר}", q"{אלרום}", q"{אלרון}"
		, q"{אמיר}", q"{אמית}", q"{אמיתי}", q"{אנקורי}", q"{אסא}", q"{אסיא}"
		, q"{אסיף}", q"{אסף}", q"{אפעל}", q"{אפק}", q"{אפרת}", q"{אראל}", q"{ארבל}"
		, q"{ארגוב}", q"{ארגמן}", q"{ארד}", q"{ארדון}", q"{ארוך}", q"{ארז}"
		, q"{ארזי}", q"{אריאב}", q"{אריאל}", q"{אריאלי}", q"{ארידור}", q"{אריה}"
		, q"{אריכא}", q"{ארם}", q"{ארמוני}", q"{ארנון}", q"{ארצי}", q"{אשבל}"
		, q"{אשד}", q"{אשור}", q"{אשכול}", q"{אשכנזי}", q"{אשל}", q"{אשר}", q"{אשרי}"
		, q"{אשרת}", q"{אתגר}", q"{אתר}", q"{אתרוג}", q"{ב׳׳ק}", q"{באב׳׳ד}"
		, q"{באר}", q"{בארי}", q"{בבלי}", q"{בהט}", q"{בוצר}", q"{בורר}", q"{בחור}"
		, q"{ביצור}", q"{בית הלחמי}", q"{בית יוסף}", q"{בית לחם}", q"{בכור}"
		, q"{בן}", q"{בן אברהם}", q"{בן אליעזר}", q"{בן אמוץ}", q"{בן ארי}"
		, q"{בן אריה}", q"{בן ארצי}", q"{בן אשר}", q"{בן ברוך}", q"{בן ברק}"
		, q"{בן גל}", q"{בן גרא}", q"{בן דב}", q"{בן דוד}", q"{בן דור}", q"{בן דיין}"
		, q"{בן זאב}", q"{בן זכאי}", q"{בן זקן}", q"{בן חור}", q"{בן חיים}"
		, q"{בן חנן}", q"{בן חנניה}", q"{בן יהודה}", q"{בן יעקב}", q"{בן יצחק}"
		, q"{בן ישי}", q"{בן ישראל}", q"{בן מלך}", q"{בן מנחם}", q"{בן נון}"
		, q"{בן נחום}", q"{בן נר}", q"{בן נתן}", q"{בן עמי}", q"{בן ענת}"
		, q"{בן פורת}", q"{בן צבי}", q"{בן צור}", q"{בן ציון}", q"{בן ראובן}"
		, q"{בן שאול}", q"{בן שחר}", q"{בן שלום}", q"{בן שמחון}", q"{בן שמעון}"
		, q"{בן גוריון}", q"{בן חורין}", q"{בן מאיר}", q"{בן סירה}"
		, q"{בןתור}", q"{בנאי}", q"{בנטוב}", q"{בנימין}", q"{בנימיני}"
		, q"{בצלאל}", q"{בר}", q"{בר אור}", q"{בר גיורא}", q"{בר זוהר}"
		, q"{בר יהודה}", q"{בר יעקב}", q"{בר נתן}", q"{בר שלום}", q"{בראון}"
		, q"{בראילן}", q"{ברהלל}", q"{בריוסף}", q"{ברלב}", q"{ברעוז}", q"{בראל}"
		, q"{ברוך}", q"{ברוש}", q"{ברושי}", q"{ברזילי}", q"{ברזל}", q"{ברטוב}"
		, q"{ברטל}", q"{ברנע}", q"{ברעם}", q"{ברק}", q"{ברקאי}", q"{ברקין}"
		, q"{ברקן}", q"{ברקת}", q"{בשן}", q"{גאון}", q"{גבאי}", q"{גביש}", q"{גבע}"
		, q"{גבעול}", q"{גבעון}", q"{גבעתי}", q"{גבתון}", q"{גד}", q"{גדות}"
		, q"{גדיש}", q"{גדליה}", q"{גדרון}", q"{גודר}", q"{גולן}", q"{גונן}"
		, q"{גופר}", q"{גור אריה}", q"{גוריון}", q"{גורלי}", q"{גורן}"
		, q"{גושן}", q"{גזית}", q"{גיא}", q"{גידור}", q"{גיל}", q"{גילון}", q"{גילת}"
		, q"{גינוסר}", q"{גינת}", q"{גינתון}", q"{גל}", q"{גלבוע}", q"{גליל}"
		, q"{גלילי}", q"{גלעד}", q"{גלעדי}", q"{גלרון}", q"{גמזו}", q"{גמליאל}"
		, q"{גנור}", q"{גפן}", q"{גפני}", q"{גרא}", q"{גרינבלט}", q"{גרנות}"
		, q"{גרשון}", q"{גת}", q"{דביר}", q"{דברת}", q"{דגן}", q"{דגני}", q"{דוד}"
		, q"{דוידי}", q"{דולב}", q"{דור}", q"{דורי}", q"{דותן}", q"{דן}", q"{דניאלי}"
		, q"{דקל}", q"{דר}", q"{דרומי}", q"{דרור}", q"{דרורי}", q"{דשא}", q"{הדס}"
		, q"{הדר}", q"{הלוי}", q"{הללי}", q"{המאירי}", q"{הנגבי}", q"{העצני}"
		, q"{הר נוי}", q"{הר שפי}", q"{הראבן}", q"{הראובני}", q"{הראל}"
		, q"{הרטוב}", q"{הרפז}", q"{הררי}", q"{וילנאי}", q"{ורד}", q"{ורדי}"
		, q"{ורדימון}", q"{זזאב}", q"{זאבי}", q"{זבולון}", q"{זהבי}", q"{זוהר}"
		, q"{זורע}", q"{זיו}", q"{זיואב}", q"{זכאי}", q"{זכות}", q"{זכריה}"
		, q"{זמורה}", q"{זמיר}", q"{זמר}", q"{זמרי}", q"{זעירא}", q"{זק}", q"{זק׳׳ש}"
		, q"{זר}", q"{זרובבל}", q"{זרטל}", q"{חדש}", q"{חובה}", q"{חורש}", q"{חזן}"
		, q"{חזני}", q"{חזקיה}", q"{חי}", q"{חייט}", q"{חיים}", q"{חכם}", q"{חלד}"
		, q"{חלמיש}", q"{חן}", q"{חנוך}", q"{חנוכה}", q"{חנני}", q"{חסון}", q"{חסיד}"
		, q"{חפץ}", q"{חפר}", q"{חץ}", q"{חצור}", q"{חצרוני}", q"{חרובי}", q"{חרותי}"
		, q"{חריף}", q"{חרל׳׳פ}", q"{חרמון}", q"{חרמוני}", q"{חת}", q"{טבת}"
		, q"{טוביה}", q"{טלמור}", q"{טלשיר}", q"{יאיר}", q"{יבין}", q"{יגור}"
		, q"{ידיד}", q"{ידין}", q"{ידעיה}", q"{יהב}", q"{יהודאי}", q"{יהודה}"
		, q"{יהושע}", q"{יהלום}", q"{יובל}", q"{יוגב}", q"{יוטבת}", q"{יונה}"
		, q"{יוסף}", q"{יושע}", q"{יחזקאל}", q"{יחיאל}", q"{יכין}", q"{ימיני}"
		, q"{ינון}", q"{יניב}", q"{יעקבי}", q"{יער}", q"{יערי}", q"{יפה}", q"{יפרח}"
		, q"{יפת}", q"{יצחק}", q"{יצחקי}", q"{יקיר}", q"{ירדני}", q"{ירוחם}"
		, q"{ירום}", q"{ירון}", q"{ירושלמי}", q"{יריב}", q"{ירקוני}", q"{ישורון}"
		, q"{ישי}", q"{ישר}", q"{ישראל}", q"{ישראלי}", q"{יששכר}", q"{כהן}"
		, q"{כוכבי}", q"{כנען}", q"{כנעני}", q"{כנר}", q"{כספי}", q"{כפיר}"
		, q"{כפרי}", q"{כרמון}", q"{כרמי}", q"{כרמל}", q"{כרמלי}", q"{לאור}"
		, q"{לב}", q"{לב ארי}", q"{לבבי}", q"{לביא}", q"{לבנון}", q"{לבני}"
		, q"{לבנת}", q"{להב}", q"{להבי}", q"{לוטם}", q"{לוטן}", q"{לוי}", q"{לוי נחום}"
		, q"{לויתן}", q"{לחמן}", q"{ליאור}", q"{לידור}", q"{ליטאי}", q"{לימור}"
		, q"{ליש}", q"{לשם}", q"{מאור}", q"{מאיר}", q"{מאירי}", q"{מגד}", q"{מגל}"
		, q"{מואב}", q"{מוקד}", q"{מוקדי}", q"{מורג}", q"{מוריה}", q"{מורשת}"
		, q"{מזא׳׳ה}", q"{מזור}", q"{מזל}", q"{מזר}", q"{מאיר מיבר}", q"{מיכה}"
		, q"{מילוא}", q"{מישורי}", q"{מלכה}", q"{מלכי}", q"{מלמד}", q"{מנור}"
		, q"{מנחם}", q"{מנשה}", q"{מעוז}", q"{מעיין}", q"{מעייני}", q"{מערבי}"
		, q"{מרגליות}", q"{מרגלית}", q"{מרגנית}", q"{מרום}", q"{מרון}"
		, q"{מרידור}", q"{משה}", q"{משולח}", q"{משיח}", q"{משעול}", q"{משעל}"
		, q"{משען}", q"{משעני}", q"{מתניה}", q"{מתתיהו}", q"{נאור}", q"{נאמן}"
		, q"{נבון}", q"{נגבי}", q"{נוב}", q"{נווה}", q"{נוימרק}", q"{נועם}"
		, q"{נוריאל}", q"{נחום}", q"{נחושתן}", q"{נחשון}", q"{ניב}", q"{ניסני}"
		, q"{ניצן}", q"{נמרי}", q"{נסים}", q"{נץ}", q"{נריה}", q"{נשר}", q"{נשרי}"
		, q"{נתיב}", q"{נתן}", q"{נתנאל}", q"{נתניהו}", q"{סבוראי}", q"{סביר}"
		, q"{סגל}", q"{סדן}", q"{סהר}", q"{סופר}", q"{סימן טוב}", q"{סיני}"
		, q"{סכנין}", q"{סלע}", q"{סמדר}", q"{סנונית}", q"{סעד}", q"{סער}", q"{ספיר}"
		, q"{סתוי}", q"{סתיו}", q"{עברון}", q"{עברי}", q"{עדיני}", q"{עדר}"
		, q"{עובד}", q"{עובדיה}", q"{עובדיהו}", q"{עוגן}", q"{עוז}", q"{עוזר}"
		, q"{עומר}", q"{עופר}", q"{עופרים}", q"{עזוז}", q"{עזריאל}", q"{עזריה}"
		, q"{עזרתי}", q"{עידן}", q"{עילם}", q"{עינב}", q"{עמוס}", q"{עמיאל}"
		, q"{עמיקם}", q"{עמיר}", q"{עמירן}", q"{עמית}", q"{עמרמי}", q"{ענבל}"
		, q"{ענבר}", q"{עסיס}", q"{עפרת}", q"{עצמון}", q"{ערד}", q"{ערמון}"
		, q"{ערן}", q"{עשת}", q"{פאר}", q"{פדהצור}", q"{פולני}", q"{פורת}", q"{פז}"
		, q"{פלאי}", q"{פלד}", q"{פלס}", q"{פניני}", q"{פסח}", q"{פרג}", q"{פרוש}"
		, q"{פרח}", q"{פרי}", q"{פריגת}", q"{פרימור}", q"{פרץ}", q"{פת}", q"{צבר}"
		, q"{צדוק}", q"{צדקה}", q"{צדקיהו}", q"{צוק}", q"{צור}", q"{צורי}", q"{צוריאל}"
		, q"{צורף}", q"{צידון}", q"{צמח}", q"{צפיר}", q"{צפריר}", q"{קדמון}"
		, q"{קדמי}", q"{קדר}", q"{קדרון}", q"{קהת}", q"{קורח}", q"{קורן}", q"{קטן}"
		, q"{קידר}", q"{קינן}", q"{קיסרי}", q"{קישון}", q"{קם}", q"{קמה}", q"{קמחי}"
		, q"{קנר}", q"{קנת}", q"{קצב}", q"{קצין}", q"{קציר}", q"{קשת}", q"{קשתי}"
		, q"{ראובני}", q"{רבי}", q"{רביב}", q"{רביד}", q"{רגב}", q"{רהב}", q"{רוגל}"
		, q"{רווה}", q"{רווח}", q"{רוח}", q"{רום}", q"{רועה}", q"{רז}", q"{רזיאל}"
		, q"{רחמים}", q"{רכס}", q"{רם}", q"{רמון}", q"{רמז}", q"{רמתי}", q"{רן}"
		, q"{רענן}", q"{רשף}", q"{שאול}", q"{שאולי}", q"{שאלתיאל}", q"{שבח}"
		, q"{שביב}", q"{שבת}", q"{שבתאי}", q"{שבתי}", q"{שגב}", q"{שגיא}", q"{שדה}"
		, q"{שדר}", q"{שוב}", q"{שובל}", q"{שוהם}", q"{שוחט}", q"{שומרון}", q"{שוער}"
		, q"{שופט}", q"{שור}", q"{שורק}", q"{שושן}", q"{שושני}", q"{שחור}", q"{שחורי}"
		, q"{שחל}", q"{שחם}", q"{שחף}", q"{שחק}", q"{שחר}", q"{שילה}", q"{שילוח}"
		, q"{שילון}", q"{שילוני}", q"{שיר}", q"{שיש}", q"{שלג}", q"{שלו}", q"{שלום}"
		, q"{שלומי}", q"{שלח}", q"{שלם}", q"{שלמון}", q"{שם אור}", q"{שםטוב}"
		, q"{שמואל}", q"{שמואלי}", q"{שמחון}", q"{שמחוני}", q"{שמחי}", q"{שמעון}"
		, q"{שמרון}", q"{שמש}", q"{שמשון}", q"{שמשוני}", q"{שמשי}", q"{שנהר}"
		, q"{שני}", q"{שנער}", q"{שער}", q"{שפיר}", q"{שפע}", q"{שץ}", q"{שקד}", q"{שקדי}"
		, q"{שקלים}", q"{שרביט}", q"{שרון}", q"{שרוני}", q"{שריג}", q"{שריד}"
		, q"{שריף}", q"{שריר}", q"{ששון}", q"{תאומים}", q"{תאני}", q"{תבור}"
		, q"{תבורי}", q"{תגר}", q"{תדמור}", q"{תומר}", q"{תורן}", q"{תירוש}"
		, q"{תל צור}", q"{תלם}", q"{תמוז}", q"{תמיר}", q"{תמרי}", q"{תקווה}"
		, q"{תקוע}", q"{תרשיש}", q"{תשבי}" ];

		return choice(strs, this.rnd);
	}

	override string personLastNamePattern() {
		const int rndInt = uniform(0, 1, this.rnd);

		if(rndInt >= 0 && rndInt < 1) {
			return personLastName();
		}

		return "";
	}

	override string personMaleFirstName() {
		const string[] strs =
		[ q"{אביאל}", q"{אביגדור}", q"{אביה}", q"{אביחי}", q"{אבינועם}"
		, q"{אביעד}", q"{אבירם}", q"{אבירן}", q"{אבישי}", q"{אביתר}", q"{אברהם}"
		, q"{אבשלום}", q"{אגם}", q"{אדיר}", q"{אדם}", q"{אדר}", q"{אהוד}", q"{אהרון}"
		, q"{אוהד}", q"{אופיר}", q"{אופק}", q"{אור}", q"{אורי}", q"{אוריאל}"
		, q"{אוריה}", q"{אורן}", q"{אושרי}", q"{אחיה}", q"{אייל}", q"{איל}"
		, q"{אילון}", q"{אילן}", q"{אימרי}", q"{איתי}", q"{איתם}", q"{איתמר}"
		, q"{איתן}", q"{אלדד}", q"{אלדר}", q"{אלון}", q"{אלחי}", q"{אלחנן}"
		, q"{אליאב}", q"{אליאור}", q"{אליאס}", q"{אליה}", q"{אליהו}", q"{אלימלך}"
		, q"{אליסף}", q"{אלירז}", q"{אלירן}", q"{אלישיב}", q"{אלישמע}"
		, q"{אלישע}", q"{אלכס}", q"{אלכסנדר}", q"{אלמוג}", q"{אלעד}", q"{אלקנה}"
		, q"{אלרועי}", q"{אמור}", q"{אמיר}", q"{אמיתי}", q"{אמנון}", q"{אניעם}"
		, q"{אסיף}", q"{אסף}", q"{אפיק}", q"{אפרים}", q"{אראל}", q"{ארבל}", q"{ארז}"
		, q"{ארטיום}", q"{ארי}", q"{אריאל}", q"{אריה}", q"{ארנון}", q"{ארתור}"
		, q"{אשד}", q"{אשל}", q"{אשר}", q"{בארי}", q"{בועז}", q"{בן אל}", q"{בן ציון}"
		, q"{בניה}", q"{בנימין}", q"{בצלאל}", q"{בר}", q"{בראל}", q"{ברוך}"
		, q"{ברי}", q"{ברק}", q"{גד}", q"{גדעון}", q"{גוון}", q"{ג'וי}", q"{גולן}"
		, q"{ג'ון}", q"{גוני}", q"{גור}", q"{גורן}", q"{גיא}", q"{גיורא}", q"{גיל}"
		, q"{גילי}", q"{גל}", q"{גלבוע}", q"{גלעד}", q"{גפן}", q"{דביר}", q"{דגן}"
		, q"{דוד}", q"{דולב}", q"{דור}", q"{דורון}", q"{דן}", q"{דני}", q"{דניאל}"
		, q"{דקל}", q"{דרור}", q"{הדר}", q"{הוד}", q"{הלל}", q"{הראל}", q"{ולדימיר}"
		, q"{זאב}", q"{זבולון}", q"{זוהר}", q"{זיו}", q"{חביב}", q"{חגי}", q"{חושן}"
		, q"{חי}", q"{חיים}", q"{חמי}", q"{חן}", q"{חנוך}", q"{חנן}", q"{חסד}", q"{טל}"
		, q"{טנא}", q"{יאיר}", q"{יאן}", q"{יגאל}", q"{יגל}", q"{ידיד}", q"{ידידיה}"
		, q"{יהב}", q"{יהודה}", q"{יהונתן}", q"{יהורם}", q"{יהושע}", q"{יהל}"
		, q"{יהלום}", q"{יהלי}", q"{יואב}", q"{יואל}", q"{יובל}", q"{יוגב}"
		, q"{יוחאי}", q"{יונתן}", q"{יוסף}", q"{יורם}", q"{יותם}", q"{יחזקאל}"
		, q"{ים}", q"{ינון}", q"{יניב}", q"{יעקב}", q"{יפתח}", q"{יצחק}", q"{יקיר}"
		, q"{ירדן}", q"{ירון}", q"{יריב}", q"{ישי}", q"{ישראל}", q"{יששכר}"
		, q"{כוכב}", q"{כליל}", q"{כפיר}", q"{כרם}", q"{כרמי}", q"{כרמל}", q"{לב}"
		, q"{לביא}", q"{לוטם}", q"{לוטן}", q"{לוי}", q"{לי}", q"{ליאון}", q"{ליאור}"
		, q"{ליאל}", q"{ליאם}", q"{לידור}", q"{ליעד}", q"{ליר}", q"{לירוי}"
		, q"{לירון}", q"{לירז}", q"{לירן}", q"{מאור}", q"{מאיר}", q"{מגל}", q"{מור}"
		, q"{מורן}", q"{מיטב}", q"{מיכאל}", q"{מירן}", q"{מלאכי}", q"{מנחם}"
		, q"{מנשה}", q"{מעיין}", q"{מרדכי}", q"{משה}", q"{מתן}", q"{נבו}", q"{נדב}"
		, q"{נהוראי}", q"{נוב}", q"{נוי}", q"{נועם}", q"{נח}", q"{נחשון}", q"{נטע}"
		, q"{ניב}", q"{ניסן}", q"{ניצן}", q"{ניקולס}", q"{ניר}", q"{ניתאי}"
		, q"{נמרוד}", q"{נפתלי}", q"{נרי}", q"{נריה}", q"{נתיב}", q"{נתן}", q"{נתנאל}"
		, q"{סביון}", q"{סהר}", q"{סול}", q"{סטפן}", q"{סיני}", q"{סער}", q"{סרגיי}"
		, q"{סשה}", q"{סתיו}", q"{עברי}", q"{עדי}", q"{עדן}", q"{עודד}", q"{עוז}"
		, q"{עוזיה}", q"{עומר}", q"{עומרי}", q"{עופר}", q"{עופרי}", q"{עידו}"
		, q"{עידן}", q"{עילאי}", q"{עלי}", q"{עמוס}", q"{עמיחי}", q"{עמית}"
		, q"{עמנואל}", q"{עקיבא}", q"{ערן}", q"{פלא}", q"{פלג}", q"{צבי}", q"{צדק}"
		, q"{צוף}", q"{צוק}", q"{צור}", q"{צח}", q"{צחי}", q"{ציון}", q"{צליל}", q"{קסם}"
		, q"{ראובן}", q"{ראם}", q"{רביב}", q"{רביד}", q"{רגב}", q"{רון}", q"{רוני}"
		, q"{רועי}", q"{רותם}", q"{רז}", q"{ריי}", q"{רימון}", q"{רם}", q"{רן}", q"{רעי}"
		, q"{רפאל}", q"{שאול}", q"{שגב}", q"{שגיא}", q"{שובל}", q"{שוהם}", q"{שחף}"
		, q"{שחק}", q"{שחר}", q"{שי}", q"{שי לי}", q"{שילה}", q"{שיר}", q"{שלום}"
		, q"{שלומי}", q"{שלמה}", q"{שמאי}", q"{שמואל}", q"{שמחה}", q"{שמעון}"
		, q"{שקד}", q"{שרון}", q"{תבור}", q"{תו}", q"{תום}", q"{תומר}", q"{תיאו}"
		, q"{תמיר}" ];

		return choice(strs, this.rnd);
	}

	override string personMalePrefix() {
		const string[] strs =
		[ q"{מר}", q"{עו"ד}", q"{'פרופ}", q"{ד"ר}" ];

		return choice(strs, this.rnd);
	}

	override string personName() {
		const int rndInt = uniform(0, 10, this.rnd);

		if(rndInt >= 0 && rndInt < 1) {
			return personPrefix() ~ " " ~ personFirstName() ~ " " ~ personLastName();
		}
		if(rndInt >= 1 && rndInt < 10) {
			return personFirstName() ~ " " ~ personLastName();
		}

		return "";
	}

	override string personPrefix() {
		const string[] strs =
		[ q"{'פרופ}", q"{גברת}", q"{ד"ר}", q"{מר}", q"{עו"ד}" ];

		return choice(strs, this.rnd);
	}

	override string phoneNumberFormats() {
		const string[] strs =
		[ q"{02-#######}", q"{03-#######}", q"{04-#######}", q"{08-#######}", q"{09-#######}", q"{077-#######}"
		, q"{+972-2-#######}", q"{+972-3-#######}", q"{+972-4-#######}", q"{+972-8-#######}", q"{+972-9-#######}"
		, q"{+972-77-#######}" ];

		return numberBuild(choice(strs, this.rnd));
	}

}
