module faked.faker_uk;

import std.algorithm : map, joiner;
import std.array;
import std.conv : to;
import std.exception : enforce;
import std.format;
import std.random;
import std.range : iota, take, repeat;
import std.string : toUpper;
import std.typecons : Nullable, nullable;

import faked.customtypes;
import faked.fakerenums;

import faked.faker_en;

class Faker_uk : Faker_en {
@safe:
	this(int seed) {
		super(seed);
	}

	override string companyNamePattern() {
		switch(uniform(0, 8, this.rnd)) {
			case 0: return companyPrefix() ~ " " ~ personFemaleFirstName();
			case 1: return companyPrefix() ~ " " ~ personMaleFirstName();
			case 2: return companyPrefix() ~ " " ~ personMaleLastName();
			case 3: return companyPrefix() ~ " " ~ companySuffix() ~ companySuffix();
			case 4: return companyPrefix() ~ " " ~ companySuffix() ~ companySuffix() ~ companySuffix();
			case 5: return companyPrefix() ~ " " ~ locationCityName() ~ companySuffix();
			case 6: return companyPrefix() ~ " " ~ locationCityName() ~ companySuffix() ~ companySuffix();
			case 7: return companyPrefix() ~ " " ~ locationCityName() ~ companySuffix() ~ companySuffix() ~ companySuffix();
			default: return "";
		}
	}

	override string companySuffix() {
		const string[] strs =
		[ q"{Постач}", q"{Торг}", q"{Пром}", q"{Трейд}", q"{Збут}" ];

		return choice(strs, this.rnd);
	}

	string companyPrefix() {
		const string[] strs =
		[ q"{ТОВ}", q"{ПАТ}", q"{ПрАТ}", q"{ТДВ}", q"{КТ}", q"{ПТ}", q"{ДП}", q"{ФОП}" ];

		return choice(strs, this.rnd);
	}

	override string internetDomainSuffix() {
		const string[] strs =
		[ q"{cherkassy.ua}", q"{cherkasy.ua}", q"{ck.ua}", q"{cn.ua}", q"{com.ua}", q"{crimea.ua}", q"{cv.ua}"
		, q"{dn.ua}", q"{dnepropetrovsk.ua}", q"{dnipropetrovsk.ua}", q"{donetsk.ua}", q"{dp.ua}"
		, q"{if.ua}", q"{in.ua}", q"{ivano-frankivsk.ua}", q"{kh.ua}", q"{kharkiv.ua}", q"{kharkov.ua}"
		, q"{kherson.ua}", q"{khmelnitskiy.ua}", q"{kiev.ua}", q"{kirovograd.ua}", q"{km.ua}", q"{kr.ua}"
		, q"{ks.ua}", q"{lg.ua}", q"{lt.ua}", q"{lugansk.ua}", q"{lutsk.ua}", q"{lutsk.net}", q"{lviv.ua}"
		, q"{mk.ua}", q"{net.ua}", q"{nikolaev.ua}", q"{od.ua}", q"{odessa.ua}", q"{org.ua}", q"{pl.ua}"
		, q"{poltava.ua}", q"{rovno.ua}", q"{rv.ua}", q"{sebastopol.ua}", q"{sm.ua}", q"{sumy.ua}", q"{te.ua}"
		, q"{ternopil.ua}", q"{ua}", q"{uz.ua}", q"{uzhgorod.ua}", q"{vinnica.ua}", q"{vn.ua}", q"{volyn.net}"
		, q"{volyn.ua}", q"{yalta.ua}", q"{zaporizhzhe.ua}", q"{zhitomir.ua}", q"{zp.ua}", q"{zt.ua}"
		, q"{укр}" ];

		return choice(strs, this.rnd);
	}

	override string internetFreeEmail() {
		const string[] strs =
		[ q"{ukr.net}", q"{ex.ua}", q"{e-mail.ua}", q"{i.ua}", q"{meta.ua}", q"{yandex.ua}", q"{gmail.com}" ];

		return choice(strs, this.rnd);
	}

	override string locationBuildingNumber() {
		const string[] strs =
		[ q"{#}", q"{##}", q"{###}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationCityName() {
		const string[] strs =
		[ q"{Алчевськ}", q"{Артемівськ}", q"{Бердичів}", q"{Бердянськ}"
		, q"{Біла Церква}", q"{Бровари}", q"{Вінниця}", q"{Горлівка}"
		, q"{Дніпродзержинськ}", q"{Дніпропетровськ}", q"{Донецьк}"
		, q"{Євпаторія}", q"{Єнакієве}", q"{Житомир}", q"{Запоріжжя}"
		, q"{Івано-Франківськ}", q"{Ізмаїл}", q"{Кам’янець-Подільський}"
		, q"{Керч}", q"{Київ}", q"{Кіровоград}", q"{Конотоп}", q"{Краматорськ}"
		, q"{Красний Луч}", q"{Кременчук}", q"{Кривий Ріг}", q"{Лисичанськ}"
		, q"{Луганськ}", q"{Луцьк}", q"{Львів}", q"{Макіївка}", q"{Маріуполь}"
		, q"{Мелітополь}", q"{Миколаїв}", q"{Мукачеве}", q"{Нікополь}"
		, q"{Одеса}", q"{Олександрія}", q"{Павлоград}", q"{Полтава}"
		, q"{Рівне}", q"{Севастополь}", q"{Сєвєродонецьк}", q"{Сімферополь}"
		, q"{Слов’янськ}", q"{Суми}", q"{Тернопіль}", q"{Ужгород}"
		, q"{Умань}", q"{Харків}", q"{Херсон}", q"{Хмельницький}"
		, q"{Черкаси}", q"{Чернівці}", q"{Чернігів}", q"{Шостка}"
		, q"{Ялта}" ];

		return choice(strs, this.rnd);
	}

	override string locationCityPattern() {
		switch(uniform(0, 2, this.rnd)) {
			case 0: return locationCityName();
			case 1: return locationCityPrefix() ~ " " ~ personMaleFirstName();
			default: return "";
		}
	}

	override string locationCityPrefix() {
		const string[] strs =
		[ q"{Південний}", q"{Північний}", q"{Східний}", q"{Західний}" ];

		return choice(strs, this.rnd);
	}

	override string locationCitySuffix() {
		const string[] strs =
		[ q"{град}" ];

		return choice(strs, this.rnd);
	}

	override string locationCountry() {
		const string[] strs =
		[ q"{Австралія}", q"{Австрія}", q"{Азербайджан}", q"{Албанія}"
		, q"{Алжир}", q"{Ангола}", q"{Андорра}", q"{Антигуа і Барбуда}"
		, q"{Аргентина}", q"{Афганістан}", q"{Багамські Острови}"
		, q"{Бангладеш}", q"{Барбадос}", q"{Бахрейн}", q"{Беліз}"
		, q"{Бельгія}", q"{Бенін}", q"{Білорусь}", q"{Болгарія}", q"{Болівія}"
		, q"{Боснія і Герцеговина}", q"{Ботсвана}", q"{Бразилія}"
		, q"{Бруней}", q"{Буркіна-Фасо}", q"{Бурунді}", q"{Бутан}"
		, q"{В’єтнам}", q"{Вануату}", q"{Ватикан}", q"{Велика Британія}"
		, q"{Венесуела}", q"{Вірменія}", q"{Габон}", q"{Гаїті}", q"{Гайана}"
		, q"{Гамбія}", q"{Гана}", q"{Гватемала}", q"{Гвінея}", q"{Гвінея-Бісау}"
		, q"{Гондурас}", q"{Гренада}", q"{Греція}", q"{Грузія}", q"{Данія}"
		, q"{Демократична Республіка Конго}", q"{Джибуті}"
		, q"{Домініка}", q"{Домініканська Республіка}", q"{Еквадор}"
		, q"{Екваторіальна Гвінея}", q"{Еритрея}", q"{Естонія}"
		, q"{Ефіопія}", q"{Єгипет}", q"{Ємен}", q"{Замбія}", q"{Зімбабве}"
		, q"{Ізраїль}", q"{Індія}", q"{Індонезія}", q"{Ірак}", q"{Іран}"
		, q"{Ірландія}", q"{Ісландія}", q"{Іспанія}", q"{Італія}"
		, q"{Йорданія}", q"{Кабо-Верде}", q"{Казахстан}", q"{Камбоджа}"
		, q"{Камерун}", q"{Канада}", q"{Катар}", q"{Кенія}", q"{Киргизстан}"
		, q"{Китай}", q"{Кіпр}", q"{Кірибаті}", q"{Колумбія}", q"{Коморські Острови}"
		, q"{Конго}", q"{Коста-Рика}", q"{Кот-д’Івуар}", q"{Куба}"
		, q"{Кувейт}", q"{Лаос}", q"{Латвія}", q"{Лесото}", q"{Литва}"
		, q"{Ліберія}", q"{Ліван}", q"{Лівія}", q"{Ліхтенштейн}", q"{Люксембург}"
		, q"{Маврикій}", q"{Мавританія}", q"{Мадаґаскар}", q"{Македонія}"
		, q"{Малаві}", q"{Малайзія}", q"{Малі}", q"{Мальдіви}", q"{Мальта}"
		, q"{Марокко}", q"{Маршаллові Острови}", q"{Мексика}"
		, q"{Мозамбік}", q"{Молдова}", q"{Монако}", q"{Монголія}"
		, q"{Намібія}", q"{Науру}", q"{Непал}", q"{Нігер}", q"{Нігерія}"
		, q"{Нідерланди}", q"{Нікарагуа}", q"{Німеччина}", q"{Нова Зеландія}"
		, q"{Норвегія}", q"{Об’єднані Арабські Емірати}"
		, q"{Оман}", q"{Пакистан}", q"{Палау}", q"{Панама}", q"{Папуа-Нова Гвінея}"
		, q"{Парагвай}", q"{Перу}", q"{Південна Корея}", q"{Південний Судан}"
		, q"{Південно-Африканська Республіка}", q"{Північна Корея}"
		, q"{Польща}", q"{Португалія}", q"{Російська Федерація}"
		, q"{Руанда}", q"{Румунія}", q"{Сальвадор}", q"{Самоа}", q"{Сан-Марино}"
		, q"{Сан-Томе і Принсіпі}", q"{Саудівська Аравія}"
		, q"{Свазіленд}", q"{Сейшельські Острови}", q"{Сенеґал}"
		, q"{Сент-Вінсент і Гренадини}", q"{Сент-Кітс і Невіс}"
		, q"{Сент-Люсія}", q"{Сербія}", q"{Сирія}", q"{Сінгапур}"
		, q"{Словаччина}", q"{Словенія}", q"{Соломонові Острови}"
		, q"{Сомалі}", q"{Судан}", q"{Суринам}", q"{Східний Тимор}"
		, q"{США}", q"{Сьєрра-Леоне}", q"{Таджикистан}", q"{Таїланд}"
		, q"{Танзанія}", q"{Того}", q"{Тонга}", q"{Тринідад і Тобаго}"
		, q"{Тувалу}", q"{Туніс}", q"{Туреччина}", q"{Туркменістан}"
		, q"{Уганда}", q"{Угорщина}", q"{Узбекистан}", q"{Україна}"
		, q"{Уругвай}", q"{Федеративні Штати Мікронезії}"
		, q"{Фіджі}", q"{Філіппіни}", q"{Фінляндія}", q"{Франція}"
		, q"{Хорватія}", q"{Центральноафриканська Республіка}"
		, q"{Чад}", q"{Чехія}", q"{Чилі}", q"{Чорногорія}", q"{Швейцарія}"
		, q"{Швеція}", q"{Шрі-Ланка}", q"{Ямайка}", q"{Японія}" ];

		return choice(strs, this.rnd);
	}

	override string locationDefaultCountry() {
		const string[] strs =
		[ q"{Україна}" ];

		return choice(strs, this.rnd);
	}

	override string locationPostcode() {
		const string[] strs =
		[ q"{#####}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationSecondaryAddress() {
		const string[] strs =
		[ q"{кв. ###}" ];

		return numberBuild(choice(strs, this.rnd));
	}

	override string locationState() {
		const string[] strs =
		[ q"{АР Крим}", q"{Вінницька область}", q"{Волинська область}"
		, q"{Дніпропетровська область}", q"{Донецька область}"
		, q"{Житомирська область}", q"{Закарпатська область}"
		, q"{Запорізька область}", q"{Івано-Франківська область}"
		, q"{Київська область}", q"{Кіровоградська область}"
		, q"{Луганська область}", q"{Львівська область}"
		, q"{Миколаївська область}", q"{Одеська область}"
		, q"{Полтавська область}", q"{Рівненська область}"
		, q"{Сумська область}", q"{Тернопільська область}"
		, q"{Харківська область}", q"{Херсонська область}"
		, q"{Хмельницька область}", q"{Черкаська область}"
		, q"{Чернівецька область}", q"{Чернігівська область}"
		, q"{Київ}", q"{Севастополь}" ];

		return choice(strs, this.rnd);
	}

	override string locationStreetAddress() {
		const LocationStreetAddressEnum[] enums = [ LocationStreetAddressEnum.normal, LocationStreetAddressEnum.full ];
		return locationStreetAddress(choice(enums, this.rnd));
	}

	override string locationStreetAddress(LocationStreetAddressEnum which) {
		switch(which) {
			case LocationStreetAddressEnum.normal: return locationStreet() ~ ", " ~ locationBuildingNumber();
			case LocationStreetAddressEnum.full: return locationStreet() ~ ", " ~ locationBuildingNumber() ~ " " ~ locationSecondaryAddress();
			default: return "";
		}
	}

	override string locationStreetName() {
		const string[] strs =
		[ q"{Зелена}", q"{Молодіжна}", q"{Городоцька}", q"{Стрийська}"
		, q"{Вузька}", q"{Нижанківського}", q"{Староміська}"
		, q"{Ліста}", q"{Вічева}", q"{Брюховичів}", q"{Винників}"
		, q"{Рудного}", q"{Коліївщини}" ];

		return choice(strs, this.rnd);
	}

	override string locationStreetPattern() {
		switch(uniform(0, 2, this.rnd)) {
			case 0: return locationStreetPrefix() ~ " " ~ locationStreetName();
			case 1: return locationStreetName() ~ " " ~ locationStreetSuffix();
			default: return "";
		}
	}

	override string locationStreetSuffix() {
		const string[] strs =
		[ q"{майдан}" ];

		return choice(strs, this.rnd);
	}

	string locationStreetPrefix() {
		const string[] strs =
		[ q"{вул.}", q"{вулиця}", q"{пр.}", q"{проспект}", q"{пл.}", q"{площа}"
		, q"{пров.}", q"{провулок}" ];

		return choice(strs, this.rnd);
	}

	override string personFemaleFirstName() {
		const string[] strs =
		[ q"{Аврелія}", q"{Аврора}", q"{Агапія}", q"{Агата}", q"{Агафія}"
		, q"{Агнеса}", q"{Агнія}", q"{Агрипина}", q"{Ада}", q"{Аделаїда}"
		, q"{Аделіна}", q"{Адріана}", q"{Азалія}", q"{Алевтина}", q"{Аліна}"
		, q"{Алла}", q"{Альбіна}", q"{Альвіна}", q"{Анастасія}", q"{Анатолія}"
		, q"{Ангеліна}", q"{Анжела}", q"{Анна}", q"{Антонида}", q"{Антоніна}"
		, q"{Антонія}", q"{Анфіса}", q"{Аполлінарія}", q"{Аполлонія}"
		, q"{Аркадія}", q"{Артемія}", q"{Афанасія}", q"{Білослава}"
		, q"{Біляна}", q"{Благовіста}", q"{Богдана}", q"{Богуслава}"
		, q"{Божена}", q"{Болеслава}", q"{Борислава}", q"{Броніслава}"
		, q"{В’ячеслава}", q"{Валентина}", q"{Валерія}", q"{Варвара}"
		, q"{Василина}", q"{Вікторія}", q"{Вілена}", q"{Віленіна}"
		, q"{Віліна}", q"{Віола}", q"{Віолетта}", q"{Віра}", q"{Віргінія}"
		, q"{Віта}", q"{Віталіна}", q"{Влада}", q"{Владислава}", q"{Власта}"
		, q"{Всеслава}", q"{Галина}", q"{Ганна}", q"{Гелена}", q"{Далеслава}"
		, q"{Дана}", q"{Дарина}", q"{Дарислава}", q"{Діана}", q"{Діяна}"
		, q"{Добринка}", q"{Добромила}", q"{Добромира}", q"{Добромисла}"
		, q"{Доброслава}", q"{Долеслава}", q"{Доляна}", q"{Жанна}"
		, q"{Жозефіна}", q"{Забава}", q"{Звенислава}", q"{Зінаїда}"
		, q"{Злата}", q"{Зореслава}", q"{Зорина}", q"{Зоряна}", q"{Зоя}"
		, q"{Іванна}", q"{Ілона}", q"{Інна}", q"{Іннеса}", q"{Ірина}", q"{Ірма}"
		, q"{Калина}", q"{Каріна}", q"{Катерина}", q"{Квітка}", q"{Квітослава}"
		, q"{Клавдія}", q"{Крентта}", q"{Ксенія}", q"{Купава}", q"{Лада}"
		, q"{Лариса}", q"{Леся}", q"{Ликера}", q"{Лідія}", q"{Лілія}", q"{Любава}"
		, q"{Любислава}", q"{Любов}", q"{Любомила}", q"{Любомира}"
		, q"{Люборада}", q"{Любослава}", q"{Людмила}", q"{Людомила}"
		, q"{Майя}", q"{Мальва}", q"{Мар’яна}", q"{Марина}", q"{Марічка}"
		, q"{Марія}", q"{Марта}", q"{Меланія}", q"{Мечислава}", q"{Милодара}"
		, q"{Милослава}", q"{Мирослава}", q"{Мілана}", q"{Мокрина}"
		, q"{Мотря}", q"{Мстислава}", q"{Надія}", q"{Наталія}", q"{Неля}"
		, q"{Немира}", q"{Ніна}", q"{Огняна}", q"{Оксана}", q"{Олександра}"
		, q"{Олена}", q"{Олеся}", q"{Ольга}", q"{Ореста}", q"{Орина}", q"{Орислава}"
		, q"{Орися}", q"{Оріяна}", q"{Павліна}", q"{Палажка}", q"{Пелагея}"
		, q"{Пелагія}", q"{Поліна}", q"{Поляна}", q"{Потішана}", q"{Радміла}"
		, q"{Радослава}", q"{Раїна}", q"{Раїса}", q"{Роксолана}", q"{Ромена}"
		, q"{Ростислава}", q"{Руслана}", q"{Світлана}", q"{Святослава}"
		, q"{Слава}", q"{Сміяна}", q"{Сніжана}", q"{Соломія}", q"{Соня}"
		, q"{Софія}", q"{Станислава}", q"{Сюзана}", q"{Таїсія}", q"{Тамара}"
		, q"{Тетяна}", q"{Устина}", q"{Фаїна}", q"{Февронія}", q"{Федора}"
		, q"{Феодосія}", q"{Харитина}", q"{Христина}", q"{Христя}"
		, q"{Юліанна}", q"{Юлія}", q"{Юстина}", q"{Юхима}", q"{Юхимія}"
		, q"{Яна}", q"{Ярина}", q"{Ярослава}" ];

		return choice(strs, this.rnd);
	}

	override string personFemaleMiddleName() {
		const string[] strs =
		[ q"{Адамівна}", q"{Азарівна}", q"{Алевтинівна}", q"{Альбертівна}"
		, q"{Анастасівна}", q"{Анатоліївна}", q"{Андріївна}"
		, q"{Антонівна}", q"{Аркадіївна}", q"{Арсенівна}", q"{Арсеніївна}"
		, q"{Артемівна}", q"{Архипівна}", q"{Аскольдівна}", q"{Афанасіївна}"
		, q"{Білославівна}", q"{Богданівна}", q"{Божемирівна}"
		, q"{Боженівна}", q"{Болеславівна}", q"{Боримирівна}"
		, q"{Борисівна}", q"{Бориславівна}", q"{Братиславівна}"
		, q"{В’ячеславівна}", q"{Вадимівна}", q"{Валентинівна}"
		, q"{Валеріївна}", q"{Василівна}", q"{Вікторівна}", q"{Віталіївна}"
		, q"{Владиславівна}", q"{Володимирівна}", q"{Всеволодівна}"
		, q"{Всеславівна}", q"{Гаврилівна}", q"{Гарасимівна}"
		, q"{Георгіївна}", q"{Гнатівна}", q"{Гордіївна}", q"{Григоріївна}"
		, q"{Данилівна}", q"{Даромирівна}", q"{Денисівна}", q"{Дмитрівна}"
		, q"{Добромирівна}", q"{Доброславівна}", q"{Євгенівна}"
		, q"{Захарівна}", q"{Захаріївна}", q"{Збориславівна}"
		, q"{Звенимирівна}", q"{Звениславівна}", q"{Зеновіївна}"
		, q"{Зиновіївна}", q"{Златомирівна}", q"{Зореславівна}"
		, q"{Іванівна}", q"{Ігорівна}", q"{Ізяславівна}", q"{Корнеліївна}"
		, q"{Корнилівна}", q"{Корніївна}", q"{Костянтинівна}"
		, q"{Лаврентіївна}", q"{Любомирівна}", q"{Макарівна}"
		, q"{Максимівна}", q"{Марківна}", q"{Маркіянівна}", q"{Матвіївна}"
		, q"{Мечиславівна}", q"{Микитівна}", q"{Миколаївна}"
		, q"{Миронівна}", q"{Мирославівна}", q"{Михайлівна}"
		, q"{Мстиславівна}", q"{Назарівна}", q"{Назаріївна}"
		, q"{Натанівна}", q"{Немирівна}", q"{Несторівна}", q"{Олегівна}"
		, q"{Олександрівна}", q"{Олексіївна}", q"{Олельківна}"
		, q"{Омелянівна}", q"{Орестівна}", q"{Орхипівна}", q"{Остапівна}"
		, q"{Охрімівна}", q"{Павлівна}", q"{Панасівна}", q"{Пантелеймонівна}"
		, q"{Петрівна}", q"{Пилипівна}", q"{Радимирівна}", q"{Радимівна}"
		, q"{Родіонівна}", q"{Романівна}", q"{Ростиславівна}"
		, q"{Русланівна}", q"{Святославівна}", q"{Сергіївна}"
		, q"{Славутівна}", q"{Станіславівна}", q"{Степанівна}"
		, q"{Стефаніївна}", q"{Тарасівна}", q"{Тимофіївна}", q"{Тихонівна}"
		, q"{Устимівна}", q"{Юріївна}", q"{Юхимівна}", q"{Ярославівна}" ];

		return choice(strs, this.rnd);
	}

	string personFemaleLastName() {
		const string[] strs =
		[ q"{Андрухович}", q"{Бабух}", q"{Балабан}", q"{Балабуха}"
		, q"{Балакун}", q"{Балицька}", q"{Бамбула}", q"{Бандера}"
		, q"{Барановська}", q"{Бачей}", q"{Башук}", q"{Бердник}", q"{Білич}"
		, q"{Бондаренко}", q"{Борецька}", q"{Боровська}", q"{Борочко}"
		, q"{Боярчук}", q"{Брицька}", q"{Бурмило}", q"{Бутько}", q"{Василишина}"
		, q"{Васильківська}", q"{Вергун}", q"{Вередун}", q"{Верещук}"
		, q"{Витребенько}", q"{Вітряк}", q"{Волощук}", q"{Гайдук}"
		, q"{Гайова}", q"{Гайчук}", q"{Галаєнко}", q"{Галатей}", q"{Галаціон}"
		, q"{Гаман}", q"{Гамула}", q"{Ганич}", q"{Гарай}", q"{Гарун}", q"{Гладківська}"
		, q"{Гладух}", q"{Глинська}", q"{Гнатишина}", q"{Гойко}", q"{Головець}"
		, q"{Горбач}", q"{Гордійчук}", q"{Горова}", q"{Городоцька}"
		, q"{Гречко}", q"{Григоришина}", q"{Гриневецька}", q"{Гриневська}"
		, q"{Гришко}", q"{Громико}", q"{Данилишина}", q"{Данилко}"
		, q"{Демків}", q"{Демчишина}", q"{Дзюб’як}", q"{Дзюба}", q"{Дідух}"
		, q"{Дмитришина}", q"{Дмитрук}", q"{Довгалевська}", q"{Дурдинець}"
		, q"{Євенко}", q"{Євпак}", q"{Ємець}", q"{Єрмак}", q"{Забіла}"
		, q"{Зварич}", q"{Зінкевич}", q"{Зленко}", q"{Іванишина}"
		, q"{Калач}", q"{Кандиба}", q"{Карпух}", q"{Кивач}", q"{Коваленко}"
		, q"{Ковальська}", q"{Коломієць}", q"{Коман}", q"{Компанієць}"
		, q"{Кононець}", q"{Кордун}", q"{Корецька}", q"{Корнїйчук}"
		, q"{Коров’як}", q"{Коцюбинська}", q"{Кулинич}", q"{Кульчицька}"
		, q"{Лагойда}", q"{Лазірко}", q"{Ланова}", q"{Латан}", q"{Латанська}"
		, q"{Лахман}", q"{Левадовська}", q"{Ликович}", q"{Линдик}"
		, q"{Ліхно}", q"{Лобачевська}", q"{Ломова}", q"{Лугова}", q"{Луцька}"
		, q"{Луцьків}", q"{Лученко}", q"{Лучко}", q"{Люта}", q"{Лящук}"
		, q"{Магера}", q"{Мазайло}", q"{Мазило}", q"{Мазун}", q"{Майборода}"
		, q"{Майстренко}", q"{Маковецька}", q"{Малкович}", q"{Мамій}"
		, q"{Маринич}", q"{Марієвська}", q"{Марків}", q"{Махно}", q"{Миклашевська}"
		, q"{Миклухо}", q"{Милославська}", q"{Михайлюк}", q"{Міняйло}"
		, q"{Могилевська}", q"{Москаль}", q"{Москалюк}", q"{Мотрієнко}"
		, q"{Негода}", q"{Ногачевська}", q"{Опенько}", q"{Осадко}"
		, q"{Павленко}", q"{Павлишина}", q"{Павлів}", q"{Пагутяк}"
		, q"{Паламарчук}", q"{Палій}", q"{Паращук}", q"{Пасічник}"
		, q"{Пендик}", q"{Петик}", q"{Петлюра}", q"{Петренко}", q"{Петрина}"
		, q"{Петришина}", q"{Петрів}", q"{Плаксій}", q"{Погиба}", q"{Поліщук}"
		, q"{Пономарів}", q"{Поривай}", q"{Поривайло}", q"{Потебенько}"
		, q"{Потоцька}", q"{Пригода}", q"{Приймак}", q"{Притула}"
		, q"{Прядун}", q"{Розпутня}", q"{Романишина}", q"{Ромей}"
		, q"{Роменець}", q"{Ромочко}", q"{Савицька}", q"{Саєнко}"
		, q"{Свидригайло}", q"{Семеночко}", q"{Семещук}", q"{Сердюк}"
		, q"{Силецька}", q"{Сідлецька}", q"{Сідляк}", q"{Сірко}", q"{Скиба}"
		, q"{Скоропадська}", q"{Слободян}", q"{Сосюра}", q"{Сплюха}"
		, q"{Спотикач}", q"{Степанець}", q"{Стигайло}", q"{Сторожук}"
		, q"{Сторчак}", q"{Стоян}", q"{Сучак}", q"{Сушко}", q"{Тарасюк}"
		, q"{Тиндарей}", q"{Ткаченко}", q"{Третяк}", q"{Троян}", q"{Трублаєвська}"
		, q"{Трясило}", q"{Трясун}", q"{Уманець}", q"{Унич}", q"{Усич}"
		, q"{Федоришина}", q"{Цушко}", q"{Червоній}", q"{Шамрило}"
		, q"{Шевченко}", q"{Шестак}", q"{Шиндарей}", q"{Шиян}", q"{Шкараба}"
		, q"{Шудрик}", q"{Шумило}", q"{Шупик}", q"{Шухевич}", q"{Щербак}"
		, q"{Юрчишина}", q"{Юхно}", q"{Ющик}", q"{Ющук}", q"{Яворівська}"
		, q"{Ялова}", q"{Ялюк}", q"{Янюк}", q"{Ярмак}", q"{Яцишина}", q"{Яцьків}"
		, q"{Ящук}" ];

		return choice(strs, this.rnd);
	}

	override string personFemalePrefix() {
		const string[] strs =
		[ q"{Пані}" ];

		return choice(strs, this.rnd);
	}

	override string personFirstName() {
		const string[] strs =
		[ q"{Євген}", q"{Єремій}", q"{Іван}", q"{Іванна}", q"{Ігор}", q"{Ізяслав}"
		, q"{Ілля}", q"{Ілона}", q"{Інна}", q"{Іннеса}", q"{Ірина}", q"{Ірма}"
		, q"{Августин}", q"{Аврелій}", q"{Аврелія}", q"{Аврора}", q"{Агапія}"
		, q"{Агата}", q"{Агафія}", q"{Агнеса}", q"{Агнія}", q"{Агрипина}"
		, q"{Ада}", q"{Адам}", q"{Аделаїда}", q"{Аделіна}", q"{Адріана}"
		, q"{Адріян}", q"{Азалія}", q"{Азарій}", q"{Алевтин}", q"{Алевтина}"
		, q"{Алла}", q"{Альберт}", q"{Альбіна}", q"{Альвіна}", q"{Аліна}"
		, q"{Анастас}", q"{Анастасій}", q"{Анастасія}", q"{Анатолій}"
		, q"{Анатолія}", q"{Ангеліна}", q"{Андрій}", q"{Анжела}", q"{Анна}"
		, q"{Антон}", q"{Антонида}", q"{Антоній}", q"{Антоніна}", q"{Антонія}"
		, q"{Антін}", q"{Анфіса}", q"{Аполлонія}", q"{Аполлінарія}"
		, q"{Аркадій}", q"{Аркадія}", q"{Арсен}", q"{Арсеній}", q"{Артем}"
		, q"{Артемія}", q"{Архип}", q"{Аскольд}", q"{Афанасій}", q"{Афанасія}"
		, q"{Благовіста}", q"{Богдан}", q"{Богдана}", q"{Богуслава}"
		, q"{Божемир}", q"{Божен}", q"{Божена}", q"{Болеслав}", q"{Болеслава}"
		, q"{Боримир}", q"{Боримисл}", q"{Борис}", q"{Борислав}", q"{Борислава}"
		, q"{Братимир}", q"{Братислав}", q"{Братомил}", q"{Братослав}"
		, q"{Броніслава}", q"{Брячислав}", q"{Будимир}", q"{Буйтур}"
		, q"{Буревіст}", q"{Біломир}", q"{Білослав}", q"{Білослава}"
		, q"{Біляна}", q"{Вадим}", q"{Валентин}", q"{Валентина}", q"{Валерій}"
		, q"{Валерія}", q"{Варвара}", q"{Василина}", q"{Василь}", q"{Велемир}"
		, q"{Влад}", q"{Влада}", q"{Владислав}", q"{Владислава}", q"{Власта}"
		, q"{Володимир}", q"{Володислав}", q"{Всевлад}", q"{Всеволод}"
		, q"{Всеслав}", q"{Всеслава}", q"{Віктор}", q"{Вікторія}"
		, q"{Вілена}", q"{Віленіна}", q"{Віліна}", q"{Віола}", q"{Віолетта}"
		, q"{Віра}", q"{Віргінія}", q"{Віта}", q"{Віталій}", q"{Віталіна}"
		, q"{В’ячеслав}", q"{В’ячеслава}", q"{Гаврило}", q"{Галина}"
		, q"{Ганна}", q"{Гарнослав}", q"{Гелена}", q"{Геннадій}", q"{Георгій}"
		, q"{Герасим}", q"{Гліб}", q"{Гнат}", q"{Гордій}", q"{Горимир}"
		, q"{Горислав}", q"{Градимир}", q"{Григорій}", q"{Далемир}"
		, q"{Далеслава}", q"{Дана}", q"{Данило}", q"{Дарина}", q"{Дарислава}"
		, q"{Даромир}", q"{Дарій}", q"{Денис}", q"{Дмитро}", q"{Добринка}"
		, q"{Добромила}", q"{Добромир}", q"{Добромира}", q"{Добромисл}"
		, q"{Добромисла}", q"{Доброслав}", q"{Доброслава}", q"{Долеслава}"
		, q"{Доляна}", q"{Діана}", q"{Діяна}", q"{Жанна}", q"{Жозефіна}"
		, q"{Забава}", q"{Захар}", q"{Захарій}", q"{Зборислав}", q"{Звенигор}"
		, q"{Звенимир}", q"{Звенислав}", q"{Звенислава}", q"{Земислав}"
		, q"{Зеновій}", q"{Зиновій}", q"{Злат}", q"{Злата}", q"{Златомир}"
		, q"{Зоремир}", q"{Зореслав}", q"{Зореслава}", q"{Зорина}"
		, q"{Зорян}", q"{Зоряна}", q"{Зоя}", q"{Зінаїда}", q"{Калина}"
		, q"{Каріна}", q"{Катерина}", q"{Квітка}", q"{Квітослава}"
		, q"{Кий}", q"{Клавдія}", q"{Корнелій}", q"{Корнило}", q"{Корнилій}"
		, q"{Корній}", q"{Костянтин}", q"{Крентта}", q"{Ксенія}", q"{Кузьма}"
		, q"{Купава}", q"{Лаврентій}", q"{Лаврін}", q"{Лад}", q"{Лада}"
		, q"{Ладислав}", q"{Ладо}", q"{Ладомир}", q"{Лариса}", q"{Левко}"
		, q"{Леся}", q"{Ликера}", q"{Листвич}", q"{Лук’ян}", q"{Любава}"
		, q"{Любислава}", q"{Любов}", q"{Любодар}", q"{Любозар}", q"{Любомила}"
		, q"{Любомир}", q"{Любомира}", q"{Люборада}", q"{Любослава}"
		, q"{Людмила}", q"{Людомила}", q"{Лідія}", q"{Лілія}", q"{Майя}"
		, q"{Макар}", q"{Максим}", q"{Мальва}", q"{Марина}", q"{Марко}"
		, q"{Маркіян}", q"{Марта}", q"{Марічка}", q"{Марія}", q"{Мар’ян}"
		, q"{Мар’яна}", q"{Матвій}", q"{Меланія}", q"{Мечислав}"
		, q"{Мечислава}", q"{Микита}", q"{Микола}", q"{Милодара}"
		, q"{Милослава}", q"{Мирон}", q"{Мирослав}", q"{Мирослава}"
		, q"{Михайло}", q"{Мокрина}", q"{Мотря}", q"{Мстислав}", q"{Мстислава}"
		, q"{Мусій}", q"{Мілана}", q"{Надія}", q"{Назар}", q"{Назарій}"
		, q"{Наталія}", q"{Натан}", q"{Неля}", q"{Немир}", q"{Немира}"
		, q"{Нестор}", q"{Ніна}", q"{Огняна}", q"{Оксана}", q"{Олег}", q"{Олександр}"
		, q"{Олександра}", q"{Олексій}", q"{Олелько}", q"{Олена}"
		, q"{Олесь}", q"{Олеся}", q"{Ольга}", q"{Омелян}", q"{Орест}", q"{Ореста}"
		, q"{Орина}", q"{Орислава}", q"{Орися}", q"{Орхип}", q"{Оріяна}"
		, q"{Остап}", q"{Охрім}", q"{Павло}", q"{Павліна}", q"{Палажка}"
		, q"{Панас}", q"{Пантелеймон}", q"{Пелагея}", q"{Пелагія}"
		, q"{Петро}", q"{Пилип}", q"{Подолян}", q"{Поляна}", q"{Поліна}"
		, q"{Потап}", q"{Потішана}", q"{Радим}", q"{Радимир}", q"{Радміла}"
		, q"{Радослава}", q"{Ратибор}", q"{Ратимир}", q"{Раїна}", q"{Раїса}"
		, q"{Родослав}", q"{Родіон}", q"{Роксолан}", q"{Роксолана}"
		, q"{Роман}", q"{Ромена}", q"{Ростислав}", q"{Ростислава}"
		, q"{Руслан}", q"{Руслана}", q"{Святополк}", q"{Святослав}"
		, q"{Святослава}", q"{Світлана}", q"{Семибор}", q"{Сергій}"
		, q"{Синьоок}", q"{Слава}", q"{Славолюб}", q"{Славомир}", q"{Славута}"
		, q"{Сміяна}", q"{Сніжан}", q"{Сніжана}", q"{Сологуб}", q"{Соломія}"
		, q"{Соня}", q"{Софія}", q"{Станислава}", q"{Станіслав}", q"{Степан}"
		, q"{Стефаній}", q"{Стожар}", q"{Сюзана}", q"{Тамара}", q"{Тарас}"
		, q"{Таїсія}", q"{Тетяна}", q"{Тимофій}", q"{Тиміш}", q"{Тихон}"
		, q"{Тур}", q"{Устим}", q"{Устина}", q"{Фаїна}", q"{Февронія}"
		, q"{Федора}", q"{Феодосія}", q"{Харитина}", q"{Хвалимир}"
		, q"{Хорив}", q"{Христина}", q"{Христя}", q"{Чорнота}", q"{Щастислав}"
		, q"{Щек}", q"{Юліан}", q"{Юліанна}", q"{Юлія}", q"{Юрій}", q"{Юстина}"
		, q"{Юхим}", q"{Юхима}", q"{Юхимія}", q"{Ян}", q"{Яна}", q"{Ярема}"
		, q"{Ярина}", q"{Яровид}", q"{Яромил}", q"{Яромир}", q"{Ярополк}"
		, q"{Ярослав}", q"{Ярослава}" ];

		return choice(strs, this.rnd);
	}

	override string personMaleFirstName() {
		const string[] strs =
		[ q"{Августин}", q"{Аврелій}", q"{Адам}", q"{Адріян}", q"{Азарій}"
		, q"{Алевтин}", q"{Альберт}", q"{Анастас}", q"{Анастасій}"
		, q"{Анатолій}", q"{Андрій}", q"{Антін}", q"{Антон}", q"{Антоній}"
		, q"{Аркадій}", q"{Арсен}", q"{Арсеній}", q"{Артем}", q"{Архип}"
		, q"{Аскольд}", q"{Афанасій}", q"{Біломир}", q"{Білослав}"
		, q"{Богдан}", q"{Божемир}", q"{Божен}", q"{Болеслав}", q"{Боримир}"
		, q"{Боримисл}", q"{Борис}", q"{Борислав}", q"{Братимир}"
		, q"{Братислав}", q"{Братомил}", q"{Братослав}", q"{Брячислав}"
		, q"{Будимир}", q"{Буйтур}", q"{Буревіст}", q"{В’ячеслав}"
		, q"{Вадим}", q"{Валентин}", q"{Валерій}", q"{Василь}", q"{Велемир}"
		, q"{Віктор}", q"{Віталій}", q"{Влад}", q"{Владислав}", q"{Володимир}"
		, q"{Володислав}", q"{Всевлад}", q"{Всеволод}", q"{Всеслав}"
		, q"{Гаврило}", q"{Гарнослав}", q"{Геннадій}", q"{Георгій}"
		, q"{Герасим}", q"{Гліб}", q"{Гнат}", q"{Гордій}", q"{Горимир}"
		, q"{Горислав}", q"{Градимир}", q"{Григорій}", q"{Далемир}"
		, q"{Данило}", q"{Дарій}", q"{Даромир}", q"{Денис}", q"{Дмитро}"
		, q"{Добромир}", q"{Добромисл}", q"{Доброслав}", q"{Євген}"
		, q"{Єремій}", q"{Захар}", q"{Захарій}", q"{Зборислав}", q"{Звенигор}"
		, q"{Звенимир}", q"{Звенислав}", q"{Земислав}", q"{Зеновій}"
		, q"{Зиновій}", q"{Злат}", q"{Златомир}", q"{Зоремир}", q"{Зореслав}"
		, q"{Зорян}", q"{Іван}", q"{Ігор}", q"{Ізяслав}", q"{Ілля}", q"{Кий}"
		, q"{Корнелій}", q"{Корнилій}", q"{Корнило}", q"{Корній}"
		, q"{Костянтин}", q"{Кузьма}", q"{Лаврентій}", q"{Лаврін}"
		, q"{Лад}", q"{Ладислав}", q"{Ладо}", q"{Ладомир}", q"{Левко}"
		, q"{Листвич}", q"{Лук’ян}", q"{Любодар}", q"{Любозар}", q"{Любомир}"
		, q"{Макар}", q"{Максим}", q"{Мар’ян}", q"{Маркіян}", q"{Марко}"
		, q"{Матвій}", q"{Мечислав}", q"{Микита}", q"{Микола}", q"{Мирон}"
		, q"{Мирослав}", q"{Михайло}", q"{Мстислав}", q"{Мусій}", q"{Назар}"
		, q"{Назарій}", q"{Натан}", q"{Немир}", q"{Нестор}", q"{Олег}"
		, q"{Олександр}", q"{Олексій}", q"{Олелько}", q"{Олесь}", q"{Омелян}"
		, q"{Орест}", q"{Орхип}", q"{Остап}", q"{Охрім}", q"{Павло}", q"{Панас}"
		, q"{Пантелеймон}", q"{Петро}", q"{Пилип}", q"{Подолян}", q"{Потап}"
		, q"{Радим}", q"{Радимир}", q"{Ратибор}", q"{Ратимир}", q"{Родіон}"
		, q"{Родослав}", q"{Роксолан}", q"{Роман}", q"{Ростислав}"
		, q"{Руслан}", q"{Святополк}", q"{Святослав}", q"{Семибор}"
		, q"{Сергій}", q"{Синьоок}", q"{Славолюб}", q"{Славомир}"
		, q"{Славута}", q"{Сніжан}", q"{Сологуб}", q"{Станіслав}"
		, q"{Степан}", q"{Стефаній}", q"{Стожар}", q"{Тарас}", q"{Тиміш}"
		, q"{Тимофій}", q"{Тихон}", q"{Тур}", q"{Устим}", q"{Хвалимир}"
		, q"{Хорив}", q"{Чорнота}", q"{Щастислав}", q"{Щек}", q"{Юліан}"
		, q"{Юрій}", q"{Юхим}", q"{Ян}", q"{Ярема}", q"{Яровид}", q"{Яромил}"
		, q"{Яромир}", q"{Ярополк}", q"{Ярослав}" ];

		return choice(strs, this.rnd);
	}

	string personMaleLastName() {
		const string[] strs =
		[ q"{Андрухович}", q"{Бабух}", q"{Балабан}", q"{Балабух}", q"{Балакун}"
		, q"{Балицький}", q"{Бамбула}", q"{Бандера}", q"{Барановський}"
		, q"{Бачей}", q"{Башук}", q"{Бердник}", q"{Білич}", q"{Бондаренко}"
		, q"{Борецький}", q"{Боровський}", q"{Борочко}", q"{Боярчук}"
		, q"{Брицький}", q"{Бурмило}", q"{Бутько}", q"{Василин}", q"{Василишин}"
		, q"{Васильківський}", q"{Вергун}", q"{Вередун}", q"{Верещук}"
		, q"{Витребенько}", q"{Вітряк}", q"{Волощук}", q"{Гайдук}"
		, q"{Гайовий}", q"{Гайчук}", q"{Галаєнко}", q"{Галатей}", q"{Галаціон}"
		, q"{Гаман}", q"{Гамула}", q"{Ганич}", q"{Гарай}", q"{Гарун}", q"{Гладківський}"
		, q"{Гладух}", q"{Глинський}", q"{Гнатишин}", q"{Гойко}", q"{Головець}"
		, q"{Горбач}", q"{Гордійчук}", q"{Горовий}", q"{Городоцький}"
		, q"{Гречко}", q"{Григоришин}", q"{Гриневецький}", q"{Гриневський}"
		, q"{Гришко}", q"{Громико}", q"{Данилишин}", q"{Данилко}"
		, q"{Демків}", q"{Демчишин}", q"{Дзюб’як}", q"{Дзюба}", q"{Дідух}"
		, q"{Дмитришин}", q"{Дмитрук}", q"{Довгалевський}", q"{Дурдинець}"
		, q"{Євенко}", q"{Євпак}", q"{Ємець}", q"{Єрмак}", q"{Забіла}"
		, q"{Зварич}", q"{Зінкевич}", q"{Зленко}", q"{Іванишин}", q"{Іванів}"
		, q"{Іванців}", q"{Калач}", q"{Кандиба}", q"{Карпух}", q"{Каськів}"
		, q"{Кивач}", q"{Коваленко}", q"{Ковальський}", q"{Коломієць}"
		, q"{Коман}", q"{Компанієць}", q"{Кононець}", q"{Кордун}"
		, q"{Корецький}", q"{Корнїйчук}", q"{Коров’як}", q"{Коцюбинський}"
		, q"{Кулинич}", q"{Кульчицький}", q"{Лагойда}", q"{Лазірко}"
		, q"{Лановий}", q"{Латаний}", q"{Латанський}", q"{Лахман}"
		, q"{Левадовський}", q"{Ликович}", q"{Линдик}", q"{Ліхно}"
		, q"{Лобачевський}", q"{Ломовий}", q"{Луговий}", q"{Луцький}"
		, q"{Луцьків}", q"{Лученко}", q"{Лучко}", q"{Лютий}", q"{Лящук}"
		, q"{Магера}", q"{Мазайло}", q"{Мазило}", q"{Мазун}", q"{Майборода}"
		, q"{Майстренко}", q"{Маковецький}", q"{Малкович}", q"{Мамій}"
		, q"{Маринич}", q"{Марієвський}", q"{Марків}", q"{Махно}"
		, q"{Миклашевський}", q"{Миклухо}", q"{Милославський}"
		, q"{Михайлюк}", q"{Міняйло}", q"{Могилевський}", q"{Москаль}"
		, q"{Москалюк}", q"{Мотрієнко}", q"{Негода}", q"{Ногачевський}"
		, q"{Опенько}", q"{Осадко}", q"{Павленко}", q"{Павлишин}"
		, q"{Павлів}", q"{Пагутяк}", q"{Паламарчук}", q"{Палій}", q"{Паращук}"
		, q"{Пасічник}", q"{Пендик}", q"{Петик}", q"{Петлюра}", q"{Петренко}"
		, q"{Петрин}", q"{Петришин}", q"{Петрів}", q"{Плаксій}", q"{Погиба}"
		, q"{Поліщук}", q"{Пономарів}", q"{Поривай}", q"{Поривайло}"
		, q"{Потебенько}", q"{Потоцький}", q"{Пригода}", q"{Приймак}"
		, q"{Притула}", q"{Прядун}", q"{Розпутній}", q"{Романишин}"
		, q"{Романів}", q"{Ромей}", q"{Роменець}", q"{Ромочко}", q"{Савицький}"
		, q"{Саєнко}", q"{Свидригайло}", q"{Семеночко}", q"{Семещук}"
		, q"{Сердюк}", q"{Силецький}", q"{Сідлецький}", q"{Сідляк}"
		, q"{Сірко}", q"{Скиба}", q"{Скоропадський}", q"{Слободян}"
		, q"{Сосюра}", q"{Сплюх}", q"{Спотикач}", q"{Стахів}", q"{Степанець}"
		, q"{Стецьків}", q"{Стигайло}", q"{Сторожук}", q"{Сторчак}"
		, q"{Стоян}", q"{Сучак}", q"{Сушко}", q"{Тарасюк}", q"{Тиндарей}"
		, q"{Ткаченко}", q"{Третяк}", q"{Троян}", q"{Трублаєвський}"
		, q"{Трясило}", q"{Трясун}", q"{Уманець}", q"{Унич}", q"{Усич}"
		, q"{Федоришин}", q"{Хитрово}", q"{Цимбалістий}", q"{Цушко}"
		, q"{Червоній}", q"{Шамрило}", q"{Шевченко}", q"{Шестак}"
		, q"{Шиндарей}", q"{Шиян}", q"{Шкараба}", q"{Шудрик}", q"{Шумило}"
		, q"{Шупик}", q"{Шухевич}", q"{Щербак}", q"{Юрчишин}", q"{Юхно}"
		, q"{Ющик}", q"{Ющук}", q"{Яворівський}", q"{Яловий}", q"{Ялюк}"
		, q"{Янюк}", q"{Ярмак}", q"{Яцишин}", q"{Яцьків}", q"{Ящук}" ];

		return choice(strs, this.rnd);
	}

	override string personMaleMiddleName() {
		const string[] strs =
		[ q"{Адамович}", q"{Азарович}", q"{Алевтинович}", q"{Альбертович}"
		, q"{Анастасович}", q"{Анатолійович}", q"{Андрійович}"
		, q"{Антонович}", q"{Аркадійович}", q"{Арсенійович}"
		, q"{Арсенович}", q"{Артемович}", q"{Архипович}", q"{Аскольдович}"
		, q"{Афанасійович}", q"{Білославович}", q"{Богданович}"
		, q"{Божемирович}", q"{Боженович}", q"{Болеславович}"
		, q"{Боримирович}", q"{Борисович}", q"{Бориславович}"
		, q"{Братиславович}", q"{В’ячеславович}", q"{Вадимович}"
		, q"{Валентинович}", q"{Валерійович}", q"{Васильович}"
		, q"{Вікторович}", q"{Віталійович}", q"{Владиславович}"
		, q"{Володимирович}", q"{Всеволодович}", q"{Всеславович}"
		, q"{Гаврилович}", q"{Герасимович}", q"{Георгійович}"
		, q"{Гнатович}", q"{Гордійович}", q"{Григорійович}", q"{Данилович}"
		, q"{Даромирович}", q"{Денисович}", q"{Дмитрович}", q"{Добромирович}"
		, q"{Доброславович}", q"{Євгенович}", q"{Захарович}"
		, q"{Захарійович}", q"{Збориславович}", q"{Звенимирович}"
		, q"{Звениславович}", q"{Зеновійович}", q"{Зиновійович}"
		, q"{Златомирович}", q"{Зореславович}", q"{Іванович}"
		, q"{Ігорович}", q"{Ізяславович}", q"{Корнелійович}"
		, q"{Корнилович}", q"{Корнійович}", q"{Костянтинович}"
		, q"{Лаврентійович}", q"{Любомирович}", q"{Макарович}"
		, q"{Максимович}", q"{Маркович}", q"{Маркіянович}", q"{Матвійович}"
		, q"{Мечиславович}", q"{Микитович}", q"{Миколайович}"
		, q"{Миронович}", q"{Мирославович}", q"{Михайлович}"
		, q"{Мстиславович}", q"{Назарович}", q"{Назарійович}"
		, q"{Натанович}", q"{Немирович}", q"{Несторович}", q"{Олегович}"
		, q"{Олександрович}", q"{Олексійович}", q"{Олелькович}"
		, q"{Омелянович}", q"{Орестович}", q"{Орхипович}", q"{Остапович}"
		, q"{Охрімович}", q"{Павлович}", q"{Панасович}", q"{Пантелеймонович}"
		, q"{Петрович}", q"{Пилипович}", q"{Радимирович}", q"{Радимович}"
		, q"{Родіонович}", q"{Романович}", q"{Ростиславович}"
		, q"{Русланович}", q"{Святославович}", q"{Сергійович}"
		, q"{Славутович}", q"{Станіславович}", q"{Степанович}"
		, q"{Стефанович}", q"{Тарасович}", q"{Тимофійович}", q"{Тихонович}"
		, q"{Устимович}", q"{Юрійович}", q"{Юхимович}", q"{Ярославович}" ];

		return choice(strs, this.rnd);
	}

	override string personMalePrefix() {
		const string[] strs =
		[ q"{Пан}" ];

		return choice(strs, this.rnd);
	}

	override string personName() {
		const int rndInt = uniform(0, 4, this.rnd);

		if(rndInt >= 0 && rndInt < 1) {
			return personFirstName() ~ " " ~ personLastName();
		}
		if(rndInt >= 1 && rndInt < 2) {
			return personLastName() ~ " " ~ personFirstName();
		}
		if(rndInt >= 2 && rndInt < 3) {
			return personFirstName() ~ " " ~ personMiddleName() ~ " " ~ personLastName();
		}
		if(rndInt >= 3 && rndInt < 4) {
			return personLastName() ~ " " ~ personFirstName() ~ " " ~ personMiddleName();
		}

		return "";
	}

	override string personPrefix() {
		const string[] strs =
		[ q"{Пан}", q"{Пані}" ];

		return choice(strs, this.rnd);
	}

	override string personSuffix() {
		const string[] strs =
		[ q"{проф.}", q"{доц.}", q"{докт. пед. наук}", q"{докт. політ. наук}"
		, q"{докт. філол. наук}", q"{докт. філос. наук}", q"{докт. і. наук}"
		, q"{докт. юрид. наук}", q"{докт. техн. наук}", q"{докт. психол. наук}"
		, q"{канд. пед. наук}", q"{канд. політ. наук}", q"{канд. філол. наук}"
		, q"{канд. філос. наук}", q"{канд. і. наук}", q"{канд. юрид. наук}"
		, q"{канд. техн. наук}", q"{канд. психол. наук}" ];

		return choice(strs, this.rnd);
	}

	override string personTitleDescriptor() {
		const string[] strs =
		[ q"{Головний}", q"{Генеральний}", q"{Провідний}", q"{Національний}"
		, q"{Регіональний}", q"{Обласний}", q"{Районний}", q"{Глобальний}"
		, q"{Міжнародний}", q"{Центральний}" ];

		return choice(strs, this.rnd);
	}

	override string personTitleLevel() {
		const string[] strs =
		[ q"{маркетинговий}", q"{оптимізаційний}", q"{страховий}"
		, q"{функціональний}", q"{інтеграційний}", q"{логістичний}" ];

		return choice(strs, this.rnd);
	}

	override string personTitleJob() {
		const string[] strs =
		[ q"{інженер}", q"{агент}", q"{адміністратор}", q"{аналітик}"
		, q"{архітектор}", q"{дизайнер}", q"{керівник}", q"{консультант}"
		, q"{координатор}", q"{менеджер}", q"{планувальник}"
		, q"{помічник}", q"{розробник}", q"{спеціаліст}", q"{співробітник}"
		, q"{технік}" ];

		return choice(strs, this.rnd);
	}

	override string phoneNumberFormats() {
		const string[] strs =
		[ q"{(044) ###-##-##}", q"{(050) ###-##-##}", q"{(063) ###-##-##}", q"{(066) ###-##-##}"
		, q"{(073) ###-##-##}", q"{(091) ###-##-##}", q"{(092) ###-##-##}", q"{(093) ###-##-##}"
		, q"{(094) ###-##-##}", q"{(095) ###-##-##}", q"{(096) ###-##-##}", q"{(097) ###-##-##}"
		, q"{(098) ###-##-##}", q"{(099) ###-##-##}" ];

		return numberBuild(choice(strs, this.rnd));
	}

}
